- external: ecs
  name: cloud.account.id
- external: ecs
  name: cloud.account.name
- external: ecs
  name: cloud.availability_zone
- external: ecs
  name: cloud.instance.id
- external: ecs
  name: cloud.instance.name
- external: ecs
  name: cloud.machine.type
- external: ecs
  name: cloud.project.id
- external: ecs
  name: cloud.provider
- external: ecs
  name: cloud.region
- external: ecs
  name: container.id
- external: ecs
  name: container.image.name
- external: ecs
  name: container.labels
- external: ecs
  name: container.name
- external: ecs
  name: ecs.version
- external: ecs
  name: event.category
- external: ecs
  name: event.created
- external: ecs
  name: event.kind
- external: ecs
  name: event.original
- external: ecs
  name: event.severity
- external: ecs
  name: event.type
- external: ecs
  name: host.architecture
- external: ecs
  name: host.domain
- external: ecs
  name: host.hostname
- external: ecs
  name: host.id
- external: ecs
  name: host.ip
- external: ecs
  name: host.mac
- external: ecs
  name: host.name
- external: ecs
  name: host.os.family
- external: ecs
  name: host.os.kernel
- external: ecs
  name: host.os.name
- external: ecs
  name: host.os.platform
- external: ecs
  name: host.os.version
- external: ecs
  name: host.type
- external: ecs
  name: message
- external: ecs
  name: network.transport
- external: ecs
  name: related.hash
- external: ecs
  name: related.ip
- external: ecs
  name: tags
- external: ecs
  name: vulnerability.id
- external: ecs
  name: vulnerability.reference
- external: ecs
  name: vulnerability.score.base
- external: ecs
  name: vulnerability.score.version
- external: ecs
  name: vulnerability.severity
- external: ecs
  name: event.dataset
  type: constant_keyword
