# Define ECS constant fields as constant_keyword
- name: event.kind
  external: ecs
  type: constant_keyword
- name: observer.vendor
  external: ecs
  type: constant_keyword
- name: vulnerability.scanner.vendor
  external: ecs
  type: constant_keyword
# Other ECS fields
- name: agent.ephemeral_id
  external: ecs
- name: agent.id
  external: ecs
- name: agent.name
  external: ecs
- name: agent.type
  external: ecs
- name: agent.version
  external: ecs
- name: cloud.account.id
  external: ecs
- name: cloud.availability_zone
  external: ecs
- name: cloud.instance.id
  external: ecs
- name: cloud.instance.name
  external: ecs
- name: cloud.machine.type
  external: ecs
- name: cloud.provider
  external: ecs
- name: cloud.region
  external: ecs
- name: cloud.service.name
  external: ecs
- name: ecs.version
  external: ecs
- name: event.agent_id_status
  external: ecs
- name: event.category
  external: ecs
- name: event.id
  external: ecs
- name: event.ingested
  external: ecs
- name: event.original
  external: ecs
- name: event.type
  external: ecs
- name: host.domain
  external: ecs
- name: host.id
  external: ecs
- name: host.ip
  external: ecs
- name: host.name
  external: ecs
- name: host.os.full
  external: ecs
- name: host.os.platform
  external: ecs
- name: host.os.type
  external: ecs
- name: package.name
  external: ecs
- name: package.version
  external: ecs
- name: related.hosts
  external: ecs
- name: related.ip
  external: ecs
- name: tags
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.enumeration
  external: ecs
- name: vulnerability.id
  external: ecs
- name: vulnerability.score.base
  external: ecs
- name: vulnerability.score.version
  external: ecs
- name: vulnerability.severity
  external: ecs
