{
    "attributes": {
        "title": "[Logs FortiAuthenticator] Admin Configuration Audit",
        "description": "Administrative changes on FortiAuthenticator: user account creation, modification, deletion, and token assignments.",
        "panelsJSON": [
            {
                "panelIndex": "b901510e-4e89-757d-3ffc-2ddd1d265e5a",
                "gridData": {
                    "x": 0,
                    "y": 0,
                    "w": 48,
                    "h": 3,
                    "i": "b901510e-4e89-757d-3ffc-2ddd1d265e5a"
                },
                "type": "links",
                "embeddableConfig": {
                    "enhancements": {},
                    "attributes": {
                        "layout": "horizontal",
                        "links": [
                            {
                                "id": "3af4ba12-6f83-488a-bdc9-0c7216a22d73",
                                "order": 0,
                                "label": "Overview",
                                "type": "dashboardLink",
                                "destinationRefName": "link_3af4ba12-6f83-488a-bdc9-0c7216a22d73_dashboard"
                            },
                            {
                                "id": "85cbe962-a65c-5a52-ac29-31c83f2ee37e",
                                "order": 1,
                                "label": "Authentication",
                                "type": "dashboardLink",
                                "destinationRefName": "link_85cbe962-a65c-5a52-ac29-31c83f2ee37e_dashboard"
                            },
                            {
                                "id": "f8015227-17d1-b054-2b9c-b33d24cec76d",
                                "order": 2,
                                "label": "Admin Configuration Audit",
                                "type": "dashboardLink",
                                "destinationRefName": "link_f8015227-17d1-b054-2b9c-b33d24cec76d_dashboard"
                            },
                            {
                                "id": "72ea9ac7-2987-7cf7-6e6c-311078031348",
                                "order": 3,
                                "label": "System and HA",
                                "type": "dashboardLink",
                                "destinationRefName": "link_72ea9ac7-2987-7cf7-6e6c-311078031348_dashboard"
                            }
                        ]
                    }
                }
            },
            {
                "panelIndex": "0e57b144-ac09-3b98-3db2-6c0dad9c387f",
                "gridData": {
                    "x": 0,
                    "y": 3,
                    "w": 16,
                    "h": 10,
                    "i": "0e57b144-ac09-3b98-3db2-6c0dad9c387f"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Distribution of Events by Action",
                        "visualizationType": "lnsPie",
                        "type": "lens",
                        "references": [],
                        "state": {
                            "visualization": {
                                "layers": [
                                    {
                                        "layerId": "4f2c021d-3af4-ce17-4e59-a14d4d9f6641",
                                        "layerType": "data",
                                        "colorMapping": {
                                            "assignments": [],
                                            "specialAssignments": [
                                                {
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "touched": false
                                                }
                                            ],
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "colorMode": {
                                                "type": "categorical"
                                            }
                                        },
                                        "primaryGroups": [
                                            "069a9c5c-3ec5-e96a-a89c-5b796baa7045"
                                        ],
                                        "metrics": [
                                            "0cb3e3d7-c9da-1181-40f5-5b94be7f1201"
                                        ],
                                        "numberDisplay": "percent",
                                        "categoryDisplay": "default",
                                        "legendDisplay": "default",
                                        "legendPosition": "right",
                                        "nestedLegend": false,
                                        "emptySizeRatio": 0.3
                                    }
                                ],
                                "shape": "donut"
                            },
                            "query": {
                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n  AND fortinet.fortiauthenticator.log.action IS NOT NULL\n  AND fortinet.fortiauthenticator.log.action != \"\"\n| STATS count = COUNT(*) BY fortinet.fortiauthenticator.log.action\n| SORT count DESC\n| LIMIT 7\n"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "textBased": {
                                    "layers": {
                                        "4f2c021d-3af4-ce17-4e59-a14d4d9f6641": {
                                            "query": {
                                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n  AND fortinet.fortiauthenticator.log.action IS NOT NULL\n  AND fortinet.fortiauthenticator.log.action != \"\"\n| STATS count = COUNT(*) BY fortinet.fortiauthenticator.log.action\n| SORT count DESC\n| LIMIT 7\n"
                                            },
                                            "columns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "fortinet.fortiauthenticator.log.action",
                                                    "columnId": "069a9c5c-3ec5-e96a-a89c-5b796baa7045",
                                                    "label": "fortinet.fortiauthenticator.log.action",
                                                    "customLabel": false
                                                }
                                            ],
                                            "allColumns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "fortinet.fortiauthenticator.log.action",
                                                    "columnId": "069a9c5c-3ec5-e96a-a89c-5b796baa7045",
                                                    "label": "fortinet.fortiauthenticator.log.action",
                                                    "customLabel": false
                                                }
                                            ],
                                            "timeField": "@timestamp"
                                        }
                                    }
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "05441ad4-0192-717c-eefe-f459c20742e3",
                "gridData": {
                    "x": 16,
                    "y": 3,
                    "w": 16,
                    "h": 10,
                    "i": "05441ad4-0192-717c-eefe-f459c20742e3"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Distribution of Events by Type",
                        "visualizationType": "lnsPie",
                        "type": "lens",
                        "references": [],
                        "state": {
                            "visualization": {
                                "layers": [
                                    {
                                        "layerId": "5df28c4b-f03a-2514-97be-efe34516e918",
                                        "layerType": "data",
                                        "colorMapping": {
                                            "assignments": [],
                                            "specialAssignments": [
                                                {
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "touched": false
                                                }
                                            ],
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "colorMode": {
                                                "type": "categorical"
                                            }
                                        },
                                        "primaryGroups": [
                                            "5a76efd9-6cd6-fa27-8e54-cef9c4d4a012"
                                        ],
                                        "metrics": [
                                            "0cb3e3d7-c9da-1181-40f5-5b94be7f1201"
                                        ],
                                        "numberDisplay": "percent",
                                        "categoryDisplay": "default",
                                        "legendDisplay": "default",
                                        "legendPosition": "right",
                                        "nestedLegend": false,
                                        "emptySizeRatio": 0.3
                                    }
                                ],
                                "shape": "donut"
                            },
                            "query": {
                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n| MV_EXPAND event.type\n| STATS count = COUNT(*) BY event.type\n| SORT count DESC\n| LIMIT 7\n"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "textBased": {
                                    "layers": {
                                        "5df28c4b-f03a-2514-97be-efe34516e918": {
                                            "query": {
                                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n| MV_EXPAND event.type\n| STATS count = COUNT(*) BY event.type\n| SORT count DESC\n| LIMIT 7\n"
                                            },
                                            "columns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "event.type",
                                                    "columnId": "5a76efd9-6cd6-fa27-8e54-cef9c4d4a012",
                                                    "label": "event.type",
                                                    "customLabel": false
                                                }
                                            ],
                                            "allColumns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "event.type",
                                                    "columnId": "5a76efd9-6cd6-fa27-8e54-cef9c4d4a012",
                                                    "label": "event.type",
                                                    "customLabel": false
                                                }
                                            ],
                                            "timeField": "@timestamp"
                                        }
                                    }
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "c4e63202-9dbe-df34-f1fd-92956abca1a8",
                "gridData": {
                    "x": 32,
                    "y": 3,
                    "w": 16,
                    "h": 10,
                    "i": "c4e63202-9dbe-df34-f1fd-92956abca1a8"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Distribution of Changed Fields",
                        "visualizationType": "lnsPie",
                        "type": "lens",
                        "references": [],
                        "state": {
                            "visualization": {
                                "layers": [
                                    {
                                        "layerId": "d1509284-17ec-7fe3-c519-ef22572508e7",
                                        "layerType": "data",
                                        "colorMapping": {
                                            "assignments": [],
                                            "specialAssignments": [
                                                {
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "touched": false
                                                }
                                            ],
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "colorMode": {
                                                "type": "categorical"
                                            }
                                        },
                                        "primaryGroups": [
                                            "019c078f-5312-49e4-ab66-0f1151f52ef3"
                                        ],
                                        "metrics": [
                                            "0cb3e3d7-c9da-1181-40f5-5b94be7f1201"
                                        ],
                                        "numberDisplay": "percent",
                                        "categoryDisplay": "default",
                                        "legendDisplay": "default",
                                        "legendPosition": "right",
                                        "nestedLegend": false,
                                        "emptySizeRatio": 0.3
                                    }
                                ],
                                "shape": "donut"
                            },
                            "query": {
                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n  AND fortinet.fortiauthenticator.log.changes IS NOT NULL\n| MV_EXPAND fortinet.fortiauthenticator.log.changes\n| STATS count = COUNT(*) BY fortinet.fortiauthenticator.log.changes\n| SORT count DESC\n| LIMIT 7\n"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "textBased": {
                                    "layers": {
                                        "d1509284-17ec-7fe3-c519-ef22572508e7": {
                                            "query": {
                                                "esql": "FROM logs-*\n| WHERE data_stream.dataset == \"fortinet_fortiauthenticator.log\"\n| WHERE fortinet.fortiauthenticator.log.subcategory == \"Admin Configuration\"\n  AND fortinet.fortiauthenticator.log.changes IS NOT NULL\n| MV_EXPAND fortinet.fortiauthenticator.log.changes\n| STATS count = COUNT(*) BY fortinet.fortiauthenticator.log.changes\n| SORT count DESC\n| LIMIT 7\n"
                                            },
                                            "columns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "fortinet.fortiauthenticator.log.changes",
                                                    "columnId": "019c078f-5312-49e4-ab66-0f1151f52ef3",
                                                    "label": "fortinet.fortiauthenticator.log.changes",
                                                    "customLabel": false
                                                }
                                            ],
                                            "allColumns": [
                                                {
                                                    "fieldName": "count",
                                                    "columnId": "0cb3e3d7-c9da-1181-40f5-5b94be7f1201",
                                                    "label": "Events",
                                                    "customLabel": true,
                                                    "meta": {
                                                        "type": "number",
                                                        "esType": "long"
                                                    },
                                                    "inMetricDimension": true
                                                },
                                                {
                                                    "fieldName": "fortinet.fortiauthenticator.log.changes",
                                                    "columnId": "019c078f-5312-49e4-ab66-0f1151f52ef3",
                                                    "label": "fortinet.fortiauthenticator.log.changes",
                                                    "customLabel": false
                                                }
                                            ],
                                            "timeField": "@timestamp"
                                        }
                                    }
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "fb04be40-3666-9d17-8ed5-6509ed79baae",
                "gridData": {
                    "x": 0,
                    "y": 13,
                    "w": 24,
                    "h": 12,
                    "i": "fb04be40-3666-9d17-8ed5-6509ed79baae"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Top 10 Admins Performing Changes",
                        "visualizationType": "lnsDatatable",
                        "type": "lens",
                        "references": [
                            {
                                "type": "index-pattern",
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-97234203-1bdd-d1a4-3cf8-b6092bab081c"
                            }
                        ],
                        "state": {
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "2643bd1b-75d2-6801-f9a0-6e856200de86",
                                        "isTransposed": false,
                                        "isMetric": false
                                    },
                                    {
                                        "columnId": "e64a3706-4ce0-bea2-823d-450c06a9d293",
                                        "isTransposed": false,
                                        "isMetric": true
                                    }
                                ],
                                "layerId": "97234203-1bdd-d1a4-3cf8-b6092bab081c",
                                "layerType": "data"
                            },
                            "query": {
                                "query": "data_stream.dataset:fortinet_fortiauthenticator.log AND fortinet.fortiauthenticator.log.subcategory:\"Admin Configuration\" AND user.name:*",
                                "language": "kuery"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "formBased": {
                                    "layers": {
                                        "97234203-1bdd-d1a4-3cf8-b6092bab081c": {
                                            "columns": {
                                                "2643bd1b-75d2-6801-f9a0-6e856200de86": {
                                                    "label": "Admin",
                                                    "dataType": "string",
                                                    "customLabel": true,
                                                    "operationType": "terms",
                                                    "isBucketed": true,
                                                    "scale": "ordinal",
                                                    "params": {
                                                        "size": 10,
                                                        "orderBy": {
                                                            "type": "column",
                                                            "columnId": "e64a3706-4ce0-bea2-823d-450c06a9d293"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "missingBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "include": [],
                                                        "exclude": [],
                                                        "includeIsRegex": false,
                                                        "excludeIsRegex": false
                                                    },
                                                    "sourceField": "user.name"
                                                },
                                                "e64a3706-4ce0-bea2-823d-450c06a9d293": {
                                                    "label": "Changes",
                                                    "dataType": "number",
                                                    "customLabel": true,
                                                    "operationType": "count",
                                                    "isBucketed": false,
                                                    "scale": "ratio",
                                                    "sourceField": "___records___",
                                                    "params": {
                                                        "emptyAsNull": true
                                                    }
                                                }
                                            },
                                            "columnOrder": [
                                                "2643bd1b-75d2-6801-f9a0-6e856200de86",
                                                "e64a3706-4ce0-bea2-823d-450c06a9d293"
                                            ],
                                            "incompleteColumns": {},
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "0efe5fda-5a02-e0e1-800e-60920186917f",
                "gridData": {
                    "x": 24,
                    "y": 13,
                    "w": 24,
                    "h": 12,
                    "i": "0efe5fda-5a02-e0e1-800e-60920186917f"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Top 10 Target Accounts",
                        "visualizationType": "lnsDatatable",
                        "type": "lens",
                        "references": [
                            {
                                "type": "index-pattern",
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-8874c05f-8ca9-7d94-4cf6-d524f4806848"
                            }
                        ],
                        "state": {
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "6263045d-7676-e1a4-12b0-54571255453d",
                                        "isTransposed": false,
                                        "isMetric": false
                                    },
                                    {
                                        "columnId": "e64a3706-4ce0-bea2-823d-450c06a9d293",
                                        "isTransposed": false,
                                        "isMetric": true
                                    }
                                ],
                                "layerId": "8874c05f-8ca9-7d94-4cf6-d524f4806848",
                                "layerType": "data"
                            },
                            "query": {
                                "query": "data_stream.dataset:fortinet_fortiauthenticator.log AND fortinet.fortiauthenticator.log.subcategory:\"Admin Configuration\" AND user.target.name:*",
                                "language": "kuery"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "formBased": {
                                    "layers": {
                                        "8874c05f-8ca9-7d94-4cf6-d524f4806848": {
                                            "columns": {
                                                "6263045d-7676-e1a4-12b0-54571255453d": {
                                                    "label": "Target",
                                                    "dataType": "string",
                                                    "customLabel": true,
                                                    "operationType": "terms",
                                                    "isBucketed": true,
                                                    "scale": "ordinal",
                                                    "params": {
                                                        "size": 10,
                                                        "orderBy": {
                                                            "type": "column",
                                                            "columnId": "e64a3706-4ce0-bea2-823d-450c06a9d293"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "missingBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "include": [],
                                                        "exclude": [],
                                                        "includeIsRegex": false,
                                                        "excludeIsRegex": false
                                                    },
                                                    "sourceField": "user.target.name"
                                                },
                                                "e64a3706-4ce0-bea2-823d-450c06a9d293": {
                                                    "label": "Changes",
                                                    "dataType": "number",
                                                    "customLabel": true,
                                                    "operationType": "count",
                                                    "isBucketed": false,
                                                    "scale": "ratio",
                                                    "sourceField": "___records___",
                                                    "params": {
                                                        "emptyAsNull": true
                                                    }
                                                }
                                            },
                                            "columnOrder": [
                                                "6263045d-7676-e1a4-12b0-54571255453d",
                                                "e64a3706-4ce0-bea2-823d-450c06a9d293"
                                            ],
                                            "incompleteColumns": {},
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "a2e4be51-44ce-0063-4ba7-5d7b1bac43c7",
                "gridData": {
                    "x": 0,
                    "y": 25,
                    "w": 48,
                    "h": 12,
                    "i": "a2e4be51-44ce-0063-4ba7-5d7b1bac43c7"
                },
                "type": "lens",
                "embeddableConfig": {
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "attributes": {
                        "title": "Account Change Details",
                        "visualizationType": "lnsDatatable",
                        "type": "lens",
                        "references": [
                            {
                                "type": "index-pattern",
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-456f9b89-bac9-901f-8c8b-a5a967c3cba5"
                            }
                        ],
                        "state": {
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "31e44861-6c19-cf13-c780-c5bb26c57cce",
                                        "isTransposed": false,
                                        "isMetric": false
                                    },
                                    {
                                        "columnId": "0742c066-4ccc-2539-6baf-064879a8fdd3",
                                        "isTransposed": false,
                                        "isMetric": false
                                    },
                                    {
                                        "columnId": "1d4f0601-720e-be3a-2d5f-2f5bf1678d44",
                                        "isTransposed": false,
                                        "isMetric": false
                                    },
                                    {
                                        "columnId": "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e",
                                        "isTransposed": false,
                                        "isMetric": true
                                    }
                                ],
                                "layerId": "456f9b89-bac9-901f-8c8b-a5a967c3cba5",
                                "layerType": "data"
                            },
                            "query": {
                                "query": "data_stream.dataset:fortinet_fortiauthenticator.log AND fortinet.fortiauthenticator.log.subcategory:\"Admin Configuration\"",
                                "language": "kuery"
                            },
                            "filters": [],
                            "datasourceStates": {
                                "formBased": {
                                    "layers": {
                                        "456f9b89-bac9-901f-8c8b-a5a967c3cba5": {
                                            "columns": {
                                                "31e44861-6c19-cf13-c780-c5bb26c57cce": {
                                                    "label": "Event Action",
                                                    "dataType": "string",
                                                    "customLabel": true,
                                                    "operationType": "terms",
                                                    "isBucketed": true,
                                                    "scale": "ordinal",
                                                    "params": {
                                                        "size": 20,
                                                        "orderBy": {
                                                            "type": "column",
                                                            "columnId": "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "missingBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "include": [],
                                                        "exclude": [],
                                                        "includeIsRegex": false,
                                                        "excludeIsRegex": false
                                                    },
                                                    "sourceField": "event.action"
                                                },
                                                "0742c066-4ccc-2539-6baf-064879a8fdd3": {
                                                    "label": "Admin",
                                                    "dataType": "string",
                                                    "customLabel": true,
                                                    "operationType": "terms",
                                                    "isBucketed": true,
                                                    "scale": "ordinal",
                                                    "params": {
                                                        "size": 20,
                                                        "orderBy": {
                                                            "type": "column",
                                                            "columnId": "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "missingBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "include": [],
                                                        "exclude": [],
                                                        "includeIsRegex": false,
                                                        "excludeIsRegex": false
                                                    },
                                                    "sourceField": "user.name"
                                                },
                                                "1d4f0601-720e-be3a-2d5f-2f5bf1678d44": {
                                                    "label": "Target Account",
                                                    "dataType": "string",
                                                    "customLabel": true,
                                                    "operationType": "terms",
                                                    "isBucketed": true,
                                                    "scale": "ordinal",
                                                    "params": {
                                                        "size": 20,
                                                        "orderBy": {
                                                            "type": "column",
                                                            "columnId": "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "missingBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "include": [],
                                                        "exclude": [],
                                                        "includeIsRegex": false,
                                                        "excludeIsRegex": false
                                                    },
                                                    "sourceField": "user.target.name"
                                                },
                                                "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e": {
                                                    "label": "Count",
                                                    "dataType": "number",
                                                    "customLabel": true,
                                                    "operationType": "count",
                                                    "isBucketed": false,
                                                    "scale": "ratio",
                                                    "sourceField": "___records___",
                                                    "params": {
                                                        "emptyAsNull": true
                                                    }
                                                }
                                            },
                                            "columnOrder": [
                                                "31e44861-6c19-cf13-c780-c5bb26c57cce",
                                                "0742c066-4ccc-2539-6baf-064879a8fdd3",
                                                "1d4f0601-720e-be3a-2d5f-2f5bf1678d44",
                                                "e293e1d8-19e0-ece8-e7f3-a0b190c5d64e"
                                            ],
                                            "incompleteColumns": {},
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "internalReferences": [],
                            "adHocDataViews": {}
                        }
                    },
                    "syncTooltips": false,
                    "syncColors": false,
                    "syncCursor": true,
                    "filters": [],
                    "query": {
                        "query": "",
                        "language": "kuery"
                    }
                }
            },
            {
                "panelIndex": "a89869d9-659f-675d-3525-5f9de12f93aa",
                "gridData": {
                    "x": 0,
                    "y": 37,
                    "w": 48,
                    "h": 15,
                    "i": "a89869d9-659f-675d-3525-5f9de12f93aa"
                },
                "type": "search",
                "panelRefName": "a89869d9-659f-675d-3525-5f9de12f93aa:panel_a89869d9-659f-675d-3525-5f9de12f93aa",
                "embeddableConfig": {
                    "title": "Log Stream",
                    "enhancements": {},
                    "savedObjectId": "fortinet_fortiauthenticator-admin-config-events"
                }
            }
        ],
        "optionsJSON": {
            "useMargins": true,
            "syncColors": false,
            "syncCursor": true,
            "syncTooltips": false,
            "hidePanelTitles": false
        },
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "disabled": false,
                            "negate": false,
                            "alias": null,
                            "type": "phrase",
                            "key": "data_stream.dataset",
                            "field": "data_stream.dataset",
                            "params": {
                                "query": "fortinet_fortiauthenticator.log"
                            }
                        },
                        "query": {
                            "match_phrase": {
                                "data_stream.dataset": "fortinet_fortiauthenticator.log"
                            }
                        }
                    }
                ],
                "query": {
                    "query": "",
                    "language": "kuery"
                }
            }
        },
        "timeRestore": false,
        "version": 1,
        "controlGroupInput": {
            "chainingSystem": "HIERARCHICAL",
            "controlStyle": "oneLine",
            "ignoreParentSettingsJSON": {
                "ignoreFilters": false,
                "ignoreQuery": false,
                "ignoreTimerange": false,
                "ignoreValidations": false
            },
            "panelsJSON": {
                "0cdfdf58-1970-368e-3e5f-023bd0f92321": {
                    "grow": false,
                    "order": 0,
                    "width": "medium",
                    "type": "optionsListControl",
                    "explicitInput": {
                        "id": "0cdfdf58-1970-368e-3e5f-023bd0f92321",
                        "dataViewId": "logs-*",
                        "fieldName": "event.action",
                        "title": "Event Action",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        }
                    }
                },
                "ba8d3c8e-a233-e1cc-d519-87e4a509fd0f": {
                    "grow": false,
                    "order": 1,
                    "width": "medium",
                    "type": "optionsListControl",
                    "explicitInput": {
                        "id": "ba8d3c8e-a233-e1cc-d519-87e4a509fd0f",
                        "dataViewId": "logs-*",
                        "fieldName": "event.type",
                        "title": "Event Type",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        }
                    }
                },
                "3f34fc08-59e7-5414-75c4-7f4095b40df2": {
                    "grow": false,
                    "order": 2,
                    "width": "medium",
                    "type": "optionsListControl",
                    "explicitInput": {
                        "id": "3f34fc08-59e7-5414-75c4-7f4095b40df2",
                        "dataViewId": "logs-*",
                        "fieldName": "user.name",
                        "title": "Admin",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        }
                    }
                }
            },
            "showApplySelections": false
        }
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2023-10-01T00:00:00Z",
    "created_by": "admin",
    "id": "fortinet_fortiauthenticator-admin-audit",
    "managed": false,
    "references": [
        {
            "type": "dashboard",
            "id": "fortinet_fortiauthenticator-overview",
            "name": "b901510e-4e89-757d-3ffc-2ddd1d265e5a:link_3af4ba12-6f83-488a-bdc9-0c7216a22d73_dashboard"
        },
        {
            "type": "dashboard",
            "id": "fortinet_fortiauthenticator-authentication",
            "name": "b901510e-4e89-757d-3ffc-2ddd1d265e5a:link_85cbe962-a65c-5a52-ac29-31c83f2ee37e_dashboard"
        },
        {
            "type": "dashboard",
            "id": "fortinet_fortiauthenticator-admin-audit",
            "name": "b901510e-4e89-757d-3ffc-2ddd1d265e5a:link_f8015227-17d1-b054-2b9c-b33d24cec76d_dashboard"
        },
        {
            "type": "dashboard",
            "id": "fortinet_fortiauthenticator-system",
            "name": "b901510e-4e89-757d-3ffc-2ddd1d265e5a:link_72ea9ac7-2987-7cf7-6e6c-311078031348_dashboard"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "fb04be40-3666-9d17-8ed5-6509ed79baae:indexpattern-datasource-layer-97234203-1bdd-d1a4-3cf8-b6092bab081c"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "0efe5fda-5a02-e0e1-800e-60920186917f:indexpattern-datasource-layer-8874c05f-8ca9-7d94-4cf6-d524f4806848"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "a2e4be51-44ce-0063-4ba7-5d7b1bac43c7:indexpattern-datasource-layer-456f9b89-bac9-901f-8c8b-a5a967c3cba5"
        },
        {
            "type": "search",
            "id": "fortinet_fortiauthenticator-admin-config-events",
            "name": "a89869d9-659f-675d-3525-5f9de12f93aa:panel_a89869d9-659f-675d-3525-5f9de12f93aa"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "controlGroup_0cdfdf58-1970-368e-3e5f-023bd0f92321:optionsListDataView"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "controlGroup_ba8d3c8e-a233-e1cc-d519-87e4a509fd0f:optionsListDataView"
        },
        {
            "type": "index-pattern",
            "id": "logs-*",
            "name": "controlGroup_3f34fc08-59e7-5414-75c4-7f4095b40df2:optionsListDataView"
        }
    ],
    "type": "dashboard",
    "typeMigrationVersion": "10.2.0",
    "updated_at": "2023-10-01T00:00:00Z",
    "updated_by": "admin",
    "version": "1"
}