{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "A supervised machine learning model has identified a DNS question name with a high probability of sourcing from a Domain Generation Algorithm (DGA),\nwhich could indicate command and control network activity.\n",
        "language": "kuery",
        "license": "Elastic License",
        "max_signals": 10000,
        "name": "Machine Learning Detected a DNS Request With a High DGA Probability Score",
        "query": "event.category:network and network.protocol:dns and ml_is_dga.malicious_probability \u003e 0.98\n",
        "risk_score": 21,
        "rule_id": "a020dadb-3da2-4252-91e9-b0fc148823e2",
        "severity": "low",
        "tags": [
            "Elastic",
            "ML-DGA"
        ],
        "type": "query",
        "version": 2
    },
    "id": "a020dadb-3da2-4252-91e9-b0fc148823e2",
    "type": "security-rule"
}