# Datastream Ffields (copied from ti_anomali/data_stream/threatstream/fields/fields.yml)
- name: anomali.threatstream
  type: group
  description: >
    Fields for Anomali Threatstream

  fields:
    - name: classification
      type: keyword
      description: >
        Indicates whether an indicator is private or from a public feed and available publicly. Possible values: private, public.

      example: private
    - name: confidence
      type: short
      description: >
        The measure of the accuracy (from 0 to 100) assigned by ThreatStream's predictive analytics technology to indicators.

    - name: detail2
      type: text
      description: >
        Detail text for indicator.

      example: Imported by user 42.
    - name: id
      type: keyword
      description: >
        The ID of the indicator.

    - name: import_session_id
      type: keyword
      description: >
        ID of the import session that created the indicator on ThreatStream.

    - name: itype
      type: keyword
      description: >
        Indicator type. Possible values: "apt_domain", "apt_email", "apt_ip", "apt_url", "bot_ip", "c2_domain", "c2_ip", "c2_url", "i2p_ip", "mal_domain", "mal_email", "mal_ip", "mal_md5", "mal_url", "parked_ip", "phish_email", "phish_ip", "phish_url", "scan_ip", "spam_domain", "ssh_ip", "suspicious_domain", "tor_ip" and "torrent_tracker_url".

    - name: maltype
      type: wildcard
      description: >
        Information regarding a malware family, a CVE ID, or another attack or threat, associated with the indicator.

    - name: md5
      type: keyword
      description: >
        Hash for the indicator.

    - name: resource_uri
      type: keyword
      description: >
        Relative URI for the indicator details.

    - name: severity
      type: keyword
      description: >
        Criticality associated with the threat feed that supplied the indicator. Possible values: low, medium, high, very-high.

    - name: source
      type: keyword
      description: >
        Source for the indicator.

      example: Analyst
    - name: source_feed_id
      type: keyword
      description: >
        ID for the integrator source.

    - name: state
      type: keyword
      description: >
        State for this indicator.

      example: active
    - name: trusted_circle_ids
      type: keyword
      description: >
        ID of the trusted circle that imported the indicator.

    - name: update_id
      type: keyword
      description: >
        Update ID.

    - name: url
      type: keyword
      description: >
        URL for the indicator.

    - name: value_type
      type: keyword
      description: >-
        Data type of the indicator. Possible values: ip, domain, url, email, md5.
    - name: added_at
      type: date
      description: >-
        Date when IOC was added.
    - name: deleted_at
      type: date
      description: >-
        Date when IOC was deleted/expired.
# ECS fields (copied from ti_anomali/data_stream/threatstream/fields/ecs.yml)
# - name: ecs
#   type: group
#   description: Anomali destination ECS fields
#   fields:
- external: ecs
  name: ecs.version
- name: message
  type: match_only_text
- external: ecs
  name: tags
- name: error.message
  type: match_only_text
- name: event.severity
  type: long
- external: ecs
  name: event.category
- name: event.ingested
  type: date
  format: strict_date_time_no_millis||strict_date_optional_time||epoch_millis
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- name: event.created
  type: date
- external: ecs
  name: event.original
- name: threat.indicator.first_seen
  type: date
- name: threat.indicator.last_seen
  type: date
- external: ecs
  name: threat.indicator.type
- name: threat.indicator.ip
  type: ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- name: threat.indicator.url.path
  type: wildcard
- name: threat.indicator.url.port
  type: long
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.marking.tlp
- external: ecs
  name: threat.indicator.confidence
- name: threat.indicator.as.number
  type: long
- external: ecs
  name: threat.indicator.as.organization.name
- name: threat.indicator.geo.location
  type: geo_point
- external: ecs
  name: threat.indicator.geo.country_iso_code
- external: ecs
  name: labels
# Beats fields (copied from ti_anomali/data_stream/threatstream/fields/beats.yml)
- name: input.type
  type: keyword
  description: Type of Filebeat input.
- name: log.flags
  type: keyword
  description: Flags for the log file.
- name: log.offset
  type: long
  description: Offset of the entry in the log file.
- name: log.file.path
  type: keyword
  description: Path to the log file.
# Base fields (copied from ti_anomali/data_stream/threatstream/fields/base-fields.yml)
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset name.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_anomali
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_anomali.threatstream
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: Anomali ThreatStream
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_anomali-96fe1e60-4261-11ec-b7be-d3026acdf1cf
- name: "@timestamp"
  type: date
  description: Event timestamp.
# Agent fields (copied from ti_anomali/data_stream/threatstream/fields/agent.yml)
- name: cloud
  title: Cloud
  group: 2
  description: Fields related to the cloud or infrastructure the events are coming from.
  footnote: 'Examples: If Metricbeat is running on an EC2 host and fetches data from its host, the cloud info contains the data about this machine. If Metricbeat runs on a remote machine outside the cloud and fetches data from a service running in the cloud, the field contains cloud data from the machine the service is running on.'
  type: group
  fields:
    - name: account.id
      level: extended
      type: keyword
      ignore_above: 1024
      description: 'The cloud account or organization id used to identify different entities in a multi-tenant environment.

        Examples: AWS account id, Google Cloud ORG Id, or other unique identifier.'
      example: 666777888999
    - name: availability_zone
      level: extended
      type: keyword
      ignore_above: 1024
      description: Availability zone in which this host is running.
      example: us-east-1c
    - name: instance.id
      level: extended
      type: keyword
      ignore_above: 1024
      description: Instance ID of the host machine.
      example: i-1234567890abcdef0
    - name: instance.name
      level: extended
      type: keyword
      ignore_above: 1024
      description: Instance name of the host machine.
    - name: machine.type
      level: extended
      type: keyword
      ignore_above: 1024
      description: Machine type of the host machine.
      example: t2.medium
    - name: provider
      level: extended
      type: keyword
      ignore_above: 1024
      description: Name of the cloud provider. Example values are aws, azure, gcp, or digitalocean.
      example: aws
    - name: region
      level: extended
      type: keyword
      ignore_above: 1024
      description: Region in which this host is running.
      example: us-east-1
    - name: project.id
      type: keyword
      description: Name of the project in Google Cloud.
    - name: image.id
      type: keyword
      description: Image ID for the cloud instance.
- name: container
  title: Container
  group: 2
  description: 'Container fields are used for meta information about the specific container that is the source of information.

    These fields help correlate data based containers from any runtime.'
  type: group
  fields:
    - name: id
      level: core
      type: keyword
      ignore_above: 1024
      description: Unique container id.
    - name: image.name
      level: extended
      type: keyword
      ignore_above: 1024
      description: Name of the image the container was built on.
    - name: labels
      level: extended
      type: object
      object_type: keyword
      description: Image labels.
    - name: name
      level: extended
      type: keyword
      ignore_above: 1024
      description: Container name.
- name: host
  title: Host
  group: 2
  description: 'A host is defined as a general computing instance.

    ECS host.* fields should be populated with details about the host on which the event happened, or from which the measurement was taken. Host types include hardware, virtual machines, Docker containers, and Kubernetes nodes.'
  type: group
  fields:
    - name: architecture
      level: core
      type: keyword
      ignore_above: 1024
      description: Operating system architecture.
      example: x86_64
    - name: domain
      level: extended
      type: keyword
      ignore_above: 1024
      description: 'Name of the domain of which the host is a member.

        For example, on Windows this could be the host''s Active Directory domain or NetBIOS domain name. For Linux this could be the domain of the host''s LDAP provider.'
      example: CONTOSO
      default_field: false
    - name: hostname
      level: core
      type: keyword
      ignore_above: 1024
      description: 'Hostname of the host.

        It normally contains what the `hostname` command returns on the host machine.'
    - name: id
      level: core
      type: keyword
      ignore_above: 1024
      description: 'Unique host id.

        As hostname is not always unique, use values that are meaningful in your environment.

        Example: The current usage of `beat.name`.'
    - name: ip
      level: core
      type: ip
      description: Host ip addresses.
    - name: mac
      level: core
      type: keyword
      ignore_above: 1024
      description: Host mac addresses.
    - name: name
      level: core
      type: keyword
      ignore_above: 1024
      description: 'Name of the host.

        It can contain what `hostname` returns on Unix systems, the fully qualified domain name, or a name specified by the user. The sender decides which value to use.'
    - name: os.family
      level: extended
      type: keyword
      ignore_above: 1024
      description: OS family (such as redhat, debian, freebsd, windows).
      example: debian
    - name: os.kernel
      level: extended
      type: keyword
      ignore_above: 1024
      description: Operating system kernel version as a raw string.
      example: 4.4.0-112-generic
    - name: os.name
      level: extended
      type: keyword
      ignore_above: 1024
      multi_fields:
        - name: text
          type: text
          norms: false
          default_field: false
      description: Operating system name, without the version.
      example: Mac OS X
    - name: os.platform
      level: extended
      type: keyword
      ignore_above: 1024
      description: Operating system platform (such centos, ubuntu, windows).
      example: darwin
    - name: os.version
      level: extended
      type: keyword
      ignore_above: 1024
      description: Operating system version as a raw string.
      example: 10.14.1
    - name: type
      level: core
      type: keyword
      ignore_above: 1024
      description: 'Type of host.

        For Cloud providers this can be the machine type like `t2.medium`. If vm, this could be the container, for example, or other information meaningful in your environment.'
    - name: containerized
      type: boolean
      description: >
        If the host is a container.

    - name: os.build
      type: keyword
      example: "18D109"
      description: >
        OS build information.

    - name: os.codename
      type: keyword
      example: "stretch"
      description: >
        OS codename, if any.

