- name: agent.ephemeral_id
  external: ecs
- name: agent.id
  external: ecs
- name: agent.name
  external: ecs
- name: agent.type
  external: ecs
- name: agent.version
  external: ecs
- name: cloud.account.id
  external: ecs
- name: destination.nat.ip
  external: ecs
- name: destination.port
  external: ecs
- name: device.manufacturer
  external: ecs
- name: device.serial_number
  external: ecs
- name: device.type
  external: ecs
- name: ecs.version
  external: ecs
- name: error.code
  external: ecs
- name: error.id
  external: ecs
- name: error.message
  external: ecs
- name: event.action
  external: ecs
- name: event.category
  external: ecs
- name: event.created
  external: ecs
- name: event.ingested
  external: ecs
- name: event.kind
  external: ecs
- name: event.reason
  external: ecs
- name: event.type
  external: ecs
- name: event.url
  external: ecs
- name: host.domain
  external: ecs
- name: host.geo.city_name
  external: ecs
- name: host.hostname
  external: ecs
- name: host.id
  external: ecs
- name: host.name
  external: ecs
- name: host.os.family
  external: ecs
- name: host.os.full
  external: ecs
- name: host.os.type
  external: ecs
- name: host.os.version
  external: ecs
- name: message
  external: ecs
- name: network.direction
  external: ecs
- name: network.protocol
  external: ecs
- name: observer.vendor
  external: ecs
  type: constant_keyword
  value: Axonius
- name: related.hash
  external: ecs
- name: related.hosts
  external: ecs
- name: related.ip
  external: ecs
- name: related.user
  external: ecs
- name: source.address
  external: ecs
- name: source.nat.ip
  external: ecs
- name: user_agent.version
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.enumeration
  external: ecs
- name: vulnerability.id
  external: ecs
- name: vulnerability.severity
  external: ecs
