- name: ecs.version
  external: ecs
- name: event.id
  external: ecs
- name: event.created
  external: ecs
- name: event.action
  external: ecs
- name: event.kind
  external: ecs
- name: event.category
  external: ecs
- name: event.type
  external: ecs
- name: event.outcome
  external: ecs
- name: event.original
  external: ecs
- name: message
  external: ecs
- name: user.id
  external: ecs
- name: user.name
  external: ecs
- name: user.email
  external: ecs
- name: source.ip
  external: ecs
- name: source.geo.country_name
  external: ecs
- name: source.geo.region_name
  external: ecs
- name: source.geo.city_name
  external: ecs
- name: source.as.number
  external: ecs
- name: source.as.organization.name
  external: ecs
- name: observer.vendor
  external: ecs
  type: constant_keyword
  value: Atlassian
- name: observer.product
  external: ecs
  type: constant_keyword
  value: Atlassian Cloud
- name: observer.type
  external: ecs
  type: constant_keyword
  value: saas
- name: related.ip
  external: ecs
- name: related.user
  external: ecs
