{
  "attributes": {
    "author": [
      "Elastic"
    ],
    "description": "Mock rule for testing performance issues",
    "from": "now-30m",
    "index": [
      "filebeat-*",
      "logs-o365*"
    ],
    "language": "kuery",
    "license": "Elastic License v2",
    "name": "Test Rule number 9486",
    "note": "",
    "query": "event.dataset:o365.audit and event.provider:Exchange and event.category:web and event.action:\"New-TransportRule\" and event.outcome:success\n",
    "references": [
      "https://docs.microsoft.com/en-us/powershell/module/exchange/new-transportrule?view=exchange-ps",
      "https://docs.microsoft.com/en-us/exchange/security-and-compliance/mail-flow-rules/mail-flow-rules"
    ],
    "risk_score": 47,
    "rule_id": "rule-9486",
    "setup": "The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
    "severity": "medium",
    "tags": [
      "Elastic",
      "Cloud",
      "Microsoft 365",
      "Continuous Monitoring",
      "SecOps",
      "Configuration Audit"
    ],
    "threat": [
      {
        "framework": "MITRE ATT&CK",
        "tactic": {
          "id": "TA0010",
          "name": "Exfiltration",
          "reference": "https://attack.mitre.org/tactics/TA0010/"
        },
        "technique": [
          {
            "id": "T1537",
            "name": "Transfer Data to Cloud Account",
            "reference": "https://attack.mitre.org/techniques/T1537/"
          }
        ]
      }
    ],
    "timestamp_override": "event.ingested",
    "type": "query",
    "version": 101
  },
  "id": "rule-9486",
  "type": "security-rule"
}
