rules:
  - path: /findingsv2
    methods: ['POST']
    request_headers:
      Content-Type:
        - "application/json"
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"NextToken":"next_token_2","SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": []
          }
          `}}
  - path: /findingsv2
    methods: ['POST']
    request_headers:
      Content-Type:
        - "application/json"
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"NextToken":"next_token_1","SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": [
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Vulnerability Finding",
                "class_uid": 2002,
                "cloud": {
                  "account": {
                    "type": "AWS Account",
                    "type_id": 10,
                    "uid": "123456789012"
                  },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "finding_info": {
                  "created_time": 1758662368239,
                  "created_time_dt": "2025-09-23T21:19:28.239Z",
                  "desc": "If the PATH environment variable contains paths which are executables (rather than just directories), passing certain strings to LookPath (\"\", \".\", and \"..\"), can result in the binaries listed in the PATH being unexpectedly returned.",
                  "first_seen_time": 1758662368239,
                  "first_seen_time_dt": "2025-09-23T21:19:28.239Z",
                  "last_seen_time": 1758662368239,
                  "last_seen_time_dt": "2025-09-23T21:19:28.239Z",
                  "modified_time": 1758662368239,
                  "modified_time_dt": "2025-09-23T21:19:28.239Z",
                  "title": "CVE-2025-47906 - go/stdlib",
                  "types": [
                    "Software and Configuration Checks/Vulnerabilities/CVE"
                  ],
                  "uid": "arn:aws:inspector2:us-east-2:123456789012:finding/2123456789abcdefabcdef12345679"
                },
                "metadata": {
                  "product": {
                    "name": "Inspector",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/inspector",
                    "vendor_name": "AWS"
                  },
                  "profiles": [
                    "cloud",
                    "datetime"
                  ],
                  "uid": "d1bc4b0123456789012345abefabcdefabcdefab123890cdef123456",
                  "version": "1.5.0"
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "data": {
                      "awsLambdaFunctionDetails": {
                        "architectures": [
                          "ARM64"
                        ],
                        "codeSha256": "OBDFNBKKvsf/dfbSJFBVDKB64v1sJUYVJH/SV5nsdv5svssv=",
                        "executionRoleArn": "arn:aws:iam::123456789012:role/cloudtrail-test-ab-LambdaExecutionRole-jVHJUFvbhIHVD6",
                        "functionName": "cloudtrail-test-ab-LambdaFunction-jVHJUsdbdkj6",
                        "lastModifiedAt": "2025-08-12T08:23:50Z",
                        "layers": [
                          "arn:aws:lambda:us-east-2:267093732750:layer:test-cloud-forwarder-ver-0-2-0:1"
                        ],
                        "packageType": "ZIP",
                        "runtime": "PYTHON_3_12",
                        "version": "$LATEST"
                      }
                    },
                    "name": "cloudtrail-test-ab-LambdaFunction-jVHJUsdbdkj6",
                    "owner": {
                      "account": {
                        "uid": "123456789012"
                      }
                    },
                    "region": "us-east-2",
                    "tags": [
                      {
                        "name": "aws:cloudformation:stack-name",
                        "value": "cloudtrail-test-ab"
                      },
                      {
                        "name": "aws:cloudformation:stack-id",
                        "value": "arn:aws:cloudformation:us-east-2:123456789012:stack/cloudtrail-test-ab/c3abcd12-3456-7890-abdf-c2123456abcd"
                      },
                      {
                        "name": "aws:cloudformation:logical-id",
                        "value": "LambdaFunction"
                      }
                    ],
                    "type": "AWS::Lambda::Function",
                    "uid": "cloudtrail-test-ab-LambdaFunction-jVHJUsdbdkj6",
                    "uid_alt": "arn:aws:lambda:us-east-2:123456789012:function:cloudtrail-test-ab-LambdaFunction-jVHJUsdbdkj6"
                  }
                ],
                "severity": "Medium",
                "severity_id": 3,
                "status": "New",
                "status_id": 1,
                "time": 1758662368239,
                "time_dt": "2025-09-23T21:19:28.239Z",
                "type_name": "Vulnerability Finding: Create",
                "type_uid": 200201,
                "vendor_attributes": {
                  "severity": "Medium",
                  "severity_id": 3
                },
                "vulnerabilities": [
                  {
                    "affected_packages": [
                      {
                        "epoch": 0,
                        "fixed_in_version": "1.24.6",
                        "name": "go/stdlib",
                        "package_manager": "GENERIC",
                        "path": "collector",
                        "version": "1.24.0"
                      }
                    ],
                    "cve": {
                      "created_time": 1758222937000,
                      "created_time_dt": "2025-09-18T19:15:37.000Z",
                      "cvss": [
                        {
                          "base_score": 6.5,
                          "severity": "MEDIUM",
                          "vector_string": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L",
                          "vendor_name": "NVD",
                          "version": "3.1"
                        }
                      ],
                      "desc": "If the PATH environment variable contains paths which are executables (rather than just directories), passing certain strings to LookPath (\"\", \".\", and \"..\"), can result in the binaries listed in the PATH being unexpectedly returned.",
                      "epss": {
                        "score": "0.00017"
                      },
                      "modified_time": 1758297627000,
                      "modified_time_dt": "2025-09-19T16:00:27.000Z",
                      "uid": "CVE-2025-47906"
                    },
                    "fix_coverage": "Complete",
                    "fix_coverage_id": 1,
                    "is_exploit_available": false,
                    "is_fix_available": true,
                    "references": [
                      "https://groups.google.com/g/golang-announce/c/x5MKroML2yM",
                      "https://nvd.nist.gov/vuln/detail/CVE-2025-47906"
                    ],
                    "severity": "MEDIUM"
                  }
                ]
              },
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "KMS.1",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Pass",
                  "status_id": 1
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-iam-customer-policy-blocked-kms-actions-0abcdefe",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273553640,
                  "created_time_dt": "2025-09-19T09:19:13.640Z",
                  "desc": "Checks whether the default version of IAM customer managed policies allow principals to use the AWS Key Management Service (KMS) decryption actions on all resources. This control fails if kms:Decrypt or kms:ReEncryptFrom actions are allowed on all KMS keys. The control evaluates both attached and unattached customer managed policies. It does not check inline policies or AWS managed policies.",
                  "first_seen_time": 1758273549591,
                  "first_seen_time_dt": "2025-09-19T09:19:09.591Z",
                  "last_seen_time": 1758273549591,
                  "last_seen_time_dt": "2025-09-19T09:19:09.591Z",
                  "modified_time": 1758273553640,
                  "modified_time_dt": "2025-09-19T09:19:13.640Z",
                  "title": "IAM customer managed policies should not allow decryption actions on all KMS keys",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/KMS.1/finding/11233211-5678-efab-abcd-701234567892"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1234b01234567890123456789abcde1234defabcdefabcdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/KMS.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "global",
                    "type": "AWS::IAM::Policy",
                    "uid": "AVSHDBVJBSKVBSDVSDB",
                    "uid_alt": "arn:aws:iam::123456789012:policy/service-role/Amazon_EventBridge_Invoke_Sqs_1451083178"
                  }
                ],
                "severity": "Informational",
                "severity_id": 1,
                "status": "Resolved",
                "status_id": 4,
                "time": 1758273553640,
                "time_dt": "2025-09-19T09:19:13.640Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Informational", "severity_id": 1 }
              }
            ],
            "NextToken": "next_token_2"
          }
          `}}
  - path: /findingsv2
    methods: ['POST']
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": [
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "SQS.3",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Pass",
                  "status_id": 1
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-sqs-queue-no-public-access-abcdef12",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273439594,
                  "created_time_dt": "2025-09-19T09:17:19.594Z",
                  "desc": "This controls checks whether an Amazon SQS access policy allows public access to an SQS queue. The control fails if an SQS access policy allows public access to the queue.",
                  "first_seen_time": 1758273437503,
                  "first_seen_time_dt": "2025-09-19T09:17:17.503Z",
                  "last_seen_time": 1758273437503,
                  "last_seen_time_dt": "2025-09-19T09:17:17.503Z",
                  "modified_time": 1758273439594,
                  "modified_time_dt": "2025-09-19T09:17:19.594Z",
                  "title": "SQS queue access policies should not allow public access",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/SQS.3/finding/7abcdef4-abcd-1234-5678-501234567894"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abcdefabcdefabcdefabcdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/SQS.3/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "us-east-2",
                    "type": "AWS::SQS::Queue",
                    "uid": "https://sqs.us-east-2.amazonaws.com/123456789012/securityhubfinding",
                    "uid_alt": "arn:aws:sqs:us-east-2:123456789012:securityhubfinding"
                  }
                ],
                "severity": "Informational",
                "severity_id": 1,
                "status": "Resolved",
                "status_id": 4,
                "time": 1758273439594,
                "time_dt": "2025-09-19T09:17:19.594Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Informational", "severity_id": 1 }
              },
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "SQS.1",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Fail",
                  "status_id": 3
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-sqs-queue-encrypted-12345678",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273447903,
                  "created_time_dt": "2025-09-19T09:17:27.903Z",
                  "desc": "This control checks whether Amazon SQS queues are encrypted at rest.",
                  "first_seen_time": 1758273437473,
                  "first_seen_time_dt": "2025-09-19T09:17:17.473Z",
                  "last_seen_time": 1758273437473,
                  "last_seen_time_dt": "2025-09-19T09:17:17.473Z",
                  "modified_time": 1758273447903,
                  "modified_time_dt": "2025-09-19T09:17:27.903Z",
                  "title": "Amazon SQS queues should be encrypted at rest",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/SQS.1/finding/7dabcdef-1234-8912-5678-5012345678904"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abcdefabcd0123456789cdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/SQS.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "us-east-2",
                    "type": "AWS::SQS::Queue",
                    "uid": "https://sqs.us-east-2.amazonaws.com/123456789012/securityhubfinding",
                    "uid_alt": "arn:aws:sqs:us-east-2:123456789012:securityhubfinding"
                  }
                ],
                "severity": "Medium",
                "severity_id": 3,
                "status": "New",
                "status_id": 1,
                "time": 1758273447903,
                "time_dt": "2025-09-19T09:17:27.903Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Medium", "severity_id": 3 }
              }
            ],
            "NextToken": "next_token_1"
          }
          `}}
