rules:
  - path: /findingsv2
    methods: ['POST']
    request_headers:
      Content-Type:
        - "application/json"
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"NextToken":"next_token_2","SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": [
              {
                "activity_id": 2,
                "activity_name": "Update",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "SSM.1",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Fail",
                  "status_id": 3
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-ec2-instance-managed-by-ssm-ab123467",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1748541948106,
                  "created_time_dt": "2025-05-29T18:05:48.106Z",
                  "desc": "This AWS control checks whether the Amazon EC2 instances in your account are managed by AWS Systems Manager.",
                  "first_seen_time": 1748541944226,
                  "first_seen_time_dt": "2025-05-29T18:05:44.226Z",
                  "last_seen_time": 1750372015643,
                  "last_seen_time_dt": "2025-06-19T22:26:55.643Z",
                  "modified_time": 1758875220981,
                  "modified_time_dt": "2025-09-26T08:27:00.981Z",
                  "title": "EC2 instances should be managed by AWS Systems Manager",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/SSM.1/finding/cabc123e-1235-ef12-abcd-6123456abcd1"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abc123456def5bcdefabcdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/SSM.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "us-east-2",
                    "tags": [
                      {
                        "name": "aws:autoscaling:groupName",
                        "value": "eks-demo_prod_linux-1123abc1-5678-efab-abcd-701abcdef892"
                      },
                      {
                        "name": "aws:ec2:fleet-id",
                        "value": "fleet-babcdefc-5678-abcd-1234-20123456789b"
                      },
                      { "name": "k8s.io/cluster-autoscaler/demo_prod", "value": "owned" },
                      { "name": "aws:eks:cluster-name", "value": "demo_prod" },
                      { "name": "eks:cluster-name", "value": "demo_prod" },
                      { "name": "aws:ec2launchtemplate:version", "value": "6" },
                      { "name": "eks:nodegroup-name", "value": "demo_prod_linux" },
                      { "name": "k8s.io/cluster-autoscaler/enabled", "value": "true" },
                      { "name": "kubernetes.io/cluster/demo_prod", "value": "owned" },
                      {
                        "name": "aws:ec2launchtemplate:id",
                        "value": "lt-abcdefabcdef123456"
                      }
                    ],
                    "type": "AWS::EC2::Instance",
                    "uid": "i-abcd1235cdef1234",
                    "uid_alt": "arn:aws:ec2:us-east-2:123456789012:instance/i-abcd1235cdef1234"
                  }
                ],
                "severity": "Medium",
                "severity_id": 3,
                "status": "New",
                "status_id": 1,
                "time": 1758875220981,
                "time_dt": "2025-09-26T08:27:00.981Z",
                "type_name": "Compliance Finding: Update",
                "type_uid": 200302,
                "vendor_attributes": { "severity": "Medium", "severity_id": 3 }
              }
            ]
          }
          `}}
  - path: /findingsv2
    methods: ['POST']
    request_headers:
      Content-Type:
        - "application/json"
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"NextToken":"next_token_1","SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": [
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "IAM.1",
                  "requirements": ["CIS AWS Foundations Benchmark v1.2.0/1.22"],
                  "standards": [
                    "ruleset/cis-aws-foundations-benchmark/v/1.2.0",
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Pass",
                  "status_id": 1
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-iam-policy-no-statements-with-admin-access-babcdefe",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273558940,
                  "created_time_dt": "2025-09-19T09:19:18.940Z",
                  "desc": "This AWS control checks whether the default version of AWS Identity and Access Management (IAM) policies (also known as customer managed policies) do not have administrator access with a statement that has \"Effect\": \"Allow\" with \"Action\": \"*\" over \"Resource\": \"*\". It only checks for the Customer Managed Policies that you created, but not inline and AWS Managed Policies.",
                  "first_seen_time": 1758273549612,
                  "first_seen_time_dt": "2025-09-19T09:19:09.612Z",
                  "last_seen_time": 1758273549612,
                  "last_seen_time_dt": "2025-09-19T09:19:09.612Z",
                  "modified_time": 1758273558940,
                  "modified_time_dt": "2025-09-19T09:19:18.940Z",
                  "title": "IAM policies should not allow full \"*\" administrative privileges",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/IAM.1/finding/11233211-1234-efab-abcd-701234567892"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abcdefefabcdefabcdef123451234566",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/IAM.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "global",
                    "type": "AWS::IAM::Policy",
                    "uid": "AJKSDBVKJJKVBJDSVBWKURGBFWK",
                    "uid_alt": "arn:aws:iam::123456789012:policy/service-role/Amazon_EventBridge_Invoke_Sqs_1412345678"
                  }
                ],
                "severity": "Informational",
                "severity_id": 1,
                "status": "Resolved",
                "status_id": 4,
                "time": 1758273558940,
                "time_dt": "2025-09-19T09:19:18.940Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Informational", "severity_id": 1 }
              },
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "KMS.1",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Pass",
                  "status_id": 1
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-iam-customer-policy-blocked-kms-actions-0abcdefe",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273553640,
                  "created_time_dt": "2025-09-19T09:19:13.640Z",
                  "desc": "Checks whether the default version of IAM customer managed policies allow principals to use the AWS Key Management Service (KMS) decryption actions on all resources. This control fails if kms:Decrypt or kms:ReEncryptFrom actions are allowed on all KMS keys. The control evaluates both attached and unattached customer managed policies. It does not check inline policies or AWS managed policies.",
                  "first_seen_time": 1758273549591,
                  "first_seen_time_dt": "2025-09-19T09:19:09.591Z",
                  "last_seen_time": 1758273549591,
                  "last_seen_time_dt": "2025-09-19T09:19:09.591Z",
                  "modified_time": 1758273553640,
                  "modified_time_dt": "2025-09-19T09:19:13.640Z",
                  "title": "IAM customer managed policies should not allow decryption actions on all KMS keys",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/KMS.1/finding/11233211-5678-efab-abcd-701234567892"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1234b01234567890123456789abcde1234defabcdefabcdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/KMS.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "global",
                    "type": "AWS::IAM::Policy",
                    "uid": "AVSHDBVJBSKVBSDVSDB",
                    "uid_alt": "arn:aws:iam::123456789012:policy/service-role/Amazon_EventBridge_Invoke_Sqs_1451083178"
                  }
                ],
                "severity": "Informational",
                "severity_id": 1,
                "status": "Resolved",
                "status_id": 4,
                "time": 1758273553640,
                "time_dt": "2025-09-19T09:19:13.640Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Informational", "severity_id": 1 }
              }
            ],
            "NextToken": "next_token_2"
          }
          `}}
  - path: /findingsv2
    methods: ['POST']
    request_body: /^\{"Filters":\{"CompositeFilters":\[\{"DateFilters":\[\{"FieldName":"finding_info\.modified_time_dt","Filter":\{"End":.*,"Start":.*\}\}\]\}\]\},"MaxResults":2,"SortCriteria":\[\{"Field":"finding_info\.modified_time_dt","SortOrder":"asc"\}\]\}/
    responses:
      - status_code: 200
        headers:
          Content-Type:
            - 'application/json'
        body: |-
          {{ minify_json `
          {
            "Findings": [
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "SQS.3",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Pass",
                  "status_id": 1
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-sqs-queue-no-public-access-abcdef12",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273439594,
                  "created_time_dt": "2025-09-19T09:17:19.594Z",
                  "desc": "This controls checks whether an Amazon SQS access policy allows public access to an SQS queue. The control fails if an SQS access policy allows public access to the queue.",
                  "first_seen_time": 1758273437503,
                  "first_seen_time_dt": "2025-09-19T09:17:17.503Z",
                  "last_seen_time": 1758273437503,
                  "last_seen_time_dt": "2025-09-19T09:17:17.503Z",
                  "modified_time": 1758273439594,
                  "modified_time_dt": "2025-09-19T09:17:19.594Z",
                  "title": "SQS queue access policies should not allow public access",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/SQS.3/finding/7abcdef4-abcd-1234-5678-501234567894"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abcdefabcdefabcdefabcdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/SQS.3/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "us-east-2",
                    "type": "AWS::SQS::Queue",
                    "uid": "https://sqs.us-east-2.amazonaws.com/123456789012/securityhubfinding",
                    "uid_alt": "arn:aws:sqs:us-east-2:123456789012:securityhubfinding"
                  }
                ],
                "severity": "Informational",
                "severity_id": 1,
                "status": "Resolved",
                "status_id": 4,
                "time": 1758273439594,
                "time_dt": "2025-09-19T09:17:19.594Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Informational", "severity_id": 1 }
              },
              {
                "activity_id": 1,
                "activity_name": "Create",
                "category_name": "Findings",
                "category_uid": 2,
                "class_name": "Compliance Finding",
                "class_uid": 2003,
                "cloud": {
                  "account": { "uid": "123456789012" },
                  "provider": "AWS",
                  "region": "us-east-2"
                },
                "compliance": {
                  "control": "SQS.1",
                  "standards": [
                    "standards/aws-foundational-security-best-practices/v/1.0.0"
                  ],
                  "status": "Fail",
                  "status_id": 3
                },
                "finding_info": {
                  "analytic": {
                    "category": "AWS::Config::ConfigRule",
                    "name": "securityhub-sqs-queue-encrypted-12345678",
                    "type": "Rule",
                    "type_id": 1
                  },
                  "created_time": 1758273447903,
                  "created_time_dt": "2025-09-19T09:17:27.903Z",
                  "desc": "This control checks whether Amazon SQS queues are encrypted at rest.",
                  "first_seen_time": 1758273437473,
                  "first_seen_time_dt": "2025-09-19T09:17:17.473Z",
                  "last_seen_time": 1758273437473,
                  "last_seen_time_dt": "2025-09-19T09:17:17.473Z",
                  "modified_time": 1758273447903,
                  "modified_time_dt": "2025-09-19T09:17:27.903Z",
                  "title": "Amazon SQS queues should be encrypted at rest",
                  "types": [
                    "Software and Configuration Checks/Industry and Regulatory Standards",
                    "Posture Management"
                  ],
                  "uid": "arn:aws:securityhub:us-east-2:123456789012:security-control/SQS.1/finding/7dabcdef-1234-8912-5678-5012345678904"
                },
                "metadata": {
                  "product": {
                    "name": "Security Hub",
                    "uid": "arn:aws:securityhub:us-east-2::productv2/aws/securityhub",
                    "vendor_name": "AWS"
                  },
                  "profiles": ["cloud", "datetime"],
                  "uid": "d1bc4b01234567890123456789abcdefabcd0123456789cdef123456",
                  "version": "1.6.0"
                },
                "remediation": {
                  "desc": "For information on how to correct this issue, consult the AWS Security Hub controls documentation.",
                  "references": [
                    "https://docs.aws.amazon.com/console/securityhub/SQS.1/remediation"
                  ]
                },
                "resources": [
                  {
                    "cloud_partition": "aws",
                    "owner": { "account": { "uid": "123456789012" } },
                    "region": "us-east-2",
                    "type": "AWS::SQS::Queue",
                    "uid": "https://sqs.us-east-2.amazonaws.com/123456789012/securityhubfinding",
                    "uid_alt": "arn:aws:sqs:us-east-2:123456789012:securityhubfinding"
                  }
                ],
                "severity": "Medium",
                "severity_id": 3,
                "status": "New",
                "status_id": 1,
                "time": 1758273447903,
                "time_dt": "2025-09-19T09:17:27.903Z",
                "type_name": "Compliance Finding: Create",
                "type_uid": 200301,
                "vendor_attributes": { "severity": "Medium", "severity_id": 3 }
              }
            ],
            "NextToken": "next_token_1"
          }
          `}}
