- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: cloud.account.id
- external: ecs
  name: device.manufacturer
- external: ecs
  name: device.serial_number
- external: ecs
  name: device.type
- external: ecs
  name: device.vendor.name
- external: ecs
  name: ecs.version
- external: ecs
  name: error.code
- external: ecs
  name: error.id
- external: ecs
  name: error.message
- external: ecs
  name: event.action
- external: ecs
  name: event.agent_id_status
- external: ecs
  name: event.category
- external: ecs
  name: event.created
  type: date
- external: ecs
  name: event.ingested
  type: date
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: event.url
- external: ecs
  name: host.architecture
- external: ecs
  name: host.domain
- external: ecs
  name: host.entity.id
- external: ecs
  name: host.hostname
- external: ecs
  name: host.id
- external: ecs
  name: host.name
- external: ecs
  name: host.os.family
- external: ecs
  name: host.os.full
- external: ecs
  name: host.os.type
- external: ecs
  name: host.os.version
- external: ecs
  name: message
- external: ecs
  name: network.protocol
- external: ecs
  name: observer.vendor
  type: constant_keyword
  value: Axonius
- external: ecs
  name: user.email
- external: ecs
  name: vulnerability.description
- external: ecs
  name: vulnerability.enumeration
- external: ecs
  name: vulnerability.id
- external: ecs
  name: vulnerability.severity
