{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule detects source IPs that triggered their first lateral movement alert within the last 10 minutes (i.e., newly observed), while also triggering at least 2 distinct lateral movement detection rules. This surfaces new potentially malicious IPs exhibiting immediate lateral movement behavior.",
        "from": "now-7200m",
        "interval": "10m",
        "language": "esql",
        "license": "Elastic License v2",
        "name": "Lateral Movement Alerts from a Newly Observed Source Address",
        "note": "## Triage and analysis\n\n### Investigating Lateral Movement Alerts from a Newly Observed Source Address\n\nThis rule surfaces newly observed, low-frequency source address triggering multiple lateral movement alerts.\n\nBecause the alert has not been seen previously for this rule and host, it should be prioritized for validation to determine\nwhether it represents a true compromise or rare benign activity.\n\n### Investigation Steps\n\n- Identify the source address, affected host, user and review the associated rule name to understand the behavior that triggered the alert.\n- Validate the source address and user context under which the activity occurred and assess whether it aligns with normal behavior for that address.\n- Refer to the specific rule investigation guide for further actions.\n\n### False Positive Considerations\n\n- Administrative scripts or automation tools can trigger behavior-based detections when first introduced.\n- Security tooling, IT management agents, or EDR integrations may generate new behavior alerts during updates or configuration changes.\n- Development or testing environments may produce one-off behaviors that resemble malicious techniques.\n\n### Response and Remediation\n\n- If the activity is confirmed malicious, isolate the affected host to prevent further execution or lateral movement.\n- Terminate malicious processes and remove any dropped files or persistence mechanisms.\n- Collect forensic artifacts to understand initial access and execution flow.\n- Patch or remediate any vulnerabilities or misconfigurations that enabled the behavior.\n- If benign, document the finding and consider tuning or exception handling to reduce future noise.\n- Continue monitoring the host and environment for recurrence of the behavior or related alerts.",
        "query": "FROM .alerts-security.* METADATA _index\n\n// Lateral Movement related rules with fields of interest\n| where kibana.alert.rule.threat.tactic.name is not null and\n        source.ip IS NOT NULL and destination.ip is not null and\n        host.id is not null and KQL(\"\"\"kibana.alert.rule.threat.tactic.name : \"Lateral Movement\" \"\"\")\n\n// aggregate stats by source.ip\n| stats  Esql.first_time_seen = MIN(@timestamp),\n         Esql.alerts_count = count(*),\n         Esql.unique_rules_count = COUNT_DISTINCT(kibana.alert.rule.name),\n         Esql.unique_count_host_id = COUNT_DISTINCT(host.id),\n         Esql.rule_name_values = VALUES(kibana.alert.rule.name),\n         Esql.user_name_values = VALUES(user.name),\n         Esql.host_id_values = VALUES(host.id),\n         Esql.host_ip_values = VALUES(host.ip),\n         Esql.tactic_name_values = VALUES(kibana.alert.rule.threat.tactic.name) by source.ip\n\n// values we will need for next filter\n| eval isLocal = locate(MV_CONCAT(to_string(Esql.host_ip_values), \",\"), to_string(source.ip)),\n       Esql.date_diff = DATE_DIFF(\"minute\", Esql.first_time_seen, now())\n\n// at least 2 unique rules from same source.ip and that was first seen in last 5 days\n| where Esql.unique_rules_count >= 2 and\n        // matches are within 10m of the rule execution time to avoid alert duplicates\n        Esql.date_diff <= 10 and\n        // make sure source.ip is not equal to host.ip\n        not isLocal > 0 and\n        // reduce noise from SCCM, Nessus and alike\n        Esql.unique_count_host_id <= 3 and Esql.alerts_count <= 20\n| eval host.id = MV_FIRST(Esql.host_id_values), user.name = MV_FIRST(Esql.user_name_values)\n| KEEP Esql.*, source.ip, host.id, user.name\n",
        "references": [
            "https://www.elastic.co/docs/solutions/security/detect-and-alert/about-detection-rules"
        ],
        "required_fields": [
            {
                "ecs": false,
                "name": "Esql.alerts_count",
                "type": "long"
            },
            {
                "ecs": false,
                "name": "Esql.date_diff",
                "type": "integer"
            },
            {
                "ecs": false,
                "name": "Esql.first_time_seen",
                "type": "date"
            },
            {
                "ecs": false,
                "name": "Esql.host_id_values",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "Esql.host_ip_values",
                "type": "ip"
            },
            {
                "ecs": false,
                "name": "Esql.rule_name_values",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "Esql.tactic_name_values",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "Esql.unique_count_host_id",
                "type": "long"
            },
            {
                "ecs": false,
                "name": "Esql.unique_rules_count",
                "type": "long"
            },
            {
                "ecs": false,
                "name": "Esql.user_name_values",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.id",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "source.ip",
                "type": "ip"
            },
            {
                "ecs": true,
                "name": "user.name",
                "type": "keyword"
            }
        ],
        "risk_score": 73,
        "rule_id": "0e67f4f1-f683-43c0-8d45-c3293cf31e5d",
        "severity": "high",
        "tags": [
            "Use Case: Threat Detection",
            "Rule Type: Higher-Order Rule",
            "Tactic: Lateral Movement",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0008",
                    "name": "Lateral Movement",
                    "reference": "https://attack.mitre.org/tactics/TA0008/"
                },
                "technique": []
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "esql",
        "version": 1
    },
    "id": "0e67f4f1-f683-43c0-8d45-c3293cf31e5d_1",
    "type": "security-rule"
}