{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies modification of a file creation time. Adversaries may modify file time attributes to blend malicious content with existing files. Timestomping is a technique that modifies the timestamps of a file often to mimic files that are in trusted directories.",
        "from": "now-9m",
        "index": [
            "winlogbeat-*",
            "logs-windows.sysmon_operational-*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "File Creation Time Changed",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating File Creation Time Changed\nFile creation timestamps are crucial for tracking file history and integrity. Adversaries may alter these timestamps, a tactic known as timestomping, to disguise malicious files as benign. This detection rule leverages Sysmon logs to identify suspicious changes in file creation times, excluding trusted processes and file types, thus highlighting potential evasion attempts by attackers.\n\n### Possible investigation steps\n\n- Review the Sysmon logs to confirm the event code 2, which indicates a file creation time change, and verify the associated process and file details.\n- Identify the process executable path that triggered the alert and determine if it is outside the list of trusted paths specified in the query.\n- Check the file extension and name to ensure they are not part of the excluded types such as \"temp\", \"tmp\", or \"LOG\".\n- Investigate the user account associated with the event to determine if it is a non-system account, as the query excludes \"SYSTEM\", \"Local Service\", and \"Network Service\".\n- Correlate the file creation time change event with other security events or logs to identify any related suspicious activities or patterns.\n- Assess the file's location and context to determine if it is in a sensitive or unusual directory that could indicate malicious intent.\n- If necessary, perform a deeper forensic analysis on the file and process to identify any potential malicious behavior or indicators of compromise.\n\n### False positive analysis\n\n- Trusted software updates or installations may alter file creation times. Exclude known update processes like msiexec.exe from detection to reduce noise.\n- System maintenance tasks, such as disk cleanup, can modify timestamps. Exclude cleanmgr.exe to prevent these benign changes from triggering alerts.\n- User-initiated actions in trusted applications like Chrome or Firefox might change file creation times. Exclude these applications to avoid unnecessary alerts.\n- Temporary files created by legitimate processes may have altered timestamps. Exclude file extensions like temp and tmp to minimize false positives.\n- System accounts such as SYSTEM or Local Service may perform legitimate file operations. Exclude these user names to focus on suspicious activities.\n\n### Response and remediation\n\n- Isolate the affected system from the network to prevent further malicious activity and lateral movement by the adversary.\n- Conduct a thorough review of the file in question to determine if it is malicious. Use a combination of antivirus scans and manual analysis to assess the file's behavior and origin.\n- If the file is confirmed to be malicious, remove it from the system and any other locations it may have been copied to. Ensure that all associated processes are terminated.\n- Restore any affected files from a known good backup to ensure data integrity and continuity.\n- Review and update endpoint protection settings to ensure that similar threats are detected and blocked in the future. This may include adjusting Sysmon configurations to enhance logging and detection capabilities.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if additional systems have been compromised.\n- Document the incident, including all actions taken, to improve future response efforts and update threat intelligence databases with any new indicators of compromise (IOCs) identified.",
        "query": "file where host.os.type == \"windows\" and\n  event.provider == \"Microsoft-Windows-Sysmon\" and\n  /* File creation time change */\n  event.code == \"2\" and\n  not process.executable :\n           (\"?:\\\\Program Files\\\\*\",\n            \"?:\\\\Program Files (x86)\\\\*\",\n            \"?:\\\\Windows\\\\system32\\\\cleanmgr.exe\",\n            \"?:\\\\Windows\\\\system32\\\\msiexec.exe\",\n            \"?:\\\\Windows\\\\syswow64\\\\msiexec.exe\",\n            \"?:\\\\Windows\\\\system32\\\\svchost.exe\",\n            \"?:\\\\WINDOWS\\\\system32\\\\backgroundTaskHost.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Google\\\\Chrome\\\\Application\\\\chrome.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Mozilla Firefox\\\\firefox.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\slack\\\\app-*\\\\slack.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\GitHubDesktop\\\\app-*\\\\GitHubDesktop.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Microsoft\\\\Teams\\\\current\\\\Teams.exe\",\n            \"?:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Microsoft\\\\OneDrive\\\\OneDrive.exe\") and\n  not file.extension : (\"temp\", \"tmp\", \"~tmp\", \"xml\", \"newcfg\") and not user.name : (\"SYSTEM\", \"Local Service\", \"Network Service\") and\n  not file.name : (\"LOG\", \"temp-index\", \"license.rtf\", \"iconcache_*.db\")\n",
        "related_integrations": [
            {
                "package": "windows",
                "version": "^2.5.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.code",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.provider",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "file.extension",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "file.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "user.name",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "166727ab-6768-4e26-b80c-948b228ffc06",
        "severity": "medium",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Defense Evasion",
            "Data Source: Sysmon",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1070",
                        "name": "Indicator Removal",
                        "reference": "https://attack.mitre.org/techniques/T1070/",
                        "subtechnique": [
                            {
                                "id": "T1070.006",
                                "name": "Timestomp",
                                "reference": "https://attack.mitre.org/techniques/T1070/006/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 108
    },
    "id": "166727ab-6768-4e26-b80c-948b228ffc06_108",
    "type": "security-rule"
}