{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies the use of osascript to execute scripts via standard input that may prompt a user with a rogue dialog for credentials.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.process*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Prompt for Credentials with Osascript",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Prompt for Credentials with OSASCRIPT\n\nOSASCRIPT is a macOS utility that allows the execution of AppleScript and other OSA language scripts. Adversaries may exploit it to display deceptive dialogs prompting users for credentials, mimicking legitimate requests. The detection rule identifies suspicious OSASCRIPT usage by monitoring specific command patterns and excluding known legitimate processes, thereby flagging potential credential theft attempts.\n\n### Possible investigation steps\n\n- Review the process command line to confirm if the osascript command includes suspicious patterns like \"display dialog\" with \"password\" or \"passphrase\" to determine if it is attempting to prompt for credentials.\n- Check the parent process executable to see if it matches any known legitimate applications or services, such as those listed in the exclusion criteria, to rule out false positives.\n- Investigate the user account associated with the process to determine if it is a privileged account or if there is any unusual activity associated with it.\n- Examine the process execution context, including the effective parent executable, to identify if the osascript was executed by a legitimate management tool or script.\n- Look for any other related alerts or logs around the same timeframe to identify if this is part of a broader attack or isolated incident.\n- Assess the risk and impact by determining if any credentials were potentially compromised and if further containment or remediation actions are necessary.\n\n### False positive analysis\n\n- Legitimate administrative scripts using osascript may trigger alerts if they include dialog prompts for passwords or passphrases. To manage this, identify and exclude these scripts by adding their specific command lines or parent executables to the exception list.\n- Processes initiated by trusted applications like JAMF or Karabiner-Elements can be mistakenly flagged. Ensure these applications are included in the exclusion list to prevent unnecessary alerts.\n- Scheduled maintenance tasks that use osascript for legitimate purposes might be misidentified. Review and exclude these tasks by specifying their user IDs or command line patterns in the detection rule exceptions.\n- Custom scripts executed by system administrators for routine operations may appear suspicious. Document these scripts and add them to the exclusion criteria to avoid false positives.\n- Terminal-based automation tools that interact with osascript could be incorrectly flagged. Verify these tools and include their paths in the exclusion list to reduce false alerts.\n\n### Response and remediation\n\n- Immediately isolate the affected macOS device from the network to prevent further unauthorized access or data exfiltration.\n- Terminate the suspicious osascript process identified by the alert to stop any ongoing credential theft attempts.\n- Conduct a thorough review of the affected system's recent activity logs to identify any unauthorized access or changes made during the incident.\n- Reset credentials for any accounts that may have been compromised, ensuring that new passwords are strong and unique.\n- Escalate the incident to the security operations team for further investigation and to determine if additional systems may be affected.\n- Implement additional monitoring on the affected system and similar endpoints to detect any recurrence of the threat.\n- Review and update endpoint security configurations to block unauthorized script execution and enhance detection capabilities for similar threats in the future.",
        "query": "process where event.action == \"exec\" and host.os.type == \"macos\" and\n process.name == \"osascript\" and process.args == \"-e\" and process.command_line like~ (\"*osascript*display*dialog*password*\", \"*osascript*display*dialog*passphrase*\", \"*pass*display*dialog*\") and\n not (process.parent.executable == \"/usr/bin/sudo\" and process.command_line like~ \"*Encryption Key Escrow*\") and\n not (process.command_line like~ \"*-e with timeout of 3600 seconds*\" and user.id like \"0\" and process.parent.executable == \"/bin/bash\") and\n not process.Ext.effective_parent.executable like~\n                                               (\"/usr/local/jamf/*\",\n                                                \"/Library/Intune/Microsoft Intune Agent.app/Contents/MacOS/IntuneMdmDaemon\",\n                                                \"/Library/Application Support/Mosyle/MosyleMDM.app/Contents/MacOS/MosyleMDM\",\n                                                \"/Applications/Karabiner-Elements.app/Contents/MacOS/Karabiner-Elements\",\n                                                \"/Library/Application Support/JAMF/Jamf.app/Contents/MacOS/JamfDaemon.app/Contents/MacOS/JamfDaemon\",\n                                                \"/Library/Application Support/JAMF/Jamf.app/Contents/MacOS/JamfManagementService.app/Contents/MacOS/JamfManagementService\")\n",
        "references": [
            "https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/prompt.py",
            "https://ss64.com/osx/osascript.html"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^9.0.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "process.Ext.effective_parent.executable",
                "type": "unknown"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.command_line",
                "type": "wildcard"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.parent.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "user.id",
                "type": "keyword"
            }
        ],
        "risk_score": 73,
        "rule_id": "38948d29-3d5d-42e3-8aec-be832aaaf8eb",
        "setup": "## Setup\n\nThis rule requires data coming in from Elastic Defend.\n\n### Elastic Defend Integration Setup\nElastic Defend is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events on your host and send data to the Elastic Security app.\n\n#### Prerequisite Requirements:\n- Fleet is required for Elastic Defend.\n- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).\n\n#### The following steps should be executed in order to add the Elastic Defend integration on a macOS System:\n- Go to the Kibana home page and click \"Add integrations\".\n- In the query bar, search for \"Elastic Defend\" and select the integration to see more details about it.\n- Click \"Add Elastic Defend\".\n- Configure the integration name and optionally add a description.\n- Select the type of environment you want to protect, for MacOS it is recommended to select \"Traditional Endpoints\".\n- Select a configuration preset. Each preset comes with different default settings for Elastic Agent, you can further customize these later by configuring the Elastic Defend integration policy. [Helper guide](https://www.elastic.co/guide/en/security/current/configure-endpoint-integration-policy.html).\n- We suggest selecting \"Complete EDR (Endpoint Detection and Response)\" as a configuration setting, that provides \"All events; all preventions\"\n- Enter a name for the agent policy in \"New agent policy name\". If other agent policies already exist, you can click the \"Existing hosts\" tab and select an existing policy instead.\nFor more details on Elastic Agent configuration settings, refer to the [helper guide](https://www.elastic.co/guide/en/fleet/current/agent-policy.html).\n- Click \"Save and Continue\".\n- To complete the integration, select \"Add Elastic Agent to your hosts\" and continue to the next section to install the Elastic Agent on your hosts.\nFor more details on Elastic Defend refer to the [helper guide](https://www.elastic.co/guide/en/security/current/install-endpoint.html).\n",
        "severity": "high",
        "tags": [
            "Domain: Endpoint",
            "OS: macOS",
            "Use Case: Threat Detection",
            "Tactic: Credential Access",
            "Data Source: Elastic Defend",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0006",
                    "name": "Credential Access",
                    "reference": "https://attack.mitre.org/tactics/TA0006/"
                },
                "technique": [
                    {
                        "id": "T1056",
                        "name": "Input Capture",
                        "reference": "https://attack.mitre.org/techniques/T1056/",
                        "subtechnique": [
                            {
                                "id": "T1056.002",
                                "name": "GUI Input Capture",
                                "reference": "https://attack.mitre.org/techniques/T1056/002/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 213
    },
    "id": "38948d29-3d5d-42e3-8aec-be832aaaf8eb_213",
    "type": "security-rule"
}