{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies attempt to coerce a local NTLM authentication via HTTP using the Windows Printer Spooler service as a target. An adversary may use this primitive in combination with other techniques to elevate privileges on a compromised system.",
        "from": "now-9m",
        "index": [
            "endgame-*",
            "logs-crowdstrike.fdr*",
            "logs-endpoint.events.process-*",
            "logs-m365_defender.event-*",
            "logs-sentinel_one_cloud_funnel.*",
            "logs-system.security*",
            "logs-windows.forwarded*",
            "logs-windows.sysmon_operational-*",
            "winlogbeat-*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Potential Local NTLM Relay via HTTP",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Potential Local NTLM Relay via HTTP\n\nNTLM, a suite of Microsoft security protocols, is often targeted by adversaries for credential theft. Attackers may exploit the Windows Printer Spooler service to coerce NTLM authentication over HTTP, potentially elevating privileges. The detection rule identifies suspicious rundll32.exe executions invoking WebDAV client DLLs with specific arguments, signaling attempts to access named pipes via HTTP, indicative of NTLM relay attacks.\n\n### Possible investigation steps\n\n- Review the process execution details for rundll32.exe, focusing on the specific arguments related to davclnt.dll and DavSetCookie, to confirm the presence of suspicious WebDAV client activity.\n- Investigate the network connections initiated by the rundll32.exe process to identify any HTTP requests targeting named pipes, such as those containing \"/print/pipe/\", \"/pipe/spoolss\", or \"/pipe/srvsvc\".\n- Check the system's event logs for any related authentication attempts or failures around the time of the alert to identify potential NTLM relay activity.\n- Analyze the history of the Windows Printer Spooler service on the affected host to determine if it has been recently manipulated or exploited.\n- Correlate the alert with other security events or alerts from data sources like Microsoft Defender for Endpoint or Sysmon to identify any related suspicious activities or patterns.\n- Assess the user account associated with the NTLM authentication attempt to determine if it has been compromised or is being used in an unauthorized manner.\n\n### False positive analysis\n\n- Legitimate administrative tasks using rundll32.exe with WebDAV client DLLs may trigger the rule. Review the context of the execution, such as the user account and the timing, to determine if it aligns with expected administrative activities.\n- Automated software deployment or update processes might use similar rundll32.exe calls. Verify if the process is part of a scheduled or known deployment task and consider excluding these specific processes from the rule.\n- Some third-party applications may use WebDAV for legitimate purposes, which could mimic the behavior detected by the rule. Identify these applications and create exceptions for their known processes to prevent false alerts.\n- System maintenance scripts or tools that interact with network resources via HTTP might inadvertently match the rule's criteria. Ensure these scripts are documented and exclude them if they are verified as non-threatening.\n- Regularly review and update the exclusion list to accommodate changes in legitimate software behavior, ensuring that only verified false positives are excluded to maintain the rule's effectiveness.\n\n### Response and remediation\n\n- Immediately isolate the affected system from the network to prevent further unauthorized access or lateral movement.\n- Terminate any suspicious rundll32.exe processes identified in the alert to stop ongoing malicious activity.\n- Conduct a thorough review of the affected system's event logs and network traffic to identify any additional indicators of compromise or related malicious activity.\n- Reset credentials for any accounts that may have been exposed or compromised during the attack to prevent unauthorized access.\n- Apply the latest security patches and updates to the Windows Printer Spooler service and related components to mitigate known vulnerabilities.\n- Implement network segmentation to limit the exposure of critical services and reduce the risk of similar attacks in the future.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to ensure comprehensive remediation efforts are undertaken.",
        "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n  process.name : \"rundll32.exe\" and\n\n  /* Rundll32 WbeDav Client  */\n  process.args : (\"?:\\\\Windows\\\\System32\\\\davclnt.dll,DavSetCookie\", \"?:\\\\Windows\\\\SysWOW64\\\\davclnt.dll,DavSetCookie\") and\n\n  /* Access to named pipe via http */\n  process.args : (\"http*/print/pipe/*\", \"http*/pipe/spoolss\", \"http*/pipe/srvsvc\")\n",
        "references": [
            "https://github.com/med0x2e/NTLMRelay2Self",
            "https://github.com/topotam/PetitPotam",
            "https://github.com/dirkjanm/krbrelayx/blob/master/printerbug.py"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^9.0.0"
            },
            {
                "package": "windows",
                "version": "^2.5.0"
            },
            {
                "package": "system",
                "version": "^1.64.0"
            },
            {
                "package": "m365_defender",
                "version": "^2.22.0"
            },
            {
                "package": "sentinel_one_cloud_funnel",
                "version": "^1.9.0"
            },
            {
                "package": "crowdstrike",
                "version": "^1.51.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 73,
        "rule_id": "4682fd2c-cfae-47ed-a543-9bed37657aa6",
        "severity": "high",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Credential Access",
            "Tactic: Defense Evasion",
            "Data Source: Elastic Endgame",
            "Data Source: Elastic Defend",
            "Data Source: Windows Security Event Logs",
            "Data Source: Microsoft Defender for Endpoint",
            "Data Source: Sysmon",
            "Data Source: SentinelOne",
            "Data Source: Crowdstrike",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0006",
                    "name": "Credential Access",
                    "reference": "https://attack.mitre.org/tactics/TA0006/"
                },
                "technique": [
                    {
                        "id": "T1212",
                        "name": "Exploitation for Credential Access",
                        "reference": "https://attack.mitre.org/techniques/T1212/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1218",
                        "name": "System Binary Proxy Execution",
                        "reference": "https://attack.mitre.org/techniques/T1218/",
                        "subtechnique": [
                            {
                                "id": "T1218.011",
                                "name": "Rundll32",
                                "reference": "https://attack.mitre.org/techniques/T1218/011/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 314
    },
    "id": "4682fd2c-cfae-47ed-a543-9bed37657aa6_314",
    "type": "security-rule"
}