{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule detects the creation of Pluggable Authentication Module (PAM) shared object files in unusual directories. Attackers may compile PAM shared object files in temporary directories, to move them to system directories later, potentially allowing them to maintain persistence on a compromised system, or harvest account credentials.",
        "false_positives": [
            "Trusted system module updates or allowed Pluggable Authentication Module (PAM) daemon configuration changes."
        ],
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.file*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Pluggable Authentication Module (PAM) Creation in Unusual Directory",
        "query": "file where host.os.type == \"linux\" and event.type == \"creation\" and file.name like \"pam_*.so\" and not file.path like (\n  \"/lib/security/*\",\n  \"/lib64/security/*\",\n  \"/lib/x86_64-linux-gnu/security/*\",\n  \"/usr/lib/security/*\",\n  \"/usr/lib64/security/*\",\n  \"/usr/lib/x86_64-linux-gnu/security/*\"\n) and not (\n  process.name in (\"dockerd\", \"containerd\", \"steam\", \"buildkitd\", \"unsquashfs\", \"pacman\") or\n  file.path like (\n    \"/build/rootImage/nix/store/*\", \"/home/*/.local/share/containers/*\", \"/nix/store/*\", \"/var/lib/containerd/*\",\n    \"/var/snap/*\", \"/usr/share/nix/nix/store/*\", \"/tmp/cura/squashfs-root/*\", \"/home/*/docker/*\", \"/tmp/containerd*\"\n  )\n)\n",
        "references": [
            "https://github.com/zephrax/linux-pam-backdoor",
            "https://github.com/eurialo/pambd",
            "http://0x90909090.blogspot.com/2016/06/creating-backdoor-in-pam-in-5-line-of.html",
            "https://www.trendmicro.com/en_us/research/19/i/skidmap-linux-malware-uses-rootkit-capabilities-to-hide-cryptocurrency-mining-payload.html"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "file.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "file.path",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "5c832156-5785-4c9c-a2e7-0d80d2ba3daa",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Linux",
            "Use Case: Threat Detection",
            "Tactic: Credential Access",
            "Tactic: Persistence",
            "Data Source: Elastic Defend"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1543",
                        "name": "Create or Modify System Process",
                        "reference": "https://attack.mitre.org/techniques/T1543/"
                    }
                ]
            },
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0006",
                    "name": "Credential Access",
                    "reference": "https://attack.mitre.org/tactics/TA0006/"
                },
                "technique": [
                    {
                        "id": "T1556",
                        "name": "Modify Authentication Process",
                        "reference": "https://attack.mitre.org/techniques/T1556/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 1
    },
    "id": "5c832156-5785-4c9c-a2e7-0d80d2ba3daa_1",
    "type": "security-rule"
}