{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Indicates the creation of a scheduled task using Windows event logs. Adversaries can use these to establish persistence, move laterally, and/or escalate privileges.",
        "false_positives": [
            "Legitimate scheduled tasks may be created during installation of new software."
        ],
        "from": "now-9m",
        "index": [
            "logs-system.security*",
            "logs-windows.forwarded*",
            "winlogbeat-*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "A scheduled task was created",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating A scheduled task was created\n\nScheduled tasks in Windows automate routine tasks, enhancing efficiency. However, adversaries exploit this feature to maintain persistence, move laterally, or escalate privileges by creating malicious tasks. The detection rule identifies suspicious task creation by filtering out benign tasks and those initiated by system accounts, focusing on potential threats. This approach helps security analysts pinpoint unauthorized task creation indicative of malicious activity.\n\n### Possible investigation steps\n\n- Review the user account associated with the task creation to determine if it is a known and authorized user, ensuring it is not a system account by checking that the username does not end with a dollar sign.\n- Examine the task name and path in the event data to identify if it matches any known benign tasks or if it appears suspicious or unfamiliar.\n- Investigate the origin of the task creation by checking the source IP address or hostname, if available, to determine if it aligns with expected network activity.\n- Check the task's scheduled actions and triggers to understand what the task is designed to execute and when, looking for any potentially harmful or unexpected actions.\n- Correlate the task creation event with other security events or logs around the same time to identify any related suspicious activities or anomalies.\n\n### False positive analysis\n\n- Scheduled tasks created by system accounts or computer accounts are often benign. These can be excluded by filtering out user names ending with a dollar sign, which typically represent system accounts.\n- Tasks associated with common software updates or maintenance, such as those from Hewlett-Packard or Microsoft Visual Studio, are generally non-threatening. These can be excluded by specifying their full task names in the exclusion list.\n- OneDrive update tasks are frequently triggered and are usually safe. Exclude these by using patterns that match their task names, such as those starting with \"OneDrive Standalone Update Task\".\n- Regularly review and update the exclusion list to include any new benign tasks that are identified over time, ensuring that the rule remains effective without generating unnecessary alerts.\n\n### Response and remediation\n\n- Immediately isolate the affected system from the network to prevent potential lateral movement by the adversary.\n- Terminate any suspicious scheduled tasks identified by the alert to halt any ongoing malicious activity.\n- Conduct a thorough review of the system's scheduled tasks to identify and remove any other unauthorized or suspicious tasks.\n- Restore the system from a known good backup if any malicious activity has been confirmed and has potentially compromised system integrity.\n- Update and patch the system to the latest security standards to close any vulnerabilities that may have been exploited.\n- Monitor the system and network for any signs of re-infection or further unauthorized scheduled task creation.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if additional systems are affected.",
        "query": "iam where event.action == \"scheduled-task-created\" and\n\n /* excluding tasks created by the computer account */\n not user.name : \"*$\" and\n\n /* TaskContent is not parsed, exclude by full taskname noisy ones */\n not winlog.event_data.TaskName : (\n              \"\\\\CreateExplorerShellUnelevatedTask\",\n              \"\\\\Hewlett-Packard\\\\HPDeviceCheck\",\n              \"\\\\Hewlett-Packard\\\\HP Support Assistant\\\\WarrantyChecker\",\n              \"\\\\Hewlett-Packard\\\\HP Support Assistant\\\\WarrantyChecker_backup\",\n              \"\\\\Hewlett-Packard\\\\HP Web Products Detection\",\n              \"\\\\Microsoft\\\\VisualStudio\\\\Updates\\\\BackgroundDownload\",\n              \"\\\\OneDrive Standalone Update Task-S-1-5-21*\",\n              \"\\\\OneDrive Standalone Update Task-S-1-12-1-*\"\n )\n",
        "references": [
            "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698"
        ],
        "related_integrations": [
            {
                "package": "system",
                "version": "^1.6.4"
            },
            {
                "package": "windows",
                "version": "^2.0.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "user.name",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "winlog.event_data.TaskName",
                "type": "unknown"
            }
        ],
        "risk_score": 21,
        "rule_id": "92a6faf5-78ec-4e25-bea1-73bacc9b59d9",
        "severity": "low",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Persistence",
            "Data Source: Windows Security Event Logs",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1053",
                        "name": "Scheduled Task/Job",
                        "reference": "https://attack.mitre.org/techniques/T1053/",
                        "subtechnique": [
                            {
                                "id": "T1053.005",
                                "name": "Scheduled Task",
                                "reference": "https://attack.mitre.org/techniques/T1053/005/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 111
    },
    "id": "92a6faf5-78ec-4e25-bea1-73bacc9b59d9_111",
    "type": "security-rule"
}