{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies the deletion of an Identity and Access Management (IAM) service account key in Google Cloud Platform (GCP). Each service account is associated with two sets of public/private RSA key pairs that are used to authenticate. If a key is deleted, the application will no longer be able to access Google Cloud resources using that key. A security best practice is to rotate your service account keys regularly.",
        "false_positives": [
            "Service account key deletions may be done by a system or network administrator. Verify whether the user email, resource name, and/or hostname should be making changes in your environment. Key deletions by unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."
        ],
        "index": [
            "filebeat-*",
            "logs-gcp*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "GCP IAM Service Account Key Deletion",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating GCP IAM Service Account Key Deletion\n\nIn GCP, IAM service account keys authenticate applications to access resources. Regular key rotation is crucial for security. Adversaries might delete keys to disrupt services or cover tracks after unauthorized access. The detection rule monitors audit logs for successful key deletions, flagging potential misuse or policy violations, aiding in timely investigation and response.\n\n### Possible investigation steps\n\n- Review the audit logs for the specific event.action: google.iam.admin.v*.DeleteServiceAccountKey to identify the service account key that was deleted.\n- Check the event.outcome: success to confirm the key deletion was successful and not an attempted action.\n- Identify the user or service account responsible for the deletion by examining the actor information in the audit logs.\n- Investigate the context around the deletion event, including the timestamp and any preceding or subsequent actions in the logs, to understand the sequence of events.\n- Verify if the key deletion aligns with the organization's key rotation policy or if it appears suspicious or unauthorized.\n- Assess the impact of the key deletion on applications or services that rely on the affected service account for authentication.\n- If unauthorized activity is suspected, initiate a broader investigation into potential unauthorized access or other malicious activities involving the affected service account.\n\n### False positive analysis\n\n- Routine key rotation activities by administrators can trigger alerts. To manage this, establish a baseline of expected key rotation schedules and exclude these from alerts.\n- Automated scripts or tools that perform regular maintenance and key management might cause false positives. Identify these scripts and whitelist their actions in the monitoring system.\n- Service account keys associated with non-critical or test environments may be deleted frequently as part of normal operations. Consider excluding these environments from the alerting criteria to reduce noise.\n- Temporary service accounts used for short-term projects or testing may have keys deleted as part of their lifecycle. Document these accounts and adjust the detection rule to ignore deletions from these specific accounts.\n\n### Response and remediation\n\n- Immediately revoke any remaining access for the compromised service account to prevent further unauthorized access to Google Cloud resources.\n- Investigate the audit logs to identify any unauthorized actions performed using the deleted key and assess the impact on affected resources.\n- Recreate the deleted service account key if necessary, ensuring that the new key is securely stored and access is restricted to authorized personnel only.\n- Implement additional monitoring on the affected service account to detect any further suspicious activities or unauthorized access attempts.\n- Escalate the incident to the security operations team for a comprehensive review and to determine if further investigation or response is required.\n- Review and update the key rotation policy to ensure that service account keys are rotated more frequently and securely managed to prevent similar incidents in the future.",
        "query": "event.dataset:gcp.audit and event.action:google.iam.admin.v*.DeleteServiceAccountKey and event.outcome:success\n",
        "references": [
            "https://cloud.google.com/iam/docs/service-accounts",
            "https://cloud.google.com/iam/docs/creating-managing-service-account-keys"
        ],
        "related_integrations": [
            {
                "integration": "audit",
                "package": "gcp",
                "version": "^2.41.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.outcome",
                "type": "keyword"
            }
        ],
        "risk_score": 21,
        "rule_id": "9890ee61-d061-403d-9bf6-64934c51f638",
        "setup": "The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
        "severity": "low",
        "tags": [
            "Domain: Cloud",
            "Data Source: GCP",
            "Data Source: Google Cloud Platform",
            "Use Case: Identity and Access Audit",
            "Tactic: Persistence",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1098",
                        "name": "Account Manipulation",
                        "reference": "https://attack.mitre.org/techniques/T1098/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 106
    },
    "id": "9890ee61-d061-403d-9bf6-64934c51f638_106",
    "type": "security-rule"
}