{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This detection correlates Suricata alerts with Elastic Defend network events to identify the source process performing the network activity.",
        "from": "now-9m",
        "index": [
            "logs-endpoint.events.network-*",
            "filebeat-*",
            "logs-suricata.*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Suricata and Elastic Defend Network Correlation",
        "note": "## Triage and analysis\n\n### Investigating Suricata and Elastic Defend Network Correlation\n\n### Possible investigation steps\n\n- Investigate in the Timeline feature the two events matching this correlation (Suricata and Elastic Defend).\n- Review the process details like command_line, privileges, global relevance and reputation.\n- Assess the destination.ip reputation and global relevance.\n- Review the parent process execution details like command_line, global relevance and reputation.\n- Examine all network connection details performed by the process during last 48h.\n- Correlate the alert with other security events or logs to identify any patterns or additional indicators of compromise related to the same process or network activity.\n\n### False positive analysis\n\n- Trusted system or third party processes performing network activity that looks like beaconing.\n\n### Response and remediation\n\n- Immediately isolate the affected system from the network to prevent further unauthorized access or data exfiltration.\n- Terminate the suspicious processes and all associated children and parents.\n- Implement network-level controls to block traffic to the destination.ip.\n- Conduct a thorough review of the system's configuration files to identify unauthorized changes.\n- Reset credentials for any accounts associated with the source machine.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if additional systems are affected.\n",
        "query": "sequence by source.port, source.ip, destination.ip with maxspan=5s\n [network where event.dataset == \"suricata.eve\" and event.kind == \"alert\" and\n  event.severity != 3 and source.ip != null and destination.ip != null and\n  not source.domain : (\"*nessusscan*\", \"SCCMPS*\") and\n  not rule.name in (\"ET INFO SMB2 NT Create AndX Request For a Powershell .ps1 File\", \"ET SCAN MS Terminal Server Traffic on Non-standard Port\")]\n [network where event.module == \"endpoint\" and event.action in (\"disconnect_received\", \"connection_attempted\") and\n  not process.executable in (\"System\", \"C:\\\\Program Files (x86)\\\\Admin Arsenal\\\\PDQ Inventory\\\\PDQInventoryService.exe\") and \n  not process.executable : \"C:\\\\Windows\\\\AdminArsenal\\\\PDQInventory-Scanner\\\\service-*\\\\exec\\\\PDQInventoryScanner.exe\"]\n",
        "references": [
            "https://attack.mitre.org/tactics/TA0011/",
            "https://www.elastic.co/docs/reference/integrations/suricata",
            "https://www.elastic.co/docs/reference/integrations/endpoint"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            },
            {
                "package": "suricata",
                "version": "^2.0.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "destination.ip",
                "type": "ip"
            },
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.kind",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.module",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.severity",
                "type": "long"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "rule.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "source.domain",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "source.ip",
                "type": "ip"
            },
            {
                "ecs": true,
                "name": "source.port",
                "type": "long"
            }
        ],
        "risk_score": 47,
        "rule_id": "9edd000e-cbd1-4d6a-be72-2197b5625a05",
        "severity": "medium",
        "tags": [
            "Domain: Endpoint",
            "Domain: Network",
            "OS: Linux",
            "OS: Windows",
            "OS: macOS",
            "Use Case: Threat Detection",
            "Tactic: Command and Control",
            "Data Source: Elastic Defend",
            "Data Source: Suricata",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0011",
                    "name": "Command and Control",
                    "reference": "https://attack.mitre.org/tactics/TA0011/"
                },
                "technique": []
            }
        ],
        "type": "eql",
        "version": 2
    },
    "id": "9edd000e-cbd1-4d6a-be72-2197b5625a05_2",
    "type": "security-rule"
}