{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "An adversary can use the Windows command line debugging utility cdb.exe to execute commands or shellcode. This rule looks for those instances and where the cdb.exe binary is outside of the normal WindowsKit installation paths.",
        "from": "now-9m",
        "index": [
            "endgame-*",
            "logs-crowdstrike.fdr*",
            "logs-endpoint.events.process-*",
            "logs-m365_defender.event-*",
            "logs-sentinel_one_cloud_funnel.*",
            "logs-system.security*",
            "logs-windows.sysmon_operational-*"
        ],
        "language": "eql",
        "license": "Elastic License v2",
        "name": "Execution via Windows Command Debugging Utility",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Execution via Windows Command Debugging Utility\n\nThe Windows command line debugging utility, cdb.exe, is a legitimate tool used for debugging applications. However, adversaries can exploit it to execute unauthorized commands or shellcode, bypassing security measures. The detection rule identifies suspicious use of cdb.exe by monitoring its execution outside standard installation paths and specific command-line arguments, indicating potential misuse for defense evasion.\n\n### Possible investigation steps\n\n- Review the process execution details to confirm the presence of cdb.exe running from non-standard paths, as specified in the query.\n- Examine the command-line arguments used with cdb.exe, particularly looking for \"-cf\", \"-c\", or \"-pd\", to understand the potential actions or scripts being executed.\n- Investigate the parent process of cdb.exe to determine how it was launched and identify any associated suspicious activity or processes.\n- Check the user account associated with the cdb.exe execution to assess if it aligns with expected behavior or if it indicates potential compromise.\n- Analyze recent system logs and security alerts for any related or preceding suspicious activities that might correlate with the execution of cdb.exe.\n- Review network activity from the host to identify any unusual outbound connections that could suggest data exfiltration or command-and-control communication.\n\n### False positive analysis\n\n- Legitimate debugging activities by developers or IT staff using cdb.exe outside standard paths can trigger alerts. To manage this, create exceptions for known user accounts or specific machines frequently used for development.\n- Automated testing environments may execute cdb.exe with command-line arguments for legitimate purposes. Identify these environments and exclude their processes from triggering alerts.\n- Software installations or updates might temporarily use cdb.exe in non-standard paths. Monitor installation logs and exclude these specific instances if they are verified as part of legitimate software deployment.\n- Security tools or scripts that leverage cdb.exe for monitoring or analysis can be mistaken for malicious activity. Document these tools and add them to the exclusion list to prevent false positives.\n\n### Response and remediation\n\n- Isolate the affected system from the network to prevent further unauthorized access or execution of malicious commands.\n- Terminate any suspicious instances of cdb.exe running outside the standard installation paths to halt potential malicious activity.\n- Conduct a forensic analysis of the affected system to identify any unauthorized changes or additional malicious payloads that may have been executed.\n- Restore the system from a known good backup if any unauthorized changes or malware are detected, ensuring that the backup is clean and uncompromised.\n- Update and patch the system to the latest security standards to close any vulnerabilities that may have been exploited.\n- Implement application whitelisting to prevent unauthorized execution of cdb.exe from non-standard paths.\n- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if the threat is part of a larger attack campaign.",
        "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n (?process.pe.original_file_name == \"CDB.Exe\" or process.name : \"cdb.exe\") and\n  process.args : (\"-cf\", \"-c\", \"-pd\") and\n  not process.executable : (\n        \"?:\\\\Program Files (x86)\\\\*\\\\cdb.exe\",\n        \"?:\\\\Program Files\\\\*\\\\cdb.exe\",\n        \"\\\\Device\\\\HarddiskVolume?\\\\Program Files (x86)\\\\*\\\\cdb.exe\",\n        \"\\\\Device\\\\HarddiskVolume?\\\\Program Files\\\\*\\\\cdb.exe\"\n  )\n",
        "references": [
            "https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/"
        ],
        "related_integrations": [
            {
                "package": "endpoint",
                "version": "^8.2.0"
            },
            {
                "package": "windows",
                "version": "^2.0.0"
            },
            {
                "package": "system",
                "version": "^1.6.4"
            },
            {
                "package": "sentinel_one_cloud_funnel",
                "version": "^1.0.0"
            },
            {
                "package": "m365_defender",
                "version": "^2.0.0"
            },
            {
                "package": "crowdstrike",
                "version": "^1.1.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "host.os.type",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.args",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.executable",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "process.pe.original_file_name",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "bdfaddc4-4438-48b4-bc43-9f5cf8151c46",
        "severity": "medium",
        "tags": [
            "Domain: Endpoint",
            "OS: Windows",
            "Use Case: Threat Detection",
            "Tactic: Defense Evasion",
            "Data Source: Elastic Endgame",
            "Data Source: Elastic Defend",
            "Data Source: Sysmon",
            "Data Source: SentinelOne",
            "Data Source: Microsoft Defender for Endpoint",
            "Data Source: Crowdstrike",
            "Data Source: Windows Security Event Logs",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005/"
                },
                "technique": [
                    {
                        "id": "T1218",
                        "name": "System Binary Proxy Execution",
                        "reference": "https://attack.mitre.org/techniques/T1218/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "eql",
        "version": 105
    },
    "id": "bdfaddc4-4438-48b4-bc43-9f5cf8151c46_105",
    "type": "security-rule"
}