{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Generates a detection alert for each Splunk alert written to the configured indices. Enabling this rule allows you to immediately begin investigating Splunk alerts in the app.",
        "from": "now-2m",
        "index": [
            "logs-splunk.alert-*"
        ],
        "interval": "1m",
        "language": "kuery",
        "license": "Elastic License v2",
        "max_signals": 1000,
        "name": "Splunk External Alerts",
        "note": "## Triage and analysis\n\n### Investigating Splunk External Alerts\n\nSplunk monitors and analyzes data, often used in security environments to track and respond to potential threats. The 'Behavior - Detected - Splunk Alerts' rule identifies such manipulations by flagging alerts enabling timely investigation and response.\n\n### Possible investigation steps\n\n- Examine the specific indices where the alert was written to identify any unusual or unauthorized activity.\n- Cross-reference the alert with recent changes or activities in the Splunk environment to determine if the alert could be a result of legitimate administrative actions.\n- Investigate the source and context of the alert to identify any patterns or anomalies that could indicate manipulation or false positives.\n- Check for any related alerts or logs that might provide additional context or evidence of adversarial behavior.\n- Consult the Splunk investigation guide and resources tagged in the alert for specific guidance on handling similar threats.\n\n### False positive analysis\n\n- Alerts triggered by routine Splunk maintenance activities can be false positives. To manage these, identify and document regular maintenance schedules and create exceptions for alerts generated during these times.\n- Frequent alerts from specific indices that are known to contain non-threatening data can be excluded by adjusting the rule to ignore these indices, ensuring only relevant alerts are investigated.\n- Alerts generated by automated scripts or tools that interact with Splunk for legitimate purposes can be false positives. Review and whitelist these scripts or tools to prevent unnecessary alerts.\n- If certain user actions consistently trigger alerts but are verified as non-malicious, consider creating user-specific exceptions to reduce noise and focus on genuine threats.\n- Regularly review and update the list of exceptions to ensure they remain relevant and do not inadvertently exclude new or evolving threats.\n\n### Response and remediation\n\n- Immediately isolate affected systems to prevent further manipulation of Splunk alerts and potential spread of malicious activity.\n- Review and validate the integrity of the Splunk alert indices to ensure no unauthorized changes have been made.\n- Restore any compromised Splunk alert configurations from a known good backup to ensure accurate monitoring and alerting.\n- Conduct a thorough audit of user access and permissions within Splunk to identify and revoke any unauthorized access.\n- Escalate the incident to the security operations center (SOC) for further analysis and to determine if additional systems or data have been affected.\n- Implement enhanced monitoring on Splunk indices to detect any future unauthorized changes or suspicious activities.\n- Document the incident details and response actions taken for future reference and to improve incident response procedures.\n",
        "query": "event.kind: alert and event.module: splunk\n",
        "references": [
            "https://docs.elastic.co/en/integrations/splunk"
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.kind",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.module",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "risk_score_mapping": [
            {
                "field": "event.risk_score",
                "operator": "equals",
                "value": ""
            }
        ],
        "rule_id": "d3b6222f-537e-4b84-956a-3ebae2dcf811",
        "rule_name_override": "splunk.alert.source",
        "setup": "## Setup\n\n### Splunk Alert Integration\nThis rule is designed to capture alert events generated by the Splunk integration and promote them as Elastic detection alerts.\n\nTo capture Splunk alerts, install and configure the Splunk integration to ingest alert events into the `logs-splunk.alert-*` index pattern.\n\nIf this rule is enabled alongside the External Alerts promotion rule (UUID: eb079c62-4481-4d6e-9643-3ca499df7aaa), you may receive duplicate alerts for the same Splunk events. Consider adding a rule exception for the External Alert rule to exclude event.module:splunk to avoid receiving duplicate alerts.\n\n### Additional notes\n\nFor information on troubleshooting the maximum alerts warning please refer to this [guide](https://www.elastic.co/guide/en/security/current/alerts-ui-monitor.html#troubleshoot-max-alerts).\n",
        "severity": "medium",
        "severity_mapping": [
            {
                "field": "event.severity",
                "operator": "equals",
                "severity": "low",
                "value": "21"
            },
            {
                "field": "event.severity",
                "operator": "equals",
                "severity": "medium",
                "value": "47"
            },
            {
                "field": "event.severity",
                "operator": "equals",
                "severity": "high",
                "value": "73"
            },
            {
                "field": "event.severity",
                "operator": "equals",
                "severity": "critical",
                "value": "99"
            }
        ],
        "tags": [
            "Data Source: Splunk",
            "Use Case: Threat Detection",
            "Resources: Investigation Guide",
            "Promotion: External Alerts"
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 1
    },
    "id": "d3b6222f-537e-4b84-956a-3ebae2dcf811_1",
    "type": "security-rule"
}