{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies an Azure Active Directory (AD) Global Administrator role addition to a Privileged Identity Management (PIM) user account. PIM is a service that enables you to manage, control, and monitor access to important resources in an organization. Users who are assigned to the Global administrator role can read and modify any administrative setting in your Azure AD organization.",
        "false_positives": [
            "Global administrator additions may be done by a system or network administrator. Verify whether the username, hostname, and/or resource name should be making changes in your environment. Global administrator additions from unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule."
        ],
        "index": [
            "logs-azure.auditlogs-*",
            "filebeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Azure Global Administrator Role Addition to PIM User",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Azure Global Administrator Role Addition to PIM User\n\nAzure AD's Global Administrator role grants extensive access, allowing users to modify any administrative setting. Privileged Identity Management (PIM) helps manage and monitor such access. Adversaries may exploit this by adding themselves or others to this role, gaining persistent control. The detection rule identifies suspicious role additions by monitoring specific audit logs, focusing on successful role assignments to PIM users, thus helping to flag potential unauthorized access attempts.\n\n### Possible investigation steps\n\n- Review the Azure audit logs to confirm the details of the role addition event, focusing on the event.dataset:azure.auditlogs and azure.auditlogs.properties.category:RoleManagement fields.\n- Identify the user account that was added to the Global Administrator role by examining the azure.auditlogs.properties.target_resources.*.display_name field.\n- Check the event.outcome field to ensure the role addition was successful and not a failed attempt.\n- Investigate the user account's recent activities and login history to determine if there are any anomalies or signs of compromise.\n- Verify if the role addition aligns with any recent administrative changes or requests within the organization to rule out legitimate actions.\n- Assess the potential impact of the role addition by reviewing the permissions and access levels granted to the user.\n- If suspicious activity is confirmed, initiate a response plan to remove unauthorized access and secure the affected accounts.\n\n### False positive analysis\n\n- Routine administrative tasks may trigger alerts when legitimate IT staff are assigned the Global Administrator role for maintenance or updates. To manage this, create exceptions for known IT personnel or scheduled maintenance windows.\n- Automated scripts or tools used for role assignments can cause false positives if they frequently add users to the Global Administrator role. Consider excluding these automated processes from monitoring or adjusting the detection rule to account for their activity.\n- Temporary project-based role assignments might be flagged as suspicious. Implement a process to document and pre-approve such assignments, allowing for their exclusion from alerts.\n- Training or onboarding sessions where new administrators are temporarily granted elevated access can result in false positives. Establish a protocol to notify the monitoring team of these events in advance, so they can be excluded from the detection rule.\n\n### Response and remediation\n\n- Immediately revoke the Global Administrator role from any unauthorized PIM user identified in the alert to prevent further unauthorized access.\n- Conduct a thorough review of recent changes made by the affected account to identify any unauthorized modifications or suspicious activities.\n- Reset the credentials of the compromised account and enforce multi-factor authentication (MFA) to secure the account against further unauthorized access.\n- Notify the security team and relevant stakeholders about the incident for awareness and further investigation.\n- Implement additional monitoring on the affected account and related systems to detect any further suspicious activities.\n- Review and update access policies and role assignments in Azure AD to ensure that only necessary personnel have elevated privileges.\n- Document the incident and response actions taken for future reference and to improve incident response procedures.",
        "query": "event.dataset:azure.auditlogs and azure.auditlogs.properties.category:RoleManagement and\n    azure.auditlogs.operation_name:(\"Add eligible member to role in PIM completed (permanent)\" or\n                                    \"Add member to role in PIM completed (timebound)\") and\n    azure.auditlogs.properties.target_resources.*.display_name:\"Global Administrator\" and\n    event.outcome:(Success or success)\n",
        "references": [
            "https://docs.microsoft.com/en-us/azure/active-directory/users-groups-roles/directory-assign-admin-roles"
        ],
        "related_integrations": [
            {
                "package": "azure",
                "version": "^1.22.0"
            }
        ],
        "required_fields": [
            {
                "ecs": false,
                "name": "azure.auditlogs.operation_name",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "azure.auditlogs.properties.category",
                "type": "keyword"
            },
            {
                "ecs": false,
                "name": "azure.auditlogs.properties.target_resources.*.display_name",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.outcome",
                "type": "keyword"
            }
        ],
        "risk_score": 73,
        "rule_id": "ed9ecd27-e3e6-4fd9-8586-7754803f7fc8",
        "setup": "The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
        "severity": "high",
        "tags": [
            "Domain: Cloud",
            "Data Source: Azure",
            "Use Case: Identity and Access Audit",
            "Tactic: Persistence",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0003",
                    "name": "Persistence",
                    "reference": "https://attack.mitre.org/tactics/TA0003/"
                },
                "technique": [
                    {
                        "id": "T1098",
                        "name": "Account Manipulation",
                        "reference": "https://attack.mitre.org/techniques/T1098/",
                        "subtechnique": [
                            {
                                "id": "T1098.003",
                                "name": "Additional Cloud Roles",
                                "reference": "https://attack.mitre.org/techniques/T1098/003/"
                            }
                        ]
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 106
    },
    "id": "ed9ecd27-e3e6-4fd9-8586-7754803f7fc8_106",
    "type": "security-rule"
}