{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies a transport rule creation in Microsoft 365. As a best practice, Exchange Online mail transport rules should not be set to forward email to domains outside of your organization. An adversary may create transport rules to exfiltrate data.",
        "false_positives": [
            "A new transport rule may be created by a system or network administrator. Verify that the configuration change was expected. Exceptions can be added to this rule to filter expected behavior."
        ],
        "from": "now-9m",
        "index": [
            "logs-o365.audit-*",
            "filebeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Microsoft 365 Exchange Transport Rule Creation",
        "note": "## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Microsoft 365 Exchange Transport Rule Creation\n\nMicrosoft 365 Exchange transport rules automate email handling, applying actions like forwarding or blocking based on conditions. While beneficial for managing communications, adversaries can exploit these rules to redirect emails externally, facilitating data exfiltration. The detection rule monitors successful creation of new transport rules, flagging potential misuse by identifying specific actions and outcomes in audit logs.\n\n### Possible investigation steps\n\n- Review the audit logs for the event.dataset:o365.audit to identify the user account responsible for creating the new transport rule.\n- Examine the event.provider:Exchange and event.category:web fields to confirm the context and source of the rule creation.\n- Investigate the event.action:\"New-TransportRule\" to understand the specific conditions and actions defined in the newly created transport rule.\n- Check the event.outcome:success to ensure the rule creation was completed successfully and assess if it aligns with expected administrative activities.\n- Analyze the transport rule settings to determine if it includes actions that forward emails to external domains, which could indicate potential data exfiltration.\n- Correlate the findings with other security events or alerts to identify any patterns or anomalies that might suggest malicious intent.\n\n### False positive analysis\n\n- Routine administrative tasks may trigger alerts when IT staff create or modify transport rules for legitimate purposes. To manage this, establish a baseline of expected rule creation activities and exclude these from alerts.\n- Automated systems or third-party applications that integrate with Microsoft 365 might create transport rules as part of their normal operation. Identify these systems and create exceptions for their known actions.\n- Changes in organizational policies or email handling procedures can lead to legitimate rule creations. Document these changes and update the monitoring system to recognize them as non-threatening.\n- Regular audits or compliance checks might involve creating temporary transport rules. Coordinate with audit teams to schedule these activities and temporarily adjust alert thresholds or exclusions during these periods.\n\n### Response and remediation\n\n- Immediately disable the newly created transport rule to prevent further unauthorized email forwarding or data exfiltration.\n- Conduct a thorough review of the audit logs to identify any other suspicious transport rules or related activities that may indicate a broader compromise.\n- Isolate the affected user accounts or systems associated with the creation of the transport rule to prevent further unauthorized access or actions.\n- Reset passwords and enforce multi-factor authentication for the affected accounts to secure access and prevent recurrence.\n- Notify the security team and relevant stakeholders about the incident for awareness and further investigation.\n- Escalate the incident to the incident response team if there is evidence of a broader compromise or if sensitive data has been exfiltrated.\n- Implement enhanced monitoring and alerting for transport rule changes to detect and respond to similar threats more effectively in the future.",
        "query": "event.dataset:o365.audit and event.provider:Exchange and event.category:web and event.action:\"New-TransportRule\" and event.outcome:success\n",
        "references": [
            "https://docs.microsoft.com/en-us/powershell/module/exchange/new-transportrule?view=exchange-ps",
            "https://docs.microsoft.com/en-us/exchange/security-and-compliance/mail-flow-rules/mail-flow-rules"
        ],
        "related_integrations": [
            {
                "package": "o365",
                "version": "^2.11.0"
            }
        ],
        "required_fields": [
            {
                "ecs": true,
                "name": "event.action",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.category",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.dataset",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.outcome",
                "type": "keyword"
            },
            {
                "ecs": true,
                "name": "event.provider",
                "type": "keyword"
            }
        ],
        "risk_score": 47,
        "rule_id": "ff4dd44a-0ac6-44c4-8609-3f81bc820f02",
        "setup": "The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.",
        "severity": "medium",
        "tags": [
            "Domain: Cloud",
            "Data Source: Microsoft 365",
            "Use Case: Configuration Audit",
            "Tactic: Exfiltration",
            "Resources: Investigation Guide"
        ],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0010",
                    "name": "Exfiltration",
                    "reference": "https://attack.mitre.org/tactics/TA0010/"
                },
                "technique": [
                    {
                        "id": "T1537",
                        "name": "Transfer Data to Cloud Account",
                        "reference": "https://attack.mitre.org/techniques/T1537/"
                    }
                ]
            }
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 210
    },
    "id": "ff4dd44a-0ac6-44c4-8609-3f81bc820f02_210",
    "type": "security-rule"
}