- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: device.manufacturer
- external: ecs
  name: device.model.name
- external: ecs
  name: device.serial_number
- external: ecs
  name: ecs.version
- external: ecs
  name: event.agent_id_status
- external: ecs
  name: event.category
- external: ecs
  name: event.created
- external: ecs
  name: event.id
- external: ecs
  name: event.ingested
  type: date
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: host.architecture
- external: ecs
  name: host.id
- external: ecs
  name: host.ip
- external: ecs
  name: host.mac
- external: ecs
  name: host.name
- external: ecs
  name: host.os.name
- external: ecs
  name: host.os.platform
- external: ecs
  name: host.os.version
- external: ecs
  name: host.type
- external: ecs
  name: observer.product
  type: constant_keyword
  value: Island Enterprise Browser
- external: ecs
  name: observer.vendor
  type: constant_keyword
  value: Island
- external: ecs
  name: organization.id
- external: ecs
  name: related.hosts
- external: ecs
  name: related.ip
- external: ecs
  name: related.user
- external: ecs
  name: user.domain
- external: ecs
  name: user.email
- external: ecs
  name: user.id
- external: ecs
  name: user.name
- external: ecs
  name: user_agent.name
