- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: ecs.version
- external: ecs
  name: error.code
- external: ecs
  name: error.id
- external: ecs
  name: error.message
- external: ecs
  name: event.action
- external: ecs
  name: event.created
- external: ecs
  name: event.end
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.start
- external: ecs
  name: host.domain
- external: ecs
  name: host.geo.country_name
- external: ecs
  name: message
- external: ecs
  name: observer.vendor
  type: constant_keyword
  value: Axonius
- external: ecs
  name: related.hosts
- external: ecs
  name: related.ip
- external: ecs
  name: related.user
- external: ecs
  name: rule.description
- external: ecs
  name: rule.id
- external: ecs
  name: rule.name
- external: ecs
  name: rule.reference
- external: ecs
  name: rule.ruleset
- external: ecs
  name: service.type
- external: ecs
  name: user.email
- external: ecs
  name: user.id
- external: ecs
  name: user.name
