- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: tags
- external: ecs
  name: error.message
- external: ecs
  name: event.category
- external: ecs
  name: event.ingested
- external: ecs
  name: event.created
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: event.original
- external: ecs
  name: user.email
- external: ecs
  name: user.roles
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.scanner_stats
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.as.number
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.marking.tlp
- external: ecs
  name: threat.indicator.port
- external: ecs
  name: threat.indicator.registry.key
- external: ecs
  name: threat.indicator.registry.value
- external: ecs
  name: threat.indicator.file.size
- external: ecs
  name: threat.indicator.file.type
- external: ecs
  name: threat.indicator.file.name
- external: ecs
  name: organization.id
- external: ecs
  name: labels
- name: threat.indicator.email.subject
  type: keyword
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_misp
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_misp.threat_attributes
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: MISP
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_misp-56ed8040-6c7d-11ec-9bce-f7a4dc94c294
