- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
  value: 'logs'
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
  value: 'sysdig.policies'
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: event.dataset
  type: constant_keyword
  description: Data stream / event dataset.
  value: 'sysdig.policies'
- name: event.module
  type: constant_keyword
  description: The module the event belongs to.
  value: sysdig
- name: event.category
  type: constant_keyword
  description: The category the event belongs to.
  value: configuration
- name: input.type
  type: constant_keyword
- name: '@timestamp'
  type: date
  description: Event timestamp with nanos.
