- name: ecs.version
  external: ecs
- name: message
  external: ecs
- name: error.message
  external: ecs
- name: event.original
  external: ecs
- name: tags
  external: ecs
- name: event.kind
  external: ecs
- name: event.category
  external: ecs
- name: event.type
  external: ecs
- name: event.outcome
  external: ecs
- name: event.action
  external: ecs
- name: event.id
  external: ecs
- name: event.url
  external: ecs
- name: event.created
  external: ecs
- name: event.start
  external: ecs
- name: event.end
  external: ecs
- name: user.name
  external: ecs
- name: user.id
  external: ecs
- name: user.full_name
  external: ecs
- name: organization.id
  external: ecs
- name: organization.name
  external: ecs
- name: observer.vendor
  external: ecs
  type: constant_keyword
  value: HackerOne
- name: observer.product
  external: ecs
  type: constant_keyword
  value: HackerOne
- name: vulnerability.id
  external: ecs
- name: vulnerability.report_id
  external: ecs
- name: vulnerability.reference
  external: ecs
- name: vulnerability.severity
  external: ecs
- name: vulnerability.classification
  external: ecs
- name: vulnerability.enumeration
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.score.base
  external: ecs
- name: vulnerability.score.version
  external: ecs
- name: vulnerability.scanner.vendor
  external: ecs
  type: constant_keyword
  value: HackerOne
- name: related.user
  external: ecs
- name: related.hosts
  external: ecs
- name: url.original
  external: ecs
