- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: error.message
- external: ecs
  name: event.category
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.original
- external: ecs
  name: event.severity
- external: ecs
  name: event.created
- external: ecs
  name: tags
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.fragment
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.reference
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.tactic.name
- external: ecs
  name: threat.tactic.id
- external: ecs
  name: threat.tactic.reference
# Manually define this as a workaround for failing tests and validation
- name: threat.indicator.name
  level: extended
  type: keyword
  description: The display name indicator in an UI friendly format
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_cybersixgill
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_cybersixgill.threat
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: Cybersixgill Darkfeed
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_cybersixgill-c75353f0-5be8-11ec-9302-152fd766c738