{
    "id": "2140f083-6e39-4df4-ba41-aa1f41cb81b8",
    "type": "security-rule",
    "attributes": {
        "name": "High number of SCAP Failures",
        "tags": [
            "TYCHON",
            "CCRI"
        ],
        "interval": "1h",
        "enabled": true,
        "description": "TYCHON has reported a high number of SCAP failures for an endpoint.  This can indicate a very weak security posture for an endpoint.",
        "risk_score": 47,
        "severity": "medium",
        "note": "The system may need to be isolated.  Investigate the SCAP results for this system and perform fixes for all High and Medium checks.  ",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-3660s",
        "rule_id": "2140f083-6e39-4df4-ba41-aa1f41cb81b8",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0007",
                    "reference": "https://attack.mitre.org/tactics/TA0007",
                    "name": "Discovery"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "threshold",
        "language": "kuery",
        "data_view_id": "7d972a32-d117-4963-a7bf-58fc65fb1ee8",
        "query": "rule.result : \"fail\" and not rule.severity : \"low\" ",
        "filters": [],
        "threshold": {
            "field": [
                "tychon.id"
            ],
            "value": 20,
            "cardinality": []
        },
        "throttle": "no_actions",
        "actions": []
    }
}