{
    "id": "2e9c9ac0-1138-11ee-af86-538da1394f27",
    "type": "security-rule",
    "attributes": {
        "name": "Critical Vulnerability Failed",
        "tags": [
            "TYCHON",
            "CCRI",
            "CVE"
        ],
        "interval": "5m",
        "enabled": true,
        "description": "A vulnerability that has been categorized as Critical by NVD has been reported as failed.",
        "risk_score": 90,
        "severity": "high",
        "note": "Investigators should get systems with critical vulnerabilities patched and ensure mitigations are in place while the system is vulenrable.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "2e9c9ac0-1138-11ee-af86-538da1394f27",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0001",
                    "reference": "https://attack.mitre.org/tactics/TA0001",
                    "name": "Initial Access"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "data_view_id": "5be62502-2bab-4d66-97ff-d9373963c50d",
        "query": "vulnerability.severity :\"CRITICAL\" and vulnerability.result : \"fail\" ",
        "filters": [],
        "throttle": "no_actions",
        "actions": []
    }
}