{
    "id": "55faa99b-ce17-4a41-9f63-4a7439e3543a",
    "type": "security-rule",
    "attributes": {
        "name": "New Device Discovered",
        "tags": [
            "TYCHON",
            "ARP"
        ],
        "interval": "8h",
        "enabled": true,
        "revision": 0,
        "description": "TYCHON pulls the ARP tables from endpoints, when new devices are found they should be investigated and validated.",
        "risk_score": 21,
        "severity": "low",
        "note": "New devices come online and offline constantly, the MAC address should be investigated and resolved.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-32400s",
        "rule_id": "55faa99b-ce17-4a41-9f63-4a7439e3543a",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0007",
                    "name": "Discovery",
                    "reference": "https://attack.mitre.org/tactics/TA0007"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "new_terms",
        "query": "not tychon.destination.mac : \"ff-ff-ff-ff-ff-ff\" ",
        "new_terms_fields": [
            "tychon.destination.mac"
        ],
        "history_window_start": "now-7d",
        "index": [
            "logs-tychon_latest.arp"
        ],
        "filters": [],
        "language": "kuery",
        "actions": []
    }
}
