{
    "id": "5be38411-3902-4686-8209-1ab75a6d3847",
    "type": "security-rule",
    "attributes": {
        "name": "Large number of failed Vulnerabilities ",
        "tags": [
            "CVE",
            "TYCHON"
        ],
        "interval": "1h",
        "enabled": true,
        "revision": 0,
        "description": "This endpoint has been determined to have a high number of total vulnerabilities failed, this can indicate an extremely exposed endpoint.",
        "risk_score": 73,
        "severity": "high",
        "note": "Due to the high number of failed CVE checks, it is recommended that the security administrator quarantine this system immediately and bring the machine up to date with all patches. ",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-3900s",
        "rule_id": "5be38411-3902-4686-8209-1ab75a6d3847",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0001",
                    "name": "Initial Access",
                    "reference": "https://attack.mitre.org/tactics/TA0001"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "threshold",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.cve"
        ],
        "query": "tychon.vulnerability.result : \"fail\" ",
        "filters": [],
        "threshold": {
            "field": [
                "tychon.tychon.id"
            ],
            "value": 30,
            "cardinality": []
        },
        "actions": []
    }
}
