{
    "id": "6040cb5c-5e01-4f4d-af7f-9ca9c11dbdc7",
    "type": "security-rule",
    "attributes": {
        "name": "TYCHON Benchmark SCAP Definition File Out of Date",
        "tags": [
            "TYCHON",
            "SCAP"
        ],
        "interval": "24h",
        "enabled": true,
        "description": "TYCHON updates its SCAP definitions daily and should be no more than 120 days old to ensure you are working from the most up-to-date requirements and settings. ",
        "risk_score": 47,
        "severity": "medium",
        "note": "TYCHON Definitions are updated daily, check the local host logs and see if there are issues with TYCHON definitions updating.  You can obtain the latest version from the TYCHON support site.\n\nhttps://support.tychon.io",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-86460s",
        "rule_id": "6040cb5c-5e01-4f4d-af7f-9ca9c11dbdc7",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [],
        "to": "now",
        "references": [
            "https://support.tychon.io"
        ],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "data_view_id": "a61d021d-d78f-485d-93b2-8075149794af",
        "query": "tychon.definition.stig  \u003c \"now-120d\"",
        "filters": [],
        "throttle": "no_actions",
        "actions": []
    }
}