{
    "id": "6839b82b-22bf-418f-a86b-7e7a4cd074d7",
    "type": "security-rule",
    "attributes": {
        "name": "Endpoint Security Definitions are Out of Date",
        "tags": [
            "EPP",
            "TYCHON"
        ],
        "interval": "5m",
        "enabled": true,
        "revision": 0,
        "description": "TYCHON has reported that the registered endpoint protection platform is out of date and needs to be updated.",
        "risk_score": 73,
        "severity": "high",
        "note": "Depending on the Endpoint Protection Vendor, you will need to push new updated to this endpoint.  See the vendor's user guides to determine how to install the most recent AV updates.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "6839b82b-22bf-418f-a86b-7e7a4cd074d7",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.host"
        ],
        "query": "tychon.host.security.antivirus.status : *OutOfDate*",
        "filters": [],
        "actions": []
    }
}
