{
    "id": "6d34f6dc-4a36-46cd-a4bb-ea2f1a01ab8a",
    "type": "security-rule",
    "attributes": {
        "name": "TPM Compliance Failed",
        "tags": [
            "TYCHON",
            "STIG"
        ],
        "interval": "5m",
        "enabled": true,
        "description": "This host has been determined by TYCHON to be non-compliant with the Trusted Platform Module (TPM), this is due to it being not present or at the wrong version.",
        "risk_score": 47,
        "severity": "medium",
        "note": "Enable TPM 2.0 on this machine, if it is unable to be enabled because the host does not support it, determine the risk and take appropriate measures.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "6d34f6dc-4a36-46cd-a4bb-ea2f1a01ab8a",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0006",
                    "reference": "https://attack.mitre.org/tactics/TA0006",
                    "name": "Credential Access"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [
            "https://support.microsoft.com/en-us/windows/enable-tpm-2-0-on-your-pc-1fd5a332-360d-4f46-a1e7-ae6b0c90645c"
        ],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "data_view_id": "a61d021d-d78f-485d-93b2-8075149794af",
        "query": "host.tpm.compliant : false ",
        "filters": [],
        "throttle": "no_actions",
        "actions": []
    }
}