{
    "id": "867e3450-1139-11ee-af86-538da1394f27",
    "type": "security-rule",
    "attributes": {
        "name": "High STIG/SCAP Check Failed",
        "tags": [
            "TYCHON",
            "CCRI",
            "SCAP"
        ],
        "interval": "5m",
        "enabled": true,
        "description": "A High Severity STIG/SCAP Check failed on an endpoint.",
        "risk_score": 60,
        "severity": "medium",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "867e3450-1139-11ee-af86-538da1394f27",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0001",
                    "reference": "https://attack.mitre.org/tactics/TA0001",
                    "name": "Initial Access"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "data_view_id": "7d972a32-d117-4963-a7bf-58fc65fb1ee8",
        "query": "rule.result : \"fail\" and rule.severity : \"high\" ",
        "filters": [],
        "throttle": "no_actions",
        "actions": []
    }
}