{
    "id": "934a39a0-1138-11ee-af86-538da1394f27",
    "type": "security-rule",
    "attributes": {
        "name": "High Vulnerability Failed",
        "tags": [
            "TYCHON",
            "CVE",
            "CCRI"
        ],
        "interval": "5m",
        "enabled": true,
        "revision": 0,
        "description": "A host with a high-severity CVE was flagged as being vulnerable.",
        "risk_score": 60,
        "severity": "medium",
        "note": "Investigator should work to resolve this patch and keep a close monitor on this endpoint.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "934a39a0-1138-11ee-af86-538da1394f27",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0001",
                    "name": "Initial Access",
                    "reference": "https://attack.mitre.org/tactics/TA0001"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.cve"
        ],
        "query": "tychon.vulnerability.severity :\"HIGH\" and tychon.vulnerability.result : \"fail\" ",
        "filters": [],
        "actions": []
    }
}
