{
	"id": "b85c2ad0-427c-11ee-83e4-c92ed141b9e5_1",
	"name": "High number of SCAP Failures",
	"tags": [
		"TYCHON",
		"CCRI"
	],
	"interval": "1h",
	"enabled": true,
	"description": "TYCHON has reported a high number of SCAP failures for an endpoint.  This can indicate a very weak security posture for an endpoint.",
	"risk_score": 47,
	"severity": "medium",
	"note": "The system may need to be isolated.  Investigate the SCAP results for this system and perform fixes for all High and Medium checks.  ",
	"license": "",
	"output_index": "",
	"author": [
		"TYCHON"
	],
	"false_positives": [],
	"from": "now-3660s",
	"rule_id": "2140f083-6e39-4df4-ba41-aa1f41cb81b8",
	"max_signals": 100,
	"risk_score_mapping": [],
	"severity_mapping": [],
	"threat": [
		{
			"framework": "MITRE ATT&CK",
			"tactic": {
				"id": "TA0007",
				"reference": "https://attack.mitre.org/tactics/TA0007",
				"name": "Discovery"
			},
			"technique": []
		}
	],
	"to": "now",
	"references": [],
	"version": 1,
	"exceptions_list": [],
	"related_integrations": [],
	"required_fields": [],
	"setup": "",
	"type": "threshold",
	"language": "kuery",
	"data_view_id": "ed7c1bb4-5aac-45d4-9aff-06f4d4ad4a9a",
	"query": "rule.result : \"fail\" and not rule.severity : \"low\" ",
	"filters": [],
	"threshold": {
		"field": [
			"tychon.id"
		],
		"value": 20,
		"cardinality": []
	},
	"throttle": "no_actions",
	"actions": []
}