{
    "id": "bdf083c5-63cb-41ae-bb7a-563cc4e8719f",
    "type": "security-rule",
    "attributes": {
        "name": "Weak WIFI Authentication in use",
        "tags": [
            "TYCHON",
            "WIFI"
        ],
        "interval": "5m",
        "enabled": true,
        "revision": 0,
        "description": "An endpoint has reported it is connected to a WIFI SSID using a weak Authentication method.",
        "risk_score": 21,
        "severity": "low",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "bdf083c5-63cb-41ae-bb7a-563cc4e8719f",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0005",
                    "name": "Defense Evasion",
                    "reference": "https://attack.mitre.org/tactics/TA0005"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [
            "https://www.techtarget.com/searchnetworking/feature/Wireless-encryption-basics-Understanding-WEP-WPA-and-WPA2"
        ],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.networkadapter"
        ],
        "query": "tychon.host.adapter.wifi.authentication : \"WEP\" or tychon.host.adapter.wifi.authentication : \"WPA\" or tychon.host.adapter.wifi.authentication : \"WPA-Personal\" or tychon.host.adapter.wifi.authentication : \"WPA-Enterprise\"",
        "filters": [],
        "actions": []
    }
}
