{
    "id": "beeea32f-31ba-4be8-9e2c-14de47280aac",
    "type": "security-rule",
    "attributes": {
        "name": "Past Due Vulnerability Failed",
        "tags": [
            "TYCHON",
            "CVE",
            "CCRI"
        ],
        "interval": "5m",
        "enabled": true,
        "revision": 0,
        "description": "TYCHON tracks when vulnerabilities are past expiration to ensure systems are patched before exploits are released or to reduce the attack surface of the endpoint.  Due dates are generated from 3 rules:\n1. CISA - Exact CISA Due Date\n2. IAVA - 18 Days from when TYCHON records an IAVA is released\n3. NVD - If a Vulnerability is marked as critical, the due date is generated as 30 days after its release.",
        "risk_score": 99,
        "severity": "critical",
        "note": "Analysts should quarantine hosts that have out-of-date vulnerabilities, these are normally weaknesses that have active exploits in the wild. ",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "beeea32f-31ba-4be8-9e2c-14de47280aac",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT&CK",
                "tactic": {
                    "id": "TA0001",
                    "name": "Initial Access",
                    "reference": "https://attack.mitre.org/tactics/TA0001"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [
            "https://www.cisa.gov/known-exploited-vulnerabilities-catalog"
        ],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.cve"
        ],
        "query": "tychon.vulnerability.result : \"fail\" and tychon.vulnerability.due_date < now",
        "filters": [],
        "actions": []
    }
}
