{
    "id": "c40eaba1-7507-4fe7-aae5-78e59cd7b8f2",
    "type": "security-rule",
    "attributes": {
        "name": "TYCHON Vulnerability Definitions Out of Date",
        "tags": [
            "TYCHON",
            "CVE"
        ],
        "interval": "5m",
        "enabled": true,
        "revision": 0,
        "description": "TYCHON updates its definitions daily for vulnerability checks, if systems are too far out of date you are not getting the results for the most recent vulnerabilities further affecting your attack surface.",
        "risk_score": 73,
        "severity": "high",
        "note": "Review the endpoint event logs and determine why TYCHON definitions are not being updated and pushed.  Ensure you have downloaded the latest definition installers from the TYCHON support site.\n\nhttps://support.tychon.io",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "c40eaba1-7507-4fe7-aae5-78e59cd7b8f2",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [],
        "to": "now",
        "references": [
            "https://support.tychon.io"
        ],
        "version": 1,
        "exceptions_list": [],
        "immutable": true,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
            "logs-tychon_latest.host"
        ],
        "query": "tychon.definition.oval < \"now-30d\"",
        "filters": [],
        "actions": []
    }
}
