{
    "id": "ccffb8f0-601f-46f6-8ae9-ab8af5e6bbf4",
    "type": "security-rule",
    "attributes": {
        "name": "New Command Generated a Listening port",
        "tags": [
            "TYCHON",
            "Exposed Services"
        ],
        "interval": "1h",
        "enabled": false,
        "description": "TYCHON is monitoring endpoints for ports that have been opened at the endpoint, if a new command line was used to start a process that hasn't been seen before this can be cause for concern.",
        "risk_score": 47,
        "severity": "medium",
        "note": "Investigate the endpoint process that was used to open this port",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-3660s",
        "rule_id": "ccffb8f0-601f-46f6-8ae9-ab8af5e6bbf4",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0011",
                    "reference": "https://attack.mitre.org/tactics/TA0011",
                    "name": "Command and Control"
                },
                "technique": [
                    {
                        "id": "T1065",
                        "reference": "https://attack.mitre.org/techniques/T1065",
                        "name": "Uncommonly Used Port",
                        "subtechnique": []
                    }
                ]
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "new_terms",
        "query": "process.command_line : *",
        "new_terms_fields": [
            "source.port",
            "process.command_line"
        ],
        "history_window_start": "now-7d",
        "filters": [],
        "language": "kuery",
        "data_view_id": "b006641c-69de-48bd-9a5a-1125f0da1c0b",
        "throttle": "no_actions",
        "actions": []
    }
}