{
    "id": "d0d735ed-08fe-4393-9aa6-120236995152",
    "type": "security-rule",
    "attributes": {
        "name": "System Volume Mounted to Drive",
        "tags": [
            "TYCHON",
            "Volume"
        ],
        "interval": "5m",
        "enabled": true,
        "description": "TYCHON has reported that the system volume has been mounted to a drive letter.",
        "risk_score": 47,
        "severity": "medium",
        "note": "Investigate and determine how the drive was mounted and remove the mount if it was done maliciously.",
        "license": "",
        "output_index": "",
        "author": [
            "TYCHON"
        ],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "d0d735ed-08fe-4393-9aa6-120236995152",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [
            {
                "framework": "MITRE ATT\u0026CK",
                "tactic": {
                    "id": "TA0004",
                    "reference": "https://attack.mitre.org/tactics/TA0004",
                    "name": "Privilege Escalation"
                },
                "technique": []
            }
        ],
        "to": "now",
        "references": [],
        "version": 1,
        "exceptions_list": [],
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "data_view_id": "02acfb43-5302-4331-bb10-4174171f6091",
        "query": "volume.system_volume : true and not volume.drive.letter : \"\"",
        "filters": [],
        "throttle": "no_actions",
        "actions": []
    }
}