{
	"id": "edcdabf0-4275-11ee-83e4-c92ed141b9e5_1",
	"name": "System Volume Mounted to Drive",
	"tags": [
		"TYCHON",
		"Volume"
	],
	"interval": "5m",
	"enabled": true,
	"description": "TYCHON has reported that the system volume has been mounted to a drive letter.",
	"risk_score": 47,
	"severity": "medium",
	"note": "Investigate and determine how the drive was mounted and remove the mount if it was done maliciously.",
	"license": "",
	"output_index": "",
	"author": [
		"TYCHON"
	],
	"false_positives": [],
	"from": "now-360s",
	"rule_id": "d0d735ed-08fe-4393-9aa6-120236995152",
	"max_signals": 100,
	"risk_score_mapping": [],
	"severity_mapping": [],
	"threat": [
		{
			"framework": "MITRE ATT&CK",
			"tactic": {
				"id": "TA0004",
				"reference": "https://attack.mitre.org/tactics/TA0004",
				"name": "Privilege Escalation"
			},
			"technique": []
		}
	],
	"to": "now",
	"references": [],
	"version": 1,
	"exceptions_list": [],
	"related_integrations": [],
	"required_fields": [],
	"setup": "",
	"type": "query",
	"language": "kuery",
	"data_view_id": "62456a9a-bd4c-4b57-b6b5-5556b6869ce5",
	"query": "volume.system_volume : true and not volume.drive.letter : \"\"",
	"filters": [],
	"throttle": "no_actions",
	"actions": []
}