{
    "attributes": {
        "columns": [
            "gen_ai.request.model.id",
            "gen_ai.request.model.version",
            "gen_ai.usage.prompt_tokens",
            "gen_ai.performance.request_size",
            "gen_ai.usage.completion_tokens",
            "gen_ai.performance.response_size",
            "aws_bedrock.invocation.error_code",
            "gen_ai.request.model.role"
        ],
        "description": "",
        "grid": {},
        "hideChart": false,
        "isTextBasedQuery": true,
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [],
                "index": {
                    "allowHidden": false,
                    "allowNoIndex": false,
                    "fieldFormats": {},
                    "id": "d6c911aa50e2dafcebcedfa50190d5c03bbac0070c96d6b16feb18aa1f84b5da",
                    "name": "logs-*",
                    "runtimeFieldMap": {},
                    "sourceFilters": [],
                    "timeFieldName": "@timestamp",
                    "title": "logs-*",
                    "type": "esql"
                },
                "query": {
                    "esql": "from logs-* \n| where event.dataset == \"aws_bedrock.invocation\"\n\n\n"
                }
            }
        },
        "sort": [
            [
                "@timestamp",
                "desc"
            ]
        ],
        "timeRestore": false,
        "title": "[AWS Bedrock] Invocation Logs",
        "usesAdHocDataView": true
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2024-07-09T14:18:23.949Z",
    "id": "aws_bedrock-102e7881-0c3f-4996-91e6-453f682df2f2",
    "managed": false,
    "references": [],
    "type": "search",
    "typeMigrationVersion": "10.2.0"
}