- name: '@timestamp'
  type: date
  description: Event timestamp.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: event.dataset
  type: constant_keyword
  description: Event dataset.
  value: fortinet_fortiauthenticator.log
- name: event.module
  type: constant_keyword
  description: Event module.
  value: fortinet_fortiauthenticator
- name: event.action
  type: keyword
  description: The event action as described in FortiAuthenticator documentation. (e.g "FortiAuthenticator-admin-gui-login")
- name: log.source.address
  type: keyword
  description: Source address from which the log event was received.