{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "A supervised machine learning model (ProblemChild) or its blocklist has identified\na suspicious Windows process event to be malicious activity.\n",
        "from": "now-9m",
        "index": [
            "endgame-*",
            "logs-endpoint.events.process.*",
            "winlogbeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License",
        "max_signals": 10000,
        "name": "Machine Learning Detected a Suspicious Windows Event Predicted to be Malicious Activity",
        "query": "problemchild.prediction:1 or blocklist_label:1",
        "risk_score": 21,
        "rule_id": "34184d4e-ef61-477b-8d76-5c93448c29bf",
        "severity": "low",
        "tags": [
            "Elastic",
            "Host",
            "Internal",
            "LotL",
            "ML"
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 2
    },
    "id": "34184d4e-ef61-477b-8d76-5c93448c29bf",
    "type": "security-rule"
}