{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "A supervised machine learning model (ProblemChild) has identified a suspicious Windows\nprocess event with high probability of it being malicious activity.\nAlternatively, the model's blocklist identified the event as being malicious.\n",
        "from": "now-9m",
        "index": [
            "endgame-*",
            "logs-endpoint.events.process.*",
            "winlogbeat-*"
        ],
        "language": "kuery",
        "license": "Elastic License",
        "max_signals": 10000,
        "name": "Machine Learning Detected a Suspicious Windows Event with a High Malicious Probability Score",
        "query": "(problemchild.prediction:1 and problemchild.prediction_probability \u003e 0.98) or blocklist_label:1",
        "risk_score": 21,
        "rule_id": "9a2e372a-cbeb-4ad6-a288-017ef086324c",
        "severity": "low",
        "tags": [
            "Elastic",
            "ML-ProblemChild"
        ],
        "timestamp_override": "event.ingested",
        "type": "query",
        "version": 2
    },
    "id": "9a2e372a-cbeb-4ad6-a288-017ef086324c",
    "type": "security-rule"
}