- external: ecs
  name: tags
- external: ecs
  name: ecs.version
- external: ecs
  name: error.message
- external: ecs
  name: event.duration
- external: ecs
  name: destination.address
- external: ecs
  name: destination.domain
- external: ecs
  name: http.request.method
- external: ecs
  name: http.request.bytes
- external: ecs
  name: http.request.id
- external: ecs
  name: http.request.referrer
- external: ecs
  name: http.response.body.bytes
- external: ecs
  name: http.response.bytes
- external: ecs
  name: http.response.status_code
- external: ecs
  name: http.version
- external: ecs
  name: log.file.path
- external: ecs
  name: network.forwarded_ip
- external: ecs
  name: network.protocol
- external: ecs
  name: network.type
- external: ecs
  name: related.ip
- external: ecs
  name: related.hosts
- external: ecs
  name: source.address
- external: ecs
  name: source.ip
- external: ecs
  name: source.port
- external: ecs
  name: source.as.number
- external: ecs
  name: source.as.organization.name
- external: ecs
  name: source.geo.city_name
- external: ecs
  name: source.geo.continent_name
- external: ecs
  name: source.geo.country_iso_code
- external: ecs
  name: source.geo.country_name
- description: Longitude and latitude.
  level: core
  name: source.geo.location
  type: geo_point
- external: ecs
  name: source.geo.region_iso_code
- external: ecs
  name: source.geo.region_name
- external: ecs
  name: tls.cipher
- external: ecs
  name: tls.version
- external: ecs
  name: tls.version_protocol
- external: ecs
  name: url.domain
- external: ecs
  name: url.extension
- external: ecs
  name: url.original
- external: ecs
  name: url.path
- external: ecs
  name: url.query
- external: ecs
  name: url.scheme
- external: ecs
  name: url.full
- external: ecs
  name: url.registered_domain
- external: ecs
  name: url.subdomain
- external: ecs
  name: url.top_level_domain
- external: ecs
  name: user_agent.device.name
- external: ecs
  name: user_agent.name
- external: ecs
  name: user_agent.original
- external: ecs
  name: user_agent.os.full
- external: ecs
  name: user_agent.os.name
- external: ecs
  name: user_agent.os.version
- external: ecs
  name: user_agent.version
- external: ecs
  name: host.architecture
- external: ecs
  name: host.domain
- external: ecs
  name: host.hostname
- external: ecs
  name: host.id
- external: ecs
  name: host.ip
- external: ecs
  name: host.mac
- external: ecs
  name: host.name
- external: ecs
  name: host.os.family
- external: ecs
  name: host.os.kernel
- external: ecs
  name: host.os.name
- external: ecs
  name: host.os.platform
- external: ecs
  name: host.os.version
- external: ecs
  name: host.type
- external: ecs
  name: cloud.account.id
- external: ecs
  name: cloud.availability_zone
- external: ecs
  name: cloud.instance.id
- external: ecs
  name: cloud.instance.name
- external: ecs
  name: cloud.machine.type
- external: ecs
  name: cloud.provider
- external: ecs
  name: cloud.region
- external: ecs
  name: cloud.project.id
- external: ecs
  name: container.id
- external: ecs
  name: container.image.name
- external: ecs
  name: container.labels
- external: ecs
  name: container.name
- external: ecs
  name: event.dataset
  type: constant_keyword
- external: ecs
  name: http.response.mime_type
  type: keyword
