- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: tags
- external: ecs
  name: event.url
- external: ecs
  name: event.created
- external: ecs
  name: event.original
- external: ecs
  name: event.start
- external: ecs
  name: event.end
- external: ecs
  name: event.provider
- external: ecs
  name: event.category
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.marking.tlp
- name: threat.indicator.name
  level: extended
  type: keyword
  description: The display name indicator in an UI friendly format
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.as.number
- external: ecs
  name: vulnerability.id
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: email.subject
- external: ecs
  name: threat.indicator.file.path
- external: ecs
  name: threat.indicator.file.size
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha384
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.file.hash.ssdeep
- external: ecs
  name: host.hostname
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.software.name
- external: ecs
  name: threat.software.type
- external: ecs
  name: organization.name
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: process.command_line
- external: ecs
  name: process.name
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: user_agent.original
- external: ecs
  name: threat.indicator.registry.value
- external: ecs
  name: rule.name
- external: ecs
  name: threat.indicator.x509.serial_number
- external: ecs
  name: server.mac
- external: ecs
  name: related.hash
- external: ecs
  name: related.hosts
- external: ecs
  name: related.ip
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_eclecticiq
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_eclecticiq.threat
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: EclecticIQ