{
  "attributes": {
    "raw": {
      "document": "---\ntitle: \"Detect Credential Access with Elastic Security\"\nslug: \"detect-credential-access\"\ndate: \"2023-03-01\"\ndescription: \"Elastic Endpoint Security provides events that enable defenders with visibility on techniques and procedures which are commonly leveraged to access sensitive files and registry objects.\"\nauthor:\n  - slug: samir-bousseaden\nimage: \"blog-thumb-blind-spots.png\"\ncategory:\n  - slug: security-operations\n  - slug: detection-science\n---\n\n## Preamble\n\n[Credential Access](https://attack.mitre.org/tactics/TA0006/) consists of techniques for stealing credentials like cookies, API keys, and passwords. It is one of the top critical tactics that is almost guaranteed to occur during an attack lifecycle, ranging from phishing to infostealer malware to more complicated post-exploitation techniques. Therefore, covering it from different angles increases opportunities for early detection and prevention. [Elastic Endpoint Security](https://www.elastic.co/endpoint-security/) 7.15 added new [file](https://www.elastic.co/guide/en/ecs/current/ecs-file.html#field-file-path)and [registry](https://www.elastic.co/guide/en/ecs/current/ecs-allowed-values-event-category.html#ecs-event-category-registry) events to provide defenders with better visibility on techniques and procedures involving some form of sensitive files and/or registry objects access:\n\n- [T1555.003 Credentials from Web Browsers](https://attack.mitre.org/techniques/T1555/003/)\n- [T1003.002 Security Account Manager](https://attack.mitre.org/techniques/T1003/002/)\n- [T1003.004 LSA Secrets](https://attack.mitre.org/techniques/T1003/004/)\n- [T1003.005 Cached Domain Credentials](https://attack.mitre.org/techniques/T1003/005/)\n- [T1552.001 Credential in Files](https://attack.mitre.org/techniques/T1552/001/)\n- [T1555.004 Windows Credential Manager](https://attack.mitre.org/techniques/T1555/004/)\n\n## Hunting for Credential Access\n\nWith the [Endpoint security integration](https://www.elastic.co/guide/en/security/current/install-endpoint.html) enabled, you can explore those new events using generic [KQL](https://www.elastic.co/guide/en/kibana/current/kuery-query.html) or [EQL](https://www.elastic.co/guide/en/elasticsearch/reference/current/eql.html) queries:\n\n**KQL and EQL queries to view file and registry events.**\n\n```\n// EQL via Security -> Timelines -> New -> Correlation\nany where event.category in (\"file\", \"registry\")\n  and event.action in (\"query\", \"open\")\n\n// KQL via Discover\nevent.category : (\"file\" or \"registry\")\n  and event.action : (\"open\" or \"query\")\n\n```\n\nBelow, you can see an example of file events logged as a result of running two known security assessment tools: [Lazagne](https://github.com/AlessandroZ/LaZagne) and [Seatbelt](https://github.com/GhostPack/Seatbelt). These tools include checks for a multitude of credentials and interesting files used in common software:\n\n![KQL query identifying Lazagne and Seatbelt](/assets/images/detect-credential-access/kql-identifying.jpg)\n\nHere are some example registry events logged as a result of running [Mimikatz](https://github.com/gentilkiwi/mimikatz) (lsadump::sam, cache, lsa, and secrets submodules) and Seatbelt (PuttyHostKeys SSH enumeration):\n\n![KQL query identifying Mimikatz and Seatbelt](/assets/images/detect-credential-access/kql-mimikatz.jpg)\n\nLeveraging EQL’s [correlation](https://www.elastic.co/guide/en/elasticsearch/reference/current/eql-syntax.html#eql-sequences) capabilities to link those new events with other event categories (such as [process](https://www.elastic.co/guide/en/ecs/current/ecs-allowed-values-event-category.html#ecs-event-category-process), registry, [network](https://www.elastic.co/guide/en/ecs/current/ecs-allowed-values-event-category.html#ecs-event-category-network), and/or\n\n[authentication](https://www.elastic.co/guide/en/ecs/current/ecs-allowed-values-event-category.html#ecs-event-category-authentication)) is a great enabler for detection and hunting.\n\n> The&nbsp;[process.entity_id](https://www.elastic.co/guide/en/ecs/current/ecs-process.html#field-process-entity-id) field is a globally unique identifier used to mitigate PID reuse as well as to identify a specific process over time.\n\nThis EQL query uses the process.entity_id field to detect a process accessing multiple sensitive files in a short period of time, which is usually a higher-confidence signal than looking for single file access:\n\n**Process accessing multiple sensitive files in a short period of time**\n\n```\nsequence by process.entity_id with maxspan=1m\n [process where event.action == \"start\"]\n\n // at least 3 unique file.paths, runs=* is supported in EQL 7.16+\n [file where event.action == \"open\"] with runs=3\n\n```\n\nHere is an example of a match for 3 different and unrelated types of credentials (email, DPAPI system MasterKey and Sysprep unattended):\n\n![EQL query showing email, DPAPI, and Sysprep credentials](/assets/images/detect-credential-access/kql-email.jpg)\n\nNow let’s hunt for [remote access to sensitive files over SMB](https://attack.mitre.org/techniques/T1021/002/), such as the following:\n\n![Moving sensitive file with SMB](/assets/images/detect-credential-access/moving-sensitive-files.jpg)\n\nWe can detect this behavior with EQL that correlates a remote logon event ([4624](https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624)) with sensitive file access by the same\n\n[user.id](https://www.elastic.co/guide/en/ecs/current/ecs-user.html#field-user-id):\n\n**Correlating remote logon with sensitive file access**\n\n```\nsequence by host.id with maxspan=5m\n\n  [authentication where event.action == \"logged-in\" and\n    /* event 4624 need to be logged */\n    winlog.logon.type : \"Network\" and\n    event.outcome == \"success\" and source.ip != null and\n    source.ip != \"127.0.0.1\" and\n    source.ip != \"::1\"] by winlog.event_data.TargetUserSid\n\n   /* requires Elastic Endpoint Security Integration 7.15+ */\n  [file where event.action == \"open\" and process.pid == 4] by user.id\n\n```\n\nThe above query results correlate relevant fields like the [source.ip](https://www.elastic.co/guide/en/ecs/current/ecs-source.html#field-source-ip), user.id, and [file.path](https://www.elastic.co/guide/en/ecs/current/ecs-file.html#field-file-path):\n\n![EQL query correlating relevant fields](/assets/images/detect-credential-access/eql-correlation.jpg)\n\n## Behavior Protection\n\nIn addition to being able to use those events in [detection rules](https://github.com/elastic/detection-rules), Elastic Endpoint Security includes built-in malicious behavior protection rules that can automatically react to high-confidence, highly-suspicious sensitive file/registry accesses.\n\nFor example, here we can see Elastic Endpoint’s behavior protection rules catching:\n\n- [LSASecretsdumper](https://github.com/gtworek/PSBits/tree/master/LSASecretDumper) - LSA secrets stealing with LsaOpenSecret and LsaQuerySecret APIs.\n- [Mimikatz (lsadump:sam and secrets modules)](https://www.ired.team/offensive-security/credential-access-and-credential-dumping/dumping-lsa-secrets) - modules to dump creds from the SAM and LSA registry keys.\n- Lazagne (DPAPI MasterKeys access) - stealing MasterKey to decrypt DPAPI protected resources.\n\n![Elastic Endpoint Security preventing credential theft attempts](/assets/images/detect-credential-access/EES.jpg)\n\nHere are detections of Chrome Login Data file access by different infostealers ([Poulight Stealer](https://malpedia.caad.fkie.fraunhofer.de/details/win.poulight_stealer), [AgentTesla](https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla)) including [lolbins](https://lolbas-project.github.io/) (powershell script):\n\n![Elastic Endpoint Security preventing information stealing](/assets/images/detect-credential-access/EES-preventing.jpg)\n\nBelow are some example detections for Windows Credential Manager Store access by common stealers AgentTesla and [FormBook](https://malpedia.caad.fkie.fraunhofer.de/details/win.formbook):\n\n![Elastic Endpoint Security preventing Windows Credential Manager Store theft](/assets/images/detect-credential-access/EES-windows-credential.jpg)\n\n## Monitored File and Registry Paths\n\nThe current list of monitored file and registry paths is listed below. Due to data volume and performance concerns, the Elastic Endpoint generates only one event per process.entity_id for a given file or registry pattern in the list. From a detection point of view this won’t create any visibility gap since we emit an event on the first file or registry access performed by any process.\n\n**Monitored registry paths**\n\n```\nregistry_paths:\n  # SAM - Encrypted Local Account Pwd hashes\n  - '\\REGISTRY\\MACHINE\\SAM'\n  - '\\REGISTRY\\MACHINE\\SAM\\SAM\\Domains\\*'\n\n  # SYSTEM - Bootkey/Syskey GBG, JD, Skew1\n  - '\\REGISTRY\\MACHINE\\SYSTEM\\ControlSet00?\\Control\\Lsa\\JD'\n  - '\\REGISTRY\\MACHINE\\SYSTEM\\ControlSet00?\\Control\\Lsa\\Skew1'\n  - '\\REGISTRY\\MACHINE\\SYSTEM\\ControlSet00?\\Control\\Lsa\\GBG'\n  # SECURITY - LSA key, encrypted domain cached pwd and machine account pwd\n  - '\\REGISTRY\\MACHINE\\SECURITY\\CACHE*'\n  - '\\REGISTRY\\MACHINE\\SECURITY\\POLICY\\SECRETS\\*'\n\n  # Registry - Putty SSH Keys\n  - '\\Registry\\Machine\\Software\\SimonTatham\\PuTTY\\SshHostKeys\\*'\n  - '\\Registry\\User\\*\\Software\\SimonTatham\\PuTTY\\SshHostKeys\\*'\n\n  # Sysadmin - WinSCP\n  - '\\REGISTRY\\User\\*\\software\\Martin Prikryl\\WinSCP 2\\Sessions\\*\\Password*'\n\n  # Sysadmin - TeamViewer\n  - '\\REGISTRY\\Machine\\SOFTWARE\\WOW6432Node\\TeamViewer\\PrxyPassword*'\n\n  # Sysadmin - OpenVPN\n  - '\\REGISTRY\\User\\*\\Software\\OpenVPN-GUI\\Configs\\auth-data*'\n\n  # Outlook Passwords\n  - '\\Registry\\User\\*\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows Messaging Subsystem\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\*Password'\n  - '\\Registry\\Users\\*\\Software\\Microsoft\\Office\\*.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676'\n\n```\n\n**Monitored registry paths**\n\n```\nfile_paths:\n  # DPAPI - User MasterKey\n  # DPAPI - CREDHIST\n  - 'C:\\Users\\*\\AppData\\Roaming\\Microsoft\\Protect\\*'\n\n  # DPAPI - System MasterKey\n  - '?:\\Windows\\System32\\Microsoft\\Protect\\S-1-5-18\\User\\*'\n\n  # CredVault - User\n  - '?:\\Users\\*\\AppData\\Roaming\\Microsoft\\Vault\\*'\n  - '?:\\Users\\*\\AppData\\Local\\Microsoft\\Vault\\*'\n\n  # CredVault - System\n  - '?:\\Windows\\System32\\config\\systemprofile\\AppData\\Local\\Microsoft\\Vault\\*'\n\n  # CredMan - Users\n  - '?:\\Users\\*\\AppData\\Roaming\\Microsoft\\Credentials\\*'\n  - '?:\\Users\\*\\AppData\\Local\\Microsoft\\Credentials\\*'\n\n  # CredMan - System\n  - '?:\\Windows\\System32\\config\\systemprofile\\AppData\\Local\\Microsoft\\Credentials\\*'\n  - '?:\\Windows\\System32\\config\\systemprofile\\AppData\\Roaming\\Microsoft\\Credentials\\*'\n\n  # CredMan - Service\n  - '?:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\Microsoft\\Credentials\\*'\n  - '?:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Roaming\\Microsoft\\Credentials\\*'\n  - '?:\\Windows\\ServiceProfiles\\NetworkService\\AppData\\Local\\Microsoft\\Credentials\\*'\n  - '?:\\Windows\\ServiceProfiles\\NetworkService\\AppData\\Roaming\\Microsoft\\Credentials\\*'\n\n  # Unattended creds\n  - '?:\\Windows\\Panther\\Unattend.xml'\n  - '?:\\Windows\\Panther\\Unattended.xml'\n  - '?:\\Windows\\Panther\\Unattend\\Unattended.xml'\n  - '?:\\Windows\\Panther\\Unattend\\Unattend.xml'\n  - '?:\\Windows\\System32\\Sysprep\\unattend.xml'\n  - '?:\\Windows\\System32\\Sysprep\\Panther\\unattend.xml'\n\n  # Browser\n  - '*\\Users\\*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\\key*.db'\n  - '*\\Users\\*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\\logins.json'\n  - '*\\Users\\*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\\cert*.db'\n  - '*\\Users\\*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\\cookies.sqlite'\n  - '*\\Users\\*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles\\*.default*\\signons.sqlite'\n  - '*\\Users\\*\\User Data\\Default\\Login Data'\n  - '*\\users\\*\\AppData\\Local\\*\\User Data\\Default\\Cookies'\n  - '*\\Users\\*\\AppData\\Roaming\\Opera Software\\Opera Stable\\*'\n\n  # RDP\n  - '*\\Users\\*\\AppData\\Local\\Microsoft Corporation\\Remote Desktop Connection Manager\\RDCMan.settings'\n  - '*\\Users\\*\\AppData\\Local\\Microsoft\\Remote Desktop Connection Manager\\RDCMan.settings'\n\n  # Database - SVN\n  - '?:\\Users\\*\\AppData\\Roaming\\Subversion\\auth\\svn.simple'\n\n  # Database - postgresql\n  - '?:\\Users\\*\\AppData\\Roaming\\postgresql\\pgpass.conf'\n\n  # Database - robomongo\n  - '?:\\Users\\*\\.3T\\robo-3t\\*\\robo3t.json'\n  - '?:\\users\\*\\.3T\\robomongo\\*\\robomongo.json'\n  - '?:\\users\\*\\.config\\robomongo\\*\\robomongo.json'\n\n  # Database - squirrel\n  - '?:\\Users\\*\\.squirrel-sql\\SQLAliases23.xml'\n\n  # Database - DbVisualizer\n  - '?:\\Users\\*\\.dbvis\\config70\\dbvis.xml'\n\n  # Database - SQL Developer\n  - '?:\\Users\\*\\AppData\\Roaming\\SQL Developer\\system*\\o.jdeveloper.db.connection.*\\connections.xml'\n  - '?:\\Users\\*\\AppData\\Roaming\\SQL Developer\\system*\\o.sqldeveloper.*\\product-preferences.xml'\n\n  # Cloud - AWS\n  - '?:\\Users\\*\\.aws\\credentials\\*'\n\n  # Cloud - GCloud\n  - '?:\\Users\\*\\AppData\\Roaming\\gcloud\\*'\n\n  # Cloud - Azure\n  - '?:\\Users\\*\\.azure\\*'\n\n  # Cloud - Github\n  - '?:\\Users\\*\\.config\\git\\credentials'\n\n  # Cloud - iCloud\n  - '?:\\users\\*\\AppData\\Roaming\\Apple Computer\\Preferences\\*'\n\n  # Private Keys & Certs & Keepass\n  - '*.pem'\n  - '*.pfx'\n  - '*.p12'\n  - '*.pvk'\n  - '*.key'\n  - '*.ppk'\n  - '*.rdg'\n  - '*.kdb'\n  - '*.kdbx'\n\n  # Config - IIS Connection Strings\n  - '?:\\inetpub\\wwwroot\\*\\web.config'\n\n  # FileZilla Creds\n  - '?:\\Users\\*\\AppData\\Roaming\\FileZilla\\*'\n\n  # Jenkins Creds\n  - '*\\credentials.xml'\n  - '*\\secrets\\master.key'\n  - '*\\secrets\\hudson.util.Secret'\n\n  # SSH and SSL\n  - '?:\\users\\*\\.ssh\\*'\n\n  # WIFI\n  - '?:\\\\ProgramData\\\\Microsoft\\\\Wlansvc\\\\Profiles\\\\Interfaces\\\\*\\\\*.xml'\n\n  # Collab\n  - '?:\\Users\\*\\AppData\\Roaming\\Slack\\Cookies\\*'\n  - '?:\\Users\\*\\AppData\\Roaming\\Slack\\storage\\slack-downloads\\*'\n\n  # GPP - 'Creds (legacy domains)\n\n  - '?:\\ProgramData\\Microsoft\\Group Policy\\History\\*\\MACHINE\\Preferences\\Groups\\Groups.xml'\n  - '?:\\ProgramData\\Microsoft\\Group Policy\\History\\*\\MACHINE\\Preferences\\DataSources.xml'\n  - '?:\\ProgramData\\Microsoft\\Group Policy\\History\\*\\MACHINE\\Preferences\\ScheduledTasks\\ScheduledTasks.xml'\n  - '?:\\ProgramData\\Microsoft\\Group Policy\\History\\*\\MACHINE\\Preferences\\Services\\Services.xml'\n  - '?:\\ProgramData\\Microsoft\\Group Policy\\History\\*\\MACHINE\\Preferences\\Registry\\registry.xml'\n  - '?:\\Users\\*\\AppData\\Roaming\\KeePass\\KeePass*'\n\n  # Thunderbird\n  - '?:\\Users\\*\\AppData\\Roaming\\Thunderbird\\Profiles\\*.default*\\*'\n\n  # VPN\n  - '?:\\Users\\*\\AppData\\Local\\NordVPN\\NordVPN.exe*\\user.config'\n\n  # NTDS.DIT\n  - '*\\NTDS.DIT'\n\n  # SAM\n  - '*\\SAM'\n\n```\n\n## Closing thoughts\n\nLeveraging the new events that are collected with our kernel mode driver, and not subject to user mode tampering, we expanded our detection and prevention coverage for both credential discovery and access. Furthermore, combining it with the correlation features of Elastic EQL, we can create interesting hunts and detection rules for a variety of scenarios, with minimal false positive rates.\n\n## References\n\n- [https://github.com/AlessandroZ/LaZagne](https://github.com/AlessandroZ/LaZagne)\n- [https://github.com/GhostPack/Seatbelt](https://github.com/GhostPack/Seatbelt)\n- [https://posts.specterops.io/operational-guidance-for-offensive-user-dpapi-abuse-1fb7fac8b107](https://posts.specterops.io/operational-guidance-for-offensive-user-dpapi-abuse-1fb7fac8b107)\n- [https://github.com/gtworek/PSBits/tree/master/LSASecretDumper](https://github.com/gtworek/PSBits/tree/master/LSASecretDumper)\n- [https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Windows%20-%20Mimikatz.md](https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Windows%20-%20Mimikatz.md)\n"
    },
    "title": "Detect Credential Access with Elastic Security",
    "slug": "detect-credential-access",
    "date": "2023-03-01",
    "description": "Elastic Endpoint Security provides events that enable defenders with visibility on techniques and procedures which are commonly leveraged to access sensitive files and registry objects.",
    "author": [
      {
        "slug": "samir-bousseaden"
      }
    ],
    "image": "blog-thumb-blind-spots.png",
    "category": [
      {
        "slug": "security-operations"
      },
      {
        "slug": "detection-science"
      }
    ]
  },
  "id": "security_labs_content-detect_credential_access-md",
  "type": "security_labs_content"
}
