- name: ecs.version
  external: ecs
- name: error.message
  external: ecs
- name: event.category
  external: ecs
- name: event.id
  external: ecs
- name: event.ingested
  external: ecs
- name: event.kind
  external: ecs
- name: event.type
  external: ecs
- name: threat.indicator.type
  external: ecs
- name: threat.indicator.name
  external: ecs
- name: threat.feed.description
  type: constant_keyword
  description: Display the feed description.
  value: "New domains as they are either discovered in domain registration information, observed by our global sensor network, or reported by trusted third parties."
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name.
  value: "DomainTools domaindiscovery"
- name: threat.feed.reference
  type: constant_keyword
  description: Display the feed reference.
  value: "https://docs.techdocs.ci.domaintools.cloud/feeds/realtime/userguide/"
