# Agent Fields
- name: cloud.account.id
  external: ecs
- name: cloud.availability_zone
  external: ecs
- name: cloud.instance.id
  external: ecs
- name: cloud.instance.name
  external: ecs
- name: cloud.machine.type
  external: ecs
- name: cloud.provider
  external: ecs
- name: cloud.region
  external: ecs
- name: cloud.project.id
  external: ecs
- name: container.id
  external: ecs
- name: container.image.name
  external: ecs
- name: container.labels
  external: ecs
- name: container.name
  external: ecs
- name: host.architecture
  external: ecs
- name: host.domain
  external: ecs
- name: host.hostname
  external: ecs
- name: host.id
  external: ecs
- name: host.ip
  external: ecs
- name: host.mac
  external: ecs
- name: host.name
  external: ecs
- name: host.os.family
  external: ecs
- name: host.os.kernel
  external: ecs
- name: host.os.name
  external: ecs
- name: host.os.platform
  external: ecs
- name: host.os.version
  external: ecs
- name: host.type
  external: ecs
# Base-Fields
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset name.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_otx
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: Alienvault OTX
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_otx-7da241a0-71f3-11ec-9910-d1ceb8a1734b
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_otx.pulses_subscribed
- name: "@timestamp"
  type: date
  description: Event timestamp.
# Beats Fields
- name: input.type
  type: keyword
  description: Type of Filebeat input.
- name: log.flags
  type: keyword
  description: Flags for the log file.
- name: log.offset
  type: long
  description: Offset of the entry in the log file.
- name: log.file.path
  type: keyword
  description: Path to the log file.
# ECS fields
- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: error.message
- external: ecs
  name: tags
- external: ecs
  name: related.hash
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.created
- external: ecs
  name: event.category
- external: ecs
  name: event.type
- external: ecs
  name: event.original
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.file.type
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.pe.imphash
- name: threat.indicator.file.hash.pehash
  type: keyword
  description: "The file's pehash, if available."
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: labels
# OTX Fields
- name: otx
  type: group
  description: >
    Fields for OTX Threat Intel

  fields:
    - name: id
      type: keyword
      description: >
        The ID of the indicator.

    - name: content
      type: keyword
    - name: count
      type: integer
    - name: created
      type: date
    - name: description
      type: keyword
    - name: expiration
      type: date
    - name: indicator
      type: keyword
    - name: is_active
      type: integer
    - name: prefetch_pulse_ids
      type: boolean
    - name: role
      type: keyword
    - name: title
      type: keyword
    - name: t
      type: double
    - name: t2
      type: double
    - name: t3
      type: double
    - name: pulse
      type: group
      fields:
        - name: adversary
          type: keyword
        - name: attack_ids
          type: keyword
        - name: author_name
          type: keyword
        - name: created
          type: date
        - name: description
          type: keyword
        - name: extract_source
          type: keyword
        - name: id
          type: keyword
        - name: industries
          type: keyword
        - name: malware_families
          type: keyword
        - name: modified
          type: date
        - name: more_indicators
          type: boolean
        - name: name
          type: keyword
        - name: public
          type: integer
        - name: references
          type: keyword
        - name: revision
          type: integer
        - name: targeted_countries
          type: keyword
        - name: tlp
          type: keyword
