# Define ECS constant fields as constant_keyword
- name: observer.vendor
  type: constant_keyword
  external: ecs
- name: vulnerability.scanner.vendor
  type: constant_keyword
  external: ecs
# Other ECS fields
- name: agent.ephemeral_id
  external: ecs
- name: agent.id
  external: ecs
- name: agent.name
  external: ecs
- name: agent.type
  external: ecs
- name: agent.version
  external: ecs
- name: ecs.version
  external: ecs
- name: error.code
  external: ecs
- name: error.id
  external: ecs
- name: error.message
  external: ecs
- name: event.agent_id_status
  external: ecs
- name: event.category
  external: ecs
- name: event.created
  external: ecs
- name: event.id
  external: ecs
- name: event.ingested
  external: ecs
- name: event.kind
  external: ecs
- name: event.original
  external: ecs
- name: event.severity
  external: ecs
- name: event.type
  external: ecs
- name: host.architecture
  external: ecs
- name: host.hostname
  external: ecs
- name: host.id
  external: ecs
- name: host.ip
  external: ecs
- name: host.mac
  external: ecs
- name: host.name
  external: ecs
- name: host.os.family
  external: ecs
- name: host.os.full
  external: ecs
- name: host.os.name
  external: ecs
- name: host.os.platform
  external: ecs
- name: host.os.type
  external: ecs
- name: host.os.version
  external: ecs
- name: host.type
  external: ecs
- name: host.risk.static_score
  external: ecs
- name: observer.product
  external: ecs
- name: package.name
  external: ecs
- name: package.version
  external: ecs
- name: related.hosts
  external: ecs
- name: related.ip
  external: ecs
- name: tags
  external: ecs
- name: vulnerability.category
  external: ecs
- name: vulnerability.classification
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.enumeration
  external: ecs
- name: vulnerability.id
  external: ecs
- name: vulnerability.reference
  external: ecs
- name: vulnerability.score.base
  external: ecs
- name: vulnerability.score.version
  external: ecs
- name: vulnerability.severity
  external: ecs
