- name: agent.ephemeral_id
  external: ecs
- name: agent.id
  external: ecs
- name: agent.name
  external: ecs
- name: agent.type
  external: ecs
- name: agent.version
  external: ecs
- name: ecs.version
  external: ecs
- name: error.message
  external: ecs
- name: event.category
  external: ecs
- name: event.created
  external: ecs
- name: event.duration
  external: ecs
- name: event.end
  external: ecs
- name: event.id
  external: ecs
- name: event.ingested
  external: ecs
- name: event.kind
  external: ecs
- name: event.start
  external: ecs
- name: event.type
  external: ecs
- name: host.hostname
  external: ecs
- name: host.id
  external: ecs
- name: host.mac
  external: ecs
- name: host.os.platform
  external: ecs
- name: host.os.version
  external: ecs
- name: log.level
  external: ecs
- name: message
  external: ecs
- name: observer.vendor
  external: ecs
  type: constant_keyword
  value: JupiterOne
- name: threat.indicator.file.name
  external: ecs
- name: threat.indicator.file.path
  external: ecs
- name: threat.indicator.ip
  external: ecs
- name: threat.tactic.id
  external: ecs
- name: threat.tactic.name
  external: ecs
- name: threat.technique.id
  external: ecs
- name: threat.technique.name
  external: ecs
- name: url.domain
  external: ecs
- name: url.extension
  external: ecs
- name: url.original
  external: ecs
- name: url.path
  external: ecs
- name: url.query
  external: ecs
- name: user.id
  external: ecs
- name: user.name
  external: ecs
- name: vulnerability.category
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.id
  external: ecs
- name: vulnerability.score.base
  external: ecs
- name: vulnerability.severity
  external: ecs
