- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: '@timestamp'
  type: date
  description: Event timestamp.
- name: event.category
  type: constant_keyword
  description: Event category.
  value: web
- name: event.dataset
  type: constant_keyword
  description: Event dataset.
- name: event.kind
  type: constant_keyword
  description: Event kind
  value: metric
- name: event.module
  type: constant_keyword
  description: Event module
  value: websphere_application_server
- name: event.type
  type: constant_keyword
  description: Event type
