- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: error.message
- external: ecs
  name: tags
- external: ecs
  name: related.hash
- external: ecs
  name: related.ip
- external: ecs
  name: related.hosts
- external: ecs
  name: event.created
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.category
- external: ecs
  name: event.provider
- external: ecs
  name: event.type
- external: ecs
  name: event.original
- external: ecs
  name: network.protocol
- external: ecs
  name: network.transport
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.modified_at
- external: ecs
  name: threat.indicator.reference
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.indicator.sightings
- external: ecs
  name: threat.indicator.file.type
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.file.pe.imphash
- external: ecs
  name: threat.indicator.file.hash.ssdeep
- name: threat.indicator.tls.client.ja3
  level: extended
  type: keyword
  description: An md5 hash that identifies clients based on their TLS handshake.
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.as.number
- external: ecs
  name: threat.indicator.as.organization.name
- external: ecs
  name: threat.indicator.marking.tlp
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.geo.location
- external: ecs
  name: threat.indicator.geo.country_iso_code
- external: ecs
  name: threat.indicator.geo.region_name
- external: ecs
  name: threat.indicator.geo.timezone
- external: ecs
  name: threat.indicator.name
- external: ecs
  name: labels
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Name of the module this data is coming from.
  value: ti_cif3
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: cif3
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_cif3.feed
