- external: ecs
  name: ecs.version
  type: keyword
- external: ecs
  name: event.category
  type: keyword
- external: ecs
  name: event.created
  type: date
- external: ecs
  name: event.id
  type: keyword
- external: ecs
  name: event.ingested
  type: date
- external: ecs
  name: event.kind
  type: keyword
- external: ecs
  name: event.type
  type: keyword
- external: ecs
  name: message
  type: keyword
- external: ecs
  name: observer.product
  type: constant_keyword
- external: ecs
  name: observer.vendor
  type: constant_keyword
- external: ecs
  name: related.hash
  type: keyword
- external: ecs
  name: related.ip
  type: ip
- external: ecs
  name: related.user
  type: keyword
- external: ecs
  name: tags
  type: keyword
- external: ecs
  name: threat.indicator.description
  type: keyword
- external: ecs
  name: threat.indicator.first_seen
  type: date
- external: ecs
  name: threat.indicator.ip
  type: ip
- external: ecs
  name: threat.indicator.last_seen
  type: date
- external: ecs
  name: threat.indicator.marking.tlp
  type: keyword
- external: ecs
  name: threat.indicator.modified_at
  type: date
- external: ecs
  name: threat.indicator.name
  type: keyword
- external: ecs
  name: threat.indicator.provider
  type: keyword
- external: ecs
  name: threat.indicator.geo.country_name
  type: keyword
- external: ecs
  name: threat.indicator.reference
  type: keyword
- external: ecs
  name: threat.indicator.type
  type: keyword
