- name: ocsf
  type: group
  fields:
    - name: activity_id
      type: keyword
      description: The normalized identifier of the activity that triggered the event.
    - name: activity_name
      type: keyword
      description: The event activity name, as defined by the activity_id.
    - name: api
      type: group
      fields:
        - name: operation
          type: keyword
          description: Verb/Operation associated with the request.
        - name: request
          type: group
          fields:
            - name: flags
              type: keyword
              description: The list of communication flags, normalized to the captions of the flag_ids values. In the case of 'Other', they are defined by the event source.
            - name: uid
              type: keyword
              description: The unique request identifier.
        - name: response
          type: group
          fields:
            - name: code
              type: long
              description: The numeric response sent to a request.
            - name: error
              type: keyword
              description: Error Code.
            - name: error_message
              type: keyword
              description: Error Message.
            - name: flags
              type: keyword
              description: The list of communication flags, normalized to the captions of the flag_ids values. In the case of 'Other', they are defined by the event source.
            - name: message
              type: keyword
              description: The description of the event, as defined by the event source.
        - name: service
          type: group
          fields:
            - name: labels
              type: keyword
              description: The list of labels associated with the service.
            - name: name
              type: keyword
              description: The name of the service.
            - name: uid
              type: keyword
              description: The unique identifier of the service.
            - name: version
              type: keyword
              description: The version of the service.
        - name: version
          type: keyword
          description: The version of the API service.
    - name: category_name
      type: keyword
      description: 'The event category name, as defined by category_uid value: Identity & Access Management.'
    - name: category_uid
      type: keyword
      description: The category unique identifier of the event.3 Identity & Access ManagementIdentity & Access Management (IAM) events relate to the supervision of the system's authentication and access control model. Examples of such events are the success or failure of authentication, granting of authority, password change, entity change, privileged use etc.
    - name: cis_benchmark_result
      type: group
      fields:
        - name: desc
          type: keyword
          description: The CIS benchmark description.
        - name: name
          type: keyword
          description: The CIS benchmark name.
        - name: remediation
          type: group
          fields:
            - name: desc
              type: keyword
              description: The description of the remediation strategy.
            - name: kb_articles
              type: keyword
              description: The KB article/s related to the entity.
        - name: rule
          type: group
          fields:
            - name: category
              type: keyword
              description: The rule category.
            - name: desc
              type: keyword
              description: The description of the rule that generated the event.
            - name: name
              type: keyword
              description: The name of the rule that generated the event.
            - name: type
              type: keyword
              description: The rule type.
            - name: uid
              type: keyword
              description: The unique identifier of the rule that generated the event.
            - name: version
              type: keyword
              description: The rule version.
    - name: class_name
      type: keyword
      description: 'The event class name, as defined by class_uid value: Security Finding, User Inventory Info.'
    - name: class_uid
      type: keyword
      description: The unique identifier of a class. A Class describes the attributes available in an event.2001 Security FindingSecurity Finding events describe findings, detections, anomalies, alerts and/or actions performed by security products.
    - name: cloud
      type: group
      fields:
        - name: account
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the account (e.g. GCP Account Name).
            - name: type
              type: keyword
              description: The account type, normalized to the caption of 'account_type_id'. In the case of 'Other', it is defined by the event source.
            - name: type_id
              type: keyword
              description: The normalized account type identifier.
            - name: uid
              type: keyword
              description: The unique identifier of the account (e.g. AWS Account ID).
        - name: org
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the organization. For example, Widget, Inc.
            - name: ou_name
              type: keyword
              description: The name of the organizational unit, within an organization. For example, Finance, IT, R&D.
            - name: ou_uid
              type: keyword
              description: The alternate identifier for an entity's unique identifier. For example, its Active Directory OU DN or AWS OU ID.
            - name: uid
              type: keyword
              description: The unique identifier of the organization. For example, its Active Directory or AWS Org ID.
        - name: project_uid
          type: keyword
          description: The unique identifier of a Cloud project.
        - name: provider
          type: keyword
          description: The unique name of the Cloud services provider, such as AWS, MS Azure, GCP, etc.
        - name: region
          type: keyword
          description: The name of the cloud region, as defined by the cloud provider.
        - name: zone
          type: keyword
          description: The availability zone in the cloud region, as defined by the cloud provider.
    - name: count
      type: long
      description: The number of times that events in the same logical group occurred during the event Start Time to End Time period.
    - name: duration
      type: long
      description: The event duration or aggregate time, the amount of time the event covers from start_time to end_time in milliseconds.
    - name: end_time
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: end_time_dt
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: enrichments
      type: group
      fields:
        - name: data
          type: flattened
          description: The enrichment data associated with the attribute and value. The meaning of this data depends on the type the enrichment record.
        - name: name
          type: keyword
          description: The name of the attribute to which the enriched data pertains.
        - name: provider
          type: keyword
          description: The enrichment data provider name.
        - name: type
          type: keyword
          description: The enrichment type. For example, location.
        - name: value
          type: keyword
          description: The value of the attribute to which the enriched data pertains.
    - name: kb_article_list
      type: group
      description: The KB Article object contains metadata that describes the patch or update.
      fields:
        - name: uid
          type: keyword
          description: The unique identifier for the kb article.
        - name: bulletin
          type: keyword
          description: The kb article bulletin identifier.
        - name: classification
          type: keyword
          description: The vendors classification of the kb article.
        - name: created_time
          type: long
          description: The date the kb article was released by the vendor.
        - name: created_time_dt
          type: date
          description: The date the kb article was released by the vendor.
        - name: is_superseded
          type: boolean
          description: "The patch is superseded"
        - name: severity
          type: keyword
          description: The severity of the kb article.
        - name: size
          type: long
          description: The size in bytes for the kb article.
        - name: src_url
          type: keyword
          description: The kb article link from the source vendor.
        - name: title
          type: keyword
          description: The title of the kb article.
        - name: os
          type: flattened
          description: The operating system the kb article applies.
        - name: product
          type: flattened
          description: The product details the kb article applies.
    - name: message
      type: keyword
      description: The description of the event, as defined by the event source.
    - name: metadata
      type: group
      fields:
        - name: tenant_uid
          type: keyword
          description: The audit level at which an event was generated.
        - name: log_level
          type: keyword
          description: The log level of the event.
        - name: correlation_uid
          type: keyword
          description: The unique identifier used to correlate events.
        - name: event_code
          type: keyword
          description: The Event ID or Code that the product uses to describe the event.
        - name: extension
          type: group
          fields:
            - name: name
              type: keyword
              description: 'The schema extension name. For example: dev.'
            - name: uid
              type: keyword
              description: 'The schema extension unique identifier. For example: 999.'
            - name: version
              type: keyword
              description: 'The schema extension version. For example: 1.0.0-alpha.2.'
        - name: labels
          type: keyword
          description: The list of category labels attached to the event or specific attributes. Labels are user defined tags or aliases added at normalization time.
        - name: log_name
          type: keyword
          description: 'The event log name. For example, syslog file name or Windows logging subsystem: Security.'
        - name: log_provider
          type: keyword
          description: The logging provider or logging service that logged the event. For example, Microsoft-Windows-Security-Auditing.
        - name: log_version
          type: keyword
          description: The event log schema version that specifies the format of the original event. For example syslog version or Cisco Log Schema Version.
        - name: logged_time
          type: date
          description: The time when the logging system collected and logged the event. This attribute is distinct from the event time in that event time typically contain the time extracted from the original event. Most of the time, these two times will be different.
        - name: logged_time_dt
          type: date
          description: The time when the logging system collected and logged the event. This attribute is distinct from the event time in that event time typically contain the time extracted from the original event. Most of the time, these two times will be different.
        - name: loggers
          type: flattened
          description: An array of Logger objects that describe the devices and logging products between the event source and its eventual destination.
        - name: modified_time
          type: date
          description: The time when the event was last modified or enriched.
        - name: modified_time_dt
          type: date
          description: The time when the event was last modified or enriched.
        - name: original_time
          type: keyword
          description: The original event time as reported by the event source. For example, the time in the original format from system event log such as Syslog on Unix/Linux and the System event file on Windows. Omit if event is generated instead of collected via logs.
        - name: processed_time
          type: date
          description: The event processed time, such as an ETL operation.
        - name: processed_time_dt
          type: date
          description: The event processed time, such as an ETL operation.
        - name: product
          type: group
          fields:
            - name: feature
              type: group
              fields:
                - name: name
                  type: keyword
                  description: The name of the feature.
                - name: uid
                  type: keyword
                  description: The unique identifier of the feature.
                - name: version
                  type: keyword
                  description: The version of the feature.
            - name: lang
              type: keyword
              description: 'The two letter lowercase language codes, as defined by ISO 639-1. For example: en (English), de (German), or fr (French).'
            - name: name
              type: keyword
              description: The name of the product.
            - name: path
              type: keyword
              description: The installation path of the product.
            - name: uid
              type: keyword
              description: The unique identifier of the product.
            - name: vendor_name
              type: keyword
              description: The name of the vendor of the product.
            - name: url_string
              type: keyword
              description: The URL pointing towards the product.
            - name: version
              type: keyword
              description: 'The version of the product, as defined by the event source. For example: 2013.1.3-beta.'
            - name: cpe_name
              type: keyword
              description: The Common Platform Enumeration (CPE) name as described by (NIST) For example, cpe:/a:apple:safari:16.2.
        - name: profiles
          type: keyword
          description: The list of profiles used to create the event.
        - name: sequence
          type: long
          description: Sequence number of the event. The sequence number is a value available in some events, to make the exact ordering of events unambiguous, regardless of the event time precision.
        - name: uid
          type: keyword
          description: The logging system-assigned unique identifier of an event instance.
        - name: version
          type: keyword
          description: 'The version of the OCSF schema, using Semantic Versioning Specification (SemVer). For example: 1.0.0. Event consumers use the version to determine the available event attributes.'
    - name: observables
      type: group
      fields:
        - name: name
          type: keyword
          description: 'The full name of the observable attribute. The name is a pointer/reference to an attribute within the event data. For example: file.name.'
        - name: reputation
          type: group
          fields:
            - name: base_score
              type: double
              description: The reputation score as reported by the event source.
            - name: provider
              type: keyword
              description: The provider of the reputation information.
            - name: score
              type: keyword
              description: The reputation score, normalized to the caption of the score_id value. In the case of 'Other', it is defined by the event source.
            - name: score_id
              type: keyword
              description: The normalized reputation score identifier.
        - name: type
          type: keyword
          description: The observable value type name.
        - name: type_id
          type: keyword
          description: The observable value type identifier.
        - name: value
          type: keyword
          description: The value associated with the observable attribute.
    - name: raw_data
      type: flattened
      description: The event data as received from the event source.
    - name: severity
      type: keyword
      description: The event severity, normalized to the caption of the severity_id value. In the case of 'Other', it is defined by the event source.
    - name: severity_id
      type: long
      description: The normalized identifier of the event severity. The normalized severity is a measurement the effort and expense required to manage and resolve an event or incident. Smaller numerical values represent lower impact events, and larger numerical values represent higher impact events.
    - name: start_time
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: start_time_dt
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: status
      type: keyword
      description: The event status, normalized to the caption of the status_id value. In the case of 'Other', it is defined by the event source.
    - name: status_code
      type: keyword
      description: The event status code, as reported by the event source. For example, in a Windows Failed Authentication event, this would be the value of 'Failure Code', e.g. 0x18.
    - name: status_detail
      type: keyword
      description: The status details contains additional information about the event outcome.
    - name: status_id
      type: keyword
      description: The normalized identifier of the event status.
    - name: time
      type: date
      description: The normalized event occurrence time.
    - name: time_dt
      type: date
      description: The normalized event occurrence time.
    - name: timezone_offset
      type: long
      description: The number of minutes that the reported event time is ahead or behind UTC, in the range -1,080 to +1,080.
    - name: type_name
      type: keyword
      description: The event type name, as defined by the type_uid.
    - name: type_uid
      type: keyword
      description: 'The event type ID. It identifies the events semantics and structure. The value is calculated by the logging system as: class_uid * 100 + activity_id.'
    - name: unmapped
      type: flattened
      description: The attributes that are not mapped to the event schema. The names and values of those attributes are specific to the event source.
