- name: ocsf
  type: group
  fields:
    - name: activity_id
      type: keyword
      description: The normalized identifier of the activity that triggered the event.
    - name: activity_name
      type: keyword
      description: The event activity name, as defined by the activity_id.
    - name: category_name
      type: keyword
      description: 'The event category name, as defined by category_uid value: Identity & Access Management.'
    - name: category_uid
      type: keyword
      description: The category unique identifier of the event.3 Identity & Access ManagementIdentity & Access Management (IAM) events relate to the supervision of the system's authentication and access control model. Examples of such events are the success or failure of authentication, granting of authority, password change, entity change, privileged use etc.
    - name: cis_benchmark_result
      type: group
      fields:
        - name: desc
          type: keyword
          description: The CIS benchmark description.
        - name: name
          type: keyword
          description: The CIS benchmark name.
        - name: remediation
          type: group
          fields:
            - name: desc
              type: keyword
              description: The description of the remediation strategy.
            - name: kb_articles
              type: keyword
              description: The KB article/s related to the entity.
            - name: kb_article_list
              type: flattened
              description: A list of KB articles or patches related to an endpoint.
            - name: references
              type: keyword
              description: A list of supporting URL/s, references that help describe the remediation strategy.
        - name: rule
          type: group
          fields:
            - name: category
              type: keyword
              description: The rule category.
            - name: desc
              type: keyword
              description: The description of the rule that generated the event.
            - name: name
              type: keyword
              description: The name of the rule that generated the event.
            - name: type
              type: keyword
              description: The rule type.
            - name: uid
              type: keyword
              description: The unique identifier of the rule that generated the event.
            - name: version
              type: keyword
              description: The rule version.
    - name: class_name
      type: keyword
      description: 'The event class name, as defined by class_uid value: Security Finding, User Inventory Info.'
    - name: class_uid
      type: keyword
      description: The unique identifier of a class. A Class describes the attributes available in an event.2001 Security FindingSecurity Finding events describe findings, detections, anomalies, alerts and/or actions performed by security products.
    - name: cloud
      type: group
      fields:
        - name: account
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the account (e.g. GCP Account Name).
            - name: type
              type: keyword
              description: The account type, normalized to the caption of 'account_type_id'. In the case of 'Other', it is defined by the event source.
            - name: type_id
              type: keyword
              description: The normalized account type identifier.
            - name: uid
              type: keyword
              description: The unique identifier of the account (e.g. AWS Account ID).
        - name: org
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the organization. For example, Widget, Inc.
            - name: ou_name
              type: keyword
              description: The name of the organizational unit, within an organization. For example, Finance, IT, R&D.
            - name: ou_uid
              type: keyword
              description: The alternate identifier for an entity's unique identifier. For example, its Active Directory OU DN or AWS OU ID.
            - name: uid
              type: keyword
              description: The unique identifier of the organization. For example, its Active Directory or AWS Org ID.
        - name: project_uid
          type: keyword
          description: The unique identifier of a Cloud project.
        - name: provider
          type: keyword
          description: The unique name of the Cloud services provider, such as AWS, MS Azure, GCP, etc.
        - name: region
          type: keyword
          description: The name of the cloud region, as defined by the cloud provider.
        - name: zone
          type: keyword
          description: The availability zone in the cloud region, as defined by the cloud provider.
    - name: count
      type: long
      description: The number of times that events in the same logical group occurred during the event Start Time to End Time period.
    - name: duration
      type: long
      description: The event duration or aggregate time, the amount of time the event covers from start_time to end_time in milliseconds.
    - name: end_time
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: end_time_dt
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: enrichments
      type: group
      fields:
        - name: data
          type: flattened
          ignore_malformed: true
          description: The enrichment data associated with the attribute and value. The meaning of this data depends on the type the enrichment record.
        - name: name
          type: keyword
          description: The name of the attribute to which the enriched data pertains.
        - name: provider
          type: keyword
          description: The enrichment data provider name.
        - name: type
          type: keyword
          description: The enrichment type. For example, location.
        - name: value
          type: keyword
          description: The value of the attribute to which the enriched data pertains.
    - name: kb_article_list
      type: group
      description: The KB Article object contains metadata that describes the patch or update.
      fields:
        - name: uid
          type: keyword
          description: The unique identifier for the kb article.
        - name: bulletin
          type: keyword
          description: The kb article bulletin identifier.
        - name: classification
          type: keyword
          description: The vendors classification of the kb article.
        - name: created_time
          type: long
          description: The date the kb article was released by the vendor.
        - name: created_time_dt
          type: date
          description: The date the kb article was released by the vendor.
        - name: is_superseded
          type: boolean
          description: "The patch is superseded"
        - name: severity
          type: keyword
          description: The severity of the kb article.
        - name: size
          type: long
          description: The size in bytes for the kb article.
        - name: src_url
          type: keyword
          description: The kb article link from the source vendor.
        - name: title
          type: keyword
          description: The title of the kb article.
        - name: os
          type: flattened
          description: The operating system the kb article applies.
        - name: product
          type: flattened
          description: The product details the kb article applies.
    - name: message
      type: keyword
      description: The description of the event, as defined by the event source.
    - name: observables
      type: group
      fields:
        - name: name
          type: keyword
          description: 'The full name of the observable attribute. The name is a pointer/reference to an attribute within the event data. For example: file.name.'
        - name: reputation
          type: group
          fields:
            - name: base_score
              type: double
              description: The reputation score as reported by the event source.
            - name: provider
              type: keyword
              description: The provider of the reputation information.
            - name: score
              type: keyword
              description: The reputation score, normalized to the caption of the score_id value. In the case of 'Other', it is defined by the event source.
            - name: score_id
              type: keyword
              description: The normalized reputation score identifier.
        - name: type
          type: keyword
          description: The observable value type name.
        - name: type_id
          type: keyword
          description: The observable value type identifier.
        - name: value
          type: keyword
          description: The value associated with the observable attribute.
    - name: prev_security_states
      type: group
      description: The previous security states of the device.
      fields:
        - name: state
          type: keyword
          description: The security state of the discovery.
        - name: state_id
          type: integer
          description: The security state of the managed entity.
    - name: raw_data
      type: flattened
      description: The event data as received from the event source.
    - name: raw_data_keyword
      type: keyword
      description: The raw event data keyword as received from the event source.
    - name: security_level
      type: keyword
      description: The current security level of the entity.
    - name: security_level_id
      type: integer
      description: The current security level of the entity.
    - name: security_states
      type: group
      description: The current security states of the device.
      fields:
        - name: state
          type: keyword
          description: The security state of the discovery.
        - name: state_id
          type: integer
          description: The security state of the managed entity.
    - name: severity
      type: keyword
      description: The event severity, normalized to the caption of the severity_id value. In the case of 'Other', it is defined by the event source.
    - name: severity_id
      type: long
      description: The normalized identifier of the event severity. The normalized severity is a measurement the effort and expense required to manage and resolve an event or incident. Smaller numerical values represent lower impact events, and larger numerical values represent higher impact events.
    - name: start_time
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: start_time_dt
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: status
      type: keyword
      description: The event status, normalized to the caption of the status_id value. In the case of 'Other', it is defined by the event source.
    - name: status_code
      type: keyword
      description: The event status code, as reported by the event source. For example, in a Windows Failed Authentication event, this would be the value of 'Failure Code', e.g. 0x18.
    - name: status_detail
      type: keyword
      description: The status details contains additional information about the event outcome.
    - name: status_id
      type: keyword
      description: The normalized identifier of the event status.
    - name: time
      type: date
      description: The normalized event occurrence time.
    - name: time_dt
      type: date
      description: The normalized event occurrence time.
    - name: timezone_offset
      type: long
      description: The number of minutes that the reported event time is ahead or behind UTC, in the range -1,080 to +1,080.
    - name: type_name
      type: keyword
      description: The event type name, as defined by the type_uid.
    - name: type_uid
      type: keyword
      description: 'The event type ID. It identifies the events semantics and structure. The value is calculated by the logging system as: class_uid * 100 + activity_id.'
    - name: unmapped
      type: flattened
      description: The attributes that are not mapped to the event schema. The names and values of those attributes are specific to the event source.
