- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: ecs.version
- external: ecs
  name: error.message
- external: ecs
  name: event.category
- external: ecs
  name: event.ingested
  type: date
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- name: observer.product
  external: ecs
  type: constant_keyword
  value: PingDirectory
- name: observer.vendor
  external: ecs
  type: constant_keyword
  value: PingIdentity
- external: ecs
  name: organization.name
- external: ecs
  name: user.domain
- external: ecs
  name: user.email
- external: ecs
  name: user.full_name
- external: ecs
  name: user.id
- external: ecs
  name: user.name
