# Datastream fields (copied from ti_crowdstrike/data_stream/intel/fields/fields.yml)
- name: ti_crowdstrike.intel
  type: group
  fields:
    - name: _marker
      type: keyword
      description: A special marker associated with the Intel Indicator.
    - name: actors
      type: keyword
      description: Information related to actors associated with the Intel Indicator.
    - name: deleted
      type: boolean
      description: Indicates whether the Intel Indicator has been deleted.
    - name: domain_types
      type: keyword
      description: Information related to domain types associated with the Intel Indicator.
    - name: id
      type: keyword
      description: A unique identifier for the Intel Indicator.
    - name: ip_address_types
      type: ip
      description: Information related to IP address types associated with the Intel Indicator.
    - name: kill_chains
      type: keyword
      description: Information related to kill chains associated with the Intel Indicator.
    - name: labels
      type: group
      fields:
        - name: created_on
          type: date
          description: Timestamp indicating when the labels were created.
        - name: last_valid_on
          type: date
          description: Timestamp indicating when the labels were last valid.
        - name: name
          type: keyword
          description: The name of labels associated with the Intel Indicator.
    - name: last_updated
      type: date
      description: Timestamp indicating when the Intel Indicator was last updated.
    - name: malicious_confidence
      type: keyword
      description: Indicates the level of confidence that the Intel Indicator is malicious.
    - name: malware_families
      type: keyword
      description: Information related to malware families associated with the Intel Indicator.
    - name: published_date
      type: date
      description: Timestamp indicating when the Intel Indicator was published.
    - name: relations
      type: group
      fields:
        - name: created_date
          type: date
          description: Create date of relation.
        - name: id
          type: keyword
          description: Id of the relation.
        - name: indicator
          type: keyword
          description: Indicator associated with the relation.
        - name: last_valid_date
          type: date
          description: Last valid date of relation.
        - name: type
          type: keyword
          description: Type of relation.
    - name: reports
      type: keyword
      description: Information related to reports associated with the Intel Indicator.
    - name: targets
      type: keyword
      description: Information related to targets associated with the Intel Indicator.
    - name: threat_types
      type: keyword
      description: Information related to threat types associated with the Intel Indicator.
    - name: type
      type: keyword
      description: The type of indicator, indicating it is a SHA256 hash.
    - name: value
      type: keyword
      description: The specific value of the indicator.
    - name: vulnerabilities
      type: keyword
      description: Information related to vulnerabilities associated with the Intel Indicator.
# Beats fields (copied from ti_crowdstrike/data_stream/intel/fields/beats.yml)
- name: input.type
  type: keyword
  description: Type of filebeat input.
- name: log.offset
  type: long
  description: Log offset.
- name: tags
  type: keyword
  description: User defined tags.
# Base fields (copied from ti_crowdstrike/data_stream/ioc/fields/base-fields.yml)
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: '@timestamp'
  type: date
  description: Event timestamp.
# ECS fields
- name: event.category
  type: keyword
- name: event.id
  type: keyword
- name: event.ingested
  type: date
- name: event.kind
  type: keyword
- name: event.type
  type: keyword
- name: threat.indicator.confidence
  type: keyword
- name: threat.indicator.type
  type: keyword
