- external: ecs
  name: destination.domain
- external: ecs
  name: destination.ip
- external: ecs
  name: destination.port
- external: ecs
  name: ecs.version
- external: ecs
  name: event.action
- external: ecs
  name: event.category
- external: ecs
  name: event.created
- external: ecs
  name: event.id
- external: ecs
  name: event.kind
- external: ecs
  name: event.original
- external: ecs
  name: event.type
- external: ecs
  name: network.direction
- external: ecs
  name: network.protocol
- external: ecs
  name: organization.name
- external: ecs
  name: process.end
- external: ecs
  name: process.executable
- external: ecs
  name: process.name
- external: ecs
  name: process.parent.pid
- external: ecs
  name: process.pid
- external: ecs
  name: process.start
- external: ecs
  name: related.ip
- external: ecs
  name: source.domain
- external: ecs
  name: source.ip
- external: ecs
  name: source.mac
- external: ecs
  name: source.port
- external: ecs
  name: tags
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.enrichments
- external: ecs
  name: threat.enrichments.indicator.file.hash.md5
- external: ecs
  name: threat.enrichments.indicator.file.hash.sha1
- external: ecs
  name: threat.enrichments.indicator.file.hash.sha256
- external: ecs
  name: threat.enrichments.indicator.file.hash.sha512
- external: ecs
  name: url.domain
- external: ecs
  name: url.extension
- external: ecs
  name: url.fragment
- external: ecs
  name: url.full
- external: ecs
  name: url.original
- external: ecs
  name: url.password
- external: ecs
  name: url.path
- external: ecs
  name: url.port
- external: ecs
  name: url.query
- external: ecs
  name: url.scheme
- external: ecs
  name: url.username
- external: ecs
  name: vulnerability.id
- external: ecs
  name: vulnerability.reference
- external: ecs
  name: vulnerability.scanner.vendor
- external: ecs
  name: vulnerability.score.base
- external: ecs
  name: vulnerability.score.version
- external: ecs
  name: host.architecture
- external: ecs
  name: host.domain
- external: ecs
  name: host.hostname
- external: ecs
  name: host.id
- external: ecs
  name: host.ip
- external: ecs
  name: host.mac
- external: ecs
  name: host.name
- external: ecs
  name: host.os.family
- external: ecs
  name: host.os.kernel
- external: ecs
  name: host.os.name
- external: ecs
  name: host.os.platform
- external: ecs
  name: host.os.version
- external: ecs
  name: host.type
- external: ecs
  name: cloud.account.id
- external: ecs
  name: cloud.account.name
- external: ecs
  name: cloud.instance.name
- external: ecs
  name: cloud.availability_zone
- external: ecs
  name: cloud.instance.id
- external: ecs
  name: cloud.machine.type
- external: ecs
  name: cloud.project.id
- external: ecs
  name: cloud.provider
- external: ecs
  name: cloud.region
- external: ecs
  name: container.id
- external: ecs
  name: container.image.name
- external: ecs
  name: container.labels
- external: ecs
  name: container.name
- external: ecs
  name: event.dataset
  type: constant_keyword
