- name: ecs.version
  type: keyword
- name: error.message
  type: match_only_text
- name: event.category
  type: keyword
- name: event.id
  type: keyword
- name: event.ingested
  type: date
- name: event.kind
  type: keyword
- name: event.type
  type: keyword
- name: related.hash
  type: keyword
- name: related.ip
  type: ip
- name: related.user
  type: keyword
- name: threat.indicator.confidence
  type: keyword
- name: threat.indicator.file.hash.md5
  type: keyword
- name: threat.indicator.file.hash.sha1
  type: keyword
- name: threat.indicator.file.hash.sha256
  type: keyword
- name: threat.indicator.ip
  type: ip
- name: threat.indicator.name
  type: keyword
- name: threat.indicator.provider
  type: keyword
- name: threat.indicator.type
  type: keyword
- name: threat.indicator.url.full
  type: keyword
- name: vulnerability.category
  type: keyword
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module.
  value: ti_crowdstrike
- name: event.dataset
  type: constant_keyword
  description: Event dataset.
  value: ti_crowdstrike.intel
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name.
  value: CrowdStrike Intel