{
    "attributes": {
        "columns": [
            "source.ip",
            "destination.ip",
            "vpn.inferences"
        ],
        "description": "",
        "grid": {},
        "hideChart": false,
        "isTextBasedQuery": false,
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [],
                "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.index",
                "query": {
                    "language": "kuery",
                    "query": ""
                }
            }
        },
        "sort": [
            [
                "@timestamp",
                "desc"
            ]
        ],
        "timeRestore": false,
        "title": "VPN Inference Log Data [Logs Corelight]",
        "visContext": {
            "attributes": {
                "references": [],
                "state": {
                    "adHocDataViews": {
                        "b2bcbb11fd7b30e2a9f2ee93a6a5ffd1f700ee82fff0bfc92dd439c707a35ebb": {
                            "allowHidden": false,
                            "allowNoIndex": false,
                            "fieldFormats": {},
                            "id": "b2bcbb11fd7b30e2a9f2ee93a6a5ffd1f700ee82fff0bfc92dd439c707a35ebb",
                            "name": "logs-corelight.various-*",
                            "runtimeFieldMap": {},
                            "sourceFilters": [],
                            "timeFieldName": "@timestamp",
                            "title": "logs-corelight.various-*",
                            "type": "esql"
                        }
                    },
                    "datasourceStates": {
                        "textBased": {
                            "indexPatternRefs": [
                                {
                                    "id": "b2bcbb11fd7b30e2a9f2ee93a6a5ffd1f700ee82fff0bfc92dd439c707a35ebb",
                                    "timeField": "@timestamp",
                                    "title": "logs-corelight.various-*"
                                }
                            ],
                            "layers": {
                                "eeb8024e-a35f-4659-9456-a1984ecbea0b": {
                                    "columns": [
                                        {
                                            "columnId": "values(Gigabytes)",
                                            "fieldName": "values(Gigabytes)",
                                            "inMetricDimension": true,
                                            "meta": {
                                                "esType": "long",
                                                "type": "number"
                                            }
                                        },
                                        {
                                            "columnId": "sum(source.bytes)",
                                            "fieldName": "sum(source.bytes)",
                                            "inMetricDimension": true,
                                            "meta": {
                                                "esType": "long",
                                                "type": "number"
                                            }
                                        },
                                        {
                                            "columnId": "sum(resp_bytes)",
                                            "fieldName": "sum(resp_bytes)",
                                            "inMetricDimension": true,
                                            "meta": {
                                                "esType": "long",
                                                "type": "number"
                                            }
                                        }
                                    ],
                                    "index": "b2bcbb11fd7b30e2a9f2ee93a6a5ffd1f700ee82fff0bfc92dd439c707a35ebb",
                                    "query": {
                                        "esql": "from logs-corelight.various-*\r\n| where event.dataset == \"vpn\"\r\n| limit 10000\r\n| stats sum(source.bytes), sum(resp_bytes) by source.ip, resp_bytes, destination.ip, destination.port, network.transport, network.protocol\r\n| eval Gigabytes=round(((`sum(source.bytes)`+`sum(resp_bytes)`)/1024)/1000,2)\r\n| stats values(Gigabytes) by `sum(source.bytes)`, source.ip, `sum(resp_bytes)`, destination.ip, destination.port, network.transport, network.protocol\r\n| keep `values(Gigabytes)`, `sum(source.bytes)`, `sum(resp_bytes)`"
                                    },
                                    "timeField": "@timestamp"
                                }
                            }
                        }
                    },
                    "filters": [],
                    "query": {
                        "esql": "from logs-corelight.various-*\r\n| where event.dataset == \"vpn\"\r\n| limit 10000\r\n| stats sum(source.bytes), sum(resp_bytes) by source.ip, resp_bytes, destination.ip, destination.port, network.transport, network.protocol\r\n| eval Gigabytes=round(((`sum(source.bytes)`+`sum(resp_bytes)`)/1024)/1000,2)\r\n| stats values(Gigabytes) by `sum(source.bytes)`, source.ip, `sum(resp_bytes)`, destination.ip, destination.port, network.transport, network.protocol\r\n| keep `values(Gigabytes)`, `sum(source.bytes)`, `sum(resp_bytes)`"
                    },
                    "visualization": {
                        "axisTitlesVisibilitySettings": {
                            "x": true,
                            "yLeft": true,
                            "yRight": true
                        },
                        "fittingFunction": "None",
                        "gridlinesVisibilitySettings": {
                            "x": true,
                            "yLeft": true,
                            "yRight": true
                        },
                        "labelsOrientation": {
                            "x": 0,
                            "yLeft": 0,
                            "yRight": 0
                        },
                        "layers": [
                            {
                                "accessors": [
                                    "values(Gigabytes)",
                                    "sum(source.bytes)",
                                    "sum(resp_bytes)"
                                ],
                                "colorMapping": {
                                    "assignments": [],
                                    "colorMode": {
                                        "type": "categorical"
                                    },
                                    "paletteId": "eui_amsterdam_color_blind",
                                    "specialAssignments": [
                                        {
                                            "color": {
                                                "type": "loop"
                                            },
                                            "rule": {
                                                "type": "other"
                                            },
                                            "touched": false
                                        }
                                    ]
                                },
                                "layerId": "eeb8024e-a35f-4659-9456-a1984ecbea0b",
                                "layerType": "data",
                                "seriesType": "bar_stacked"
                            }
                        ],
                        "legend": {
                            "isVisible": true,
                            "position": "right"
                        },
                        "preferredSeriesType": "bar_stacked",
                        "tickLabelsVisibilitySettings": {
                            "x": true,
                            "yLeft": true,
                            "yRight": true
                        },
                        "valueLabels": "hide"
                    }
                },
                "title": "values(Gigabytes) \u0026 sum(source.bytes) \u0026 sum(resp_bytes) of (empty)",
                "visualizationType": "lnsXY"
            },
            "requestData": {
                "dataViewId": "b2bcbb11fd7b30e2a9f2ee93a6a5ffd1f700ee82fff0bfc92dd439c707a35ebb",
                "timeField": "@timestamp"
            },
            "suggestionType": "lensSuggestion"
        }
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2025-01-03T09:56:21.193Z",
    "id": "corelight-86b2a063-fb17-4165-8046-843ff5cf33aa",
    "managed": true,
    "references": [
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.index",
            "type": "index-pattern"
        }
    ],
    "type": "search",
    "typeMigrationVersion": "10.5.0"
}