{
    "attributes": {
        "columns": [
            "@timestamp",
            "sensor_name",
            "tx_host",
            "name",
            "version",
            "version.addl",
            "software_type"
        ],
        "description": "",
        "grid": {},
        "hideChart": false,
        "isTextBasedQuery": true,
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [],
                "index": {
                    "allowHidden": false,
                    "allowNoIndex": false,
                    "fieldFormats": {},
                    "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                    "name": "logs-corelight.various*",
                    "runtimeFieldMap": {},
                    "sourceFilters": [],
                    "timeFieldName": "@timestamp",
                    "title": "logs-corelight.various*",
                    "type": "esql"
                },
                "query": {
                    "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"software\" AND observer.hostname IS NOT NULL AND software.type IS NOT NULL\r\n| LIMIT 10000\r\n| EVAL major = CASE(version.major IS NOT NULL, TO_STRING(version.major),\"\")\r\n| EVAL minor = CASE(software.version.minor IS NOT NULL, CONCAT(\".\",TO_STRING(software.version.minor)),\"\")\r\n| EVAL version = CONCAT(major,minor)\r\n| STATS VALUES(@timestamp) by @timestamp, observer.hostname, host_header, software.name, version, software.version.additional_info, software.type\r\n| RENAME observer.hostname as sensor_name, host_header as tx_host, software.name as name, software.version.additional_info as `version.addl`, software.type as software_type\r\n| KEEP @timestamp, sensor_name, tx_host, name, version, `version.addl`, software_type"
                }
            }
        },
        "sort": [
            [
                "@timestamp",
                "desc"
            ]
        ],
        "timeRestore": false,
        "title": "Software Details [Logs Corelight]",
        "viewMode": "documents",
        "visContext": {}
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2025-01-29T09:46:22.214Z",
    "id": "corelight-af161fed-c80a-4207-9026-0d3c665efe1a",
    "managed": true,
    "references": [],
    "type": "search",
    "typeMigrationVersion": "10.5.0"
}