- name: email.from.address
  type: keyword
- name: email.subject
  type: keyword
- name: email.to.address
  type: keyword
- name: event.category
  type: keyword
- name: event.id
  type: keyword
- name: event.kind
  type: keyword
- name: event.type
  type: keyword
- name: observer.hostname
  type: keyword
- name: os.family
  type: keyword
- name: related.hash
  type: keyword
- name: related.ip
  type: ip
- name: related.user
  type: keyword
- name: threat.indicator.as.number
  type: long
- name: threat.indicator.confidence
  type: keyword
- name: threat.indicator.description
  type: keyword
- name: threat.indicator.email.address
  type: keyword
- name: threat.indicator.file.hash.md5
  type: keyword
- name: threat.indicator.file.hash.sha1
  type: keyword
- name: threat.indicator.file.hash.sha256
  type: keyword
- name: threat.indicator.first_seen
  type: date
- name: threat.indicator.ip
  type: ip
- name: threat.indicator.last_seen
  type: date
- name: threat.indicator.marking.tlp
  type: keyword
- name: threat.indicator.modified_at
  type: date
- name: threat.indicator.reference
  type: keyword
- name: threat.indicator.registry.data.type
  type: keyword
- name: threat.indicator.registry.path
  type: keyword
- name: threat.indicator.registry.value
  type: keyword
- name: threat.indicator.type
  type: keyword
- name: threat.indicator.url.original
  type: keyword
- name: threat.technique.id
  type: keyword
- name: user_agent.original
  type: keyword
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module.
  value: ti_threatconnect
- name: event.dataset
  type: constant_keyword
  description: Event dataset.
  value: ti_threatconnect.indicator
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name.
  value: ThreatConnect Indicator
