- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: ecs.version
- external: ecs
  name: error.message
- external: ecs
  name: event.action
- external: ecs
  name: event.agent_id_status
- external: ecs
  name: event.category
- external: ecs
  name: event.created
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
  type: constant_keyword
  value: alert
- external: ecs
  name: event.original
- external: ecs
  name: event.type
- external: ecs
  name: rule.description
- external: ecs
  name: rule.id
- external: ecs
  name: rule.name
- external: ecs
  name: tags
- external: ecs
  name: message
