- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: '@timestamp'
  type: date
  description: Event timestamp.
- name: event.kind
  type: keyword
  description: Event kind (metric).
- name: event.category
  type: keyword
  description: Event category.
- name: event.type
  type: keyword
  description: Event type.
- name: event.module
  type: keyword
  description: Event module name.
- name: event.dataset
  type: keyword
  description: Event dataset name.
- name: observer.vendor
  type: keyword
  description: Observer vendor name.
  dimension: true
- name: observer.product
  type: keyword
  description: Observer product name.
  dimension: true
- name: observer.type
  type: keyword
  description: Observer type.
  dimension: true
- name: client.ip
  type: ip
  description: Client IP address.
  dimension: true
- name: client.domain
  type: keyword
  description: Client hostname/domain.
  dimension: true
