{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies potential malicious activity by spotting multiple users in an RDP session.\n",
        "language": "kuery",
        "from": "now-10m",
        "interval": "5m",
        "license": "Elastic License",
        "name": "Multiple users identified in an RDP session",
        "query": "process.Ext.authentication_id :* and process.Ext.session_info.client_address:* and host.ip:* and process.Ext.session_info.logon_type:\"RemoteInteractive\"  and event.category :\"process\"",
        "threshold": {"field":["process.Ext.authentication_id"],"value":2,"cardinality":[{"field":"user.name","value":2}]},
        "risk_score": 47,
        "rule_id": "832da588-53eb-459b-8e1f-45d2d4305cec",
        "severity": "medium",
        "tags": [
            "Elastic",
            "Lateral Movement Detection"
        ],
        "type": "threshold",
        "version": 1
    },
    "id": "832da588-53eb-459b-8e1f-45d2d4305cec",
    "type": "security-rule"
}