{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "Identifies the file created by a remote host followed by a malware or intrusion detection event triggered by Elastic Endpoint Security.\n",
        "language": "eql",
        "from": "now-10m",
        "interval": "5m",
        "license": "Elastic License",
        "name": "Malicious Remote File Creation",
        "query": "sequence by host.name\n [file where event.action==\"creation\" and process.name:(\"System\",\"scp\",\"sshd\",\"smbd\",\"vsftpd\",\"sftp-server\")] \n [file where event.category==\"malware\" or event.category==\"intrusion_detection\" and process.name:(\"System\",\"scp\",\"sshd\",\"smbd\",\"vsftpd\",\"sftp-server\")]",
        "risk_score": 99,
        "rule_id": "98789aa2-c22a-4ab4-aa6b-d980073f7ca7",
        "severity": "critical",
        "tags": [
            "Elastic",
            "Lateral Movement Detection",
            "host"
        ],
        "type": "eql",
        "version": 1
    },
    "id": "98789aa2-c22a-4ab4-aa6b-d980073f7ca7",
    "type": "security-rule"
}