- name: "@timestamp"
  type: date
  description: Timestamp for the event.
- name: ecs.version
  type: keyword
  description: ECS version this event adheres to.
- name: event.kind
  type: constant_keyword
  description: High-level kind of the event (e.g. enrichment for threat indicators).
- name: event.category
  type: keyword
  description: Event category (e.g. threat).
- name: event.type
  type: keyword
  description: Event type (e.g. indicator).
- name: input.type
  type: keyword
  description: Type of input that generated the event.
- name: data_stream.namespace
  type: constant_keyword
- name: data_stream.dataset
  type: constant_keyword
- name: data_stream.type
  type: constant_keyword
