- external: ecs
  name: agent.ephemeral_id
- external: ecs
  name: agent.id
- external: ecs
  name: agent.name
- external: ecs
  name: agent.type
- external: ecs
  name: agent.version
- external: ecs
  name: ecs.version
- external: ecs
  name: error.code
- external: ecs
  name: error.id
- external: ecs
  name: error.message
- external: ecs
  name: event.agent_id_status
- external: ecs
  name: event.category
- external: ecs
  name: event.created
  type: date
- external: ecs
  name: event.ingested
  type: date
- external: ecs
  name: event.kind
- external: ecs
  name: event.risk_score
- external: ecs
  name: event.type
- external: ecs
  name: observer.vendor
  type: constant_keyword
  value: Axonius
- external: ecs
  name: related.hash
- external: ecs
  name: vulnerability.description
- external: ecs
  name: vulnerability.id
- external: ecs
  name: vulnerability.reference
- external: ecs
  name: vulnerability.score.base
- external: ecs
  name: vulnerability.score.version
- external: ecs
  name: vulnerability.severity
