- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: error.message
- external: ecs
  name: tags
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.category
- external: ecs
  name: event.type
- external: ecs
  name: event.created
- external: ecs
  name: event.original
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.reference
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.fragment
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.name
- external: ecs
  name: labels
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_abusech
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_abusech.url
- name: threat.feed.name
  type: constant_keyword
  description: Display friendly feed name
  value: AbuseCH URL
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_abusech-c0d8d1f0-3b20-11ec-ae50-2fdf1e96c6a6