{
    "attributes": {
        "controlGroupInput": {
            "chainingSystem": "HIERARCHICAL",
            "controlStyle": "oneLine",
            "ignoreParentSettingsJSON": {
                "ignoreFilters": false,
                "ignoreQuery": false,
                "ignoreTimerange": false,
                "ignoreValidations": false
            },
            "panelsJSON": {
                "4549862d-38df-42ca-b2f8-a6af9513f195": {
                    "explicitInput": {
                        "dataViewId": "logs-*",
                        "fieldName": "observer.hostname",
                        "id": "4549862d-38df-42ca-b2f8-a6af9513f195",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        },
                        "title": "System Name"
                    },
                    "grow": false,
                    "order": 0,
                    "type": "optionsListControl",
                    "width": "medium"
                }
            },
            "showApplySelections": false
        },
        "description": "",
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "observer.vendor",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
                            "key": "observer.vendor",
                            "negate": false,
                            "params": {
                                "query": "Corelight"
                            },
                            "type": "phrase"
                        },
                        "query": {
                            "match_phrase": {
                                "observer.vendor": "Corelight"
                            }
                        }
                    },
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "event.dataset",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
                            "key": "event.dataset",
                            "negate": false,
                            "params": {
                                "query": "rdp"
                            },
                            "type": "phrase"
                        },
                        "query": {
                            "match_phrase": {
                                "event.dataset": "rdp"
                            }
                        }
                    },
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "observer.hostname",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index",
                            "key": "observer.hostname",
                            "negate": false,
                            "type": "exists"
                        },
                        "query": {
                            "exists": {
                                "field": "observer.hostname"
                            }
                        }
                    }
                ],
                "query": {
                    "language": "kuery",
                    "query": ""
                }
            }
        },
        "optionsJSON": {
            "hidePanelTitles": false,
            "syncColors": false,
            "syncCursor": true,
            "syncTooltips": false,
            "useMargins": true
        },
        "panelsJSON": [
            {
                "embeddableConfig": {
                    "description": "",
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "savedVis": {
                        "data": {
                            "aggs": [],
                            "searchSource": {
                                "filter": [],
                                "query": {
                                    "language": "kuery",
                                    "query": ""
                                }
                            }
                        },
                        "description": "",
                        "id": "",
                        "params": {
                            "fontSize": 12,
                            "markdown": "**Navigation**\n\n**Corelight**\n\n- [Security Posture](#/dashboard/corelight-7c0946bc-acd0-4ec3-ab3b-8a92853f4a3b)\n- Data Insights\n  - [Name Resolution Insights](#/dashboard/corelight-8546a96c-86c9-4edf-9d46-88338d6ac40e)\n  - [Secure Channel Insights](#/dashboard/corelight-45197477-c13f-4e52-a5dd-fb4f53564963)\n  - [Remote Activity Insights](#/dashboard/corelight-f4864774-ed73-4b78-b861-5b8235ec12cf)\n- **Security Workflows**\n  - [Intel](#/dashboard/corelight-323b0f27-993e-4fee-ae6e-b5977d7cab11)\n  - [IP Interrogation](#/dashboard/corelight-3a4a279f-f238-47de-90ba-f643c5647fde)\n  - [Log Hunting](#/dashboard/corelight-ff07e65c-2703-4cbe-a45f-3881025352a3)\n  - [Notices](#/dashboard/corelight-f7da14f0-85db-48e8-a591-1f650af0f618)\n  - **RDP Inferences Overview**\n  - [SSH Inferences Overview](#/dashboard/corelight-65a5fa91-06e4-459b-b4bb-998c85a6cf08)\n  - [Corelight Suricata IDS Alert Overview](#/dashboard/corelight-f1208ffe-d168-46d1-9531-24de523d1bfb)\n  - [VPN Insights](#/dashboard/corelight-023162b6-94da-4d8d-b1f6-de6192356cce)\n- Data Explorer\n  - [Connections](#/dashboard/corelight-eff0434c-1e27-4c02-959e-9f5d95488efb)\n  - [DNS](#/dashboard/corelight-58885f47-95e1-4242-a1ee-783de69ace17)\n  - [Files](#/dashboard/corelight-0cfc8a95-4979-4265-b9ad-91edf63f01a9)\n  - [HTTP](#/dashboard/corelight-8c5f15f7-7063-4228-be54-fb8c20b29caa)\n  - [Software](#/dashboard/corelight-40bbc19b-dd9c-4b43-a88a-e29fc8701902)\n  - [SSL and x509](#/dashboard/corelight-e4a93cfe-4b1f-44df-ab99-50c74f6f2203)\n\n[**Integrations Page**](/app/integrations/detail/corelight/overview)",
                            "openLinksInNewTab": false
                        },
                        "title": "",
                        "type": "markdown",
                        "uiState": {}
                    }
                },
                "gridData": {
                    "h": 31,
                    "i": "d2f97fa2-4097-4d1b-9005-b4d68904b985",
                    "w": 12,
                    "x": 0,
                    "y": 0
                },
                "panelIndex": "d2f97fa2-4097-4d1b-9005-b4d68904b985",
                "title": "Table of Contents",
                "type": "visualization"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-5212acf0-6cbf-4a0d-ae00-8289aa08722b",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "5212acf0-6cbf-4a0d-ae00-8289aa08722b": {
                                            "columnOrder": [
                                                "c7d441cd-9c48-4e86-a9b0-16b783c613dd",
                                                "7ce74044-f124-4744-b38a-ef6afe3ad539"
                                            ],
                                            "columns": {
                                                "7ce74044-f124-4744-b38a-ef6afe3ad539": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Count",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                },
                                                "c7d441cd-9c48-4e86-a9b0-16b783c613dd": {
                                                    "customLabel": true,
                                                    "dataType": "string",
                                                    "isBucketed": true,
                                                    "label": "Inferences",
                                                    "operationType": "terms",
                                                    "params": {
                                                        "exclude": [],
                                                        "excludeIsRegex": false,
                                                        "include": [],
                                                        "includeIsRegex": false,
                                                        "missingBucket": false,
                                                        "orderBy": {
                                                            "columnId": "7ce74044-f124-4744-b38a-ef6afe3ad539",
                                                            "type": "column"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "size": 5
                                                    },
                                                    "scale": "ordinal",
                                                    "sourceField": "rdp.inferences"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [
                                {
                                    "$state": {
                                        "store": "appState"
                                    },
                                    "meta": {
                                        "alias": null,
                                        "disabled": false,
                                        "field": "rdp.inferences",
                                        "index": "38b48857-aa90-41ed-93b7-06b52ae53421",
                                        "key": "rdp.inferences",
                                        "negate": false,
                                        "type": "exists",
                                        "value": "exists"
                                    },
                                    "query": {
                                        "exists": {
                                            "field": "rdp.inferences"
                                        }
                                    }
                                }
                            ],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layers": [
                                    {
                                        "categoryDisplay": "default",
                                        "colorMapping": {
                                            "assignments": [],
                                            "colorMode": {
                                                "type": "categorical"
                                            },
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "specialAssignments": [
                                                {
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "touched": false
                                                }
                                            ]
                                        },
                                        "layerId": "5212acf0-6cbf-4a0d-ae00-8289aa08722b",
                                        "layerType": "data",
                                        "legendDisplay": "show",
                                        "metrics": [
                                            "7ce74044-f124-4744-b38a-ef6afe3ad539"
                                        ],
                                        "nestedLegend": false,
                                        "numberDisplay": "percent",
                                        "primaryGroups": [
                                            "c7d441cd-9c48-4e86-a9b0-16b783c613dd"
                                        ],
                                        "truncateLegend": false
                                    }
                                ],
                                "shape": "pie"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsPie"
                    },
                    "enhancements": {}
                },
                "gridData": {
                    "h": 17,
                    "i": "fce0a642-e5ca-4aa5-841a-fa38a93f295f",
                    "w": 13,
                    "x": 12,
                    "y": 0
                },
                "panelIndex": "fce0a642-e5ca-4aa5-841a-fa38a93f295f",
                "title": "Name [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-f9342a24-0b82-4e05-bef0-cc4dfeb4ef0b",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "f9342a24-0b82-4e05-bef0-cc4dfeb4ef0b": {
                                            "columnOrder": [
                                                "cb9a0681-8d59-4c88-89d2-eafa8f2ebd9e",
                                                "e0990fd1-93c9-4a64-b260-7663b78acd95",
                                                "85d7c11c-fd72-46a3-bc66-d9091f88a98a"
                                            ],
                                            "columns": {
                                                "85d7c11c-fd72-46a3-bc66-d9091f88a98a": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Count",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                },
                                                "cb9a0681-8d59-4c88-89d2-eafa8f2ebd9e": {
                                                    "customLabel": true,
                                                    "dataType": "string",
                                                    "isBucketed": true,
                                                    "label": "Inferences",
                                                    "operationType": "terms",
                                                    "params": {
                                                        "exclude": [],
                                                        "excludeIsRegex": false,
                                                        "include": [],
                                                        "includeIsRegex": false,
                                                        "missingBucket": false,
                                                        "orderBy": {
                                                            "columnId": "85d7c11c-fd72-46a3-bc66-d9091f88a98a",
                                                            "type": "column"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "size": 10
                                                    },
                                                    "scale": "ordinal",
                                                    "sourceField": "rdp.inferences"
                                                },
                                                "e0990fd1-93c9-4a64-b260-7663b78acd95": {
                                                    "customLabel": false,
                                                    "dataType": "date",
                                                    "isBucketed": true,
                                                    "label": "@timestamp",
                                                    "operationType": "date_histogram",
                                                    "params": {
                                                        "dropPartials": false,
                                                        "includeEmptyRows": true,
                                                        "interval": "d"
                                                    },
                                                    "scale": "interval",
                                                    "sourceField": "@timestamp"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [
                                {
                                    "$state": {
                                        "store": "appState"
                                    },
                                    "meta": {
                                        "alias": null,
                                        "disabled": false,
                                        "field": "rdp.inferences",
                                        "index": "74d33498-ad3c-4061-83e9-97d60b11ae59",
                                        "key": "rdp.inferences",
                                        "negate": false,
                                        "type": "exists",
                                        "value": "exists"
                                    },
                                    "query": {
                                        "exists": {
                                            "field": "rdp.inferences"
                                        }
                                    }
                                }
                            ],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layers": [
                                    {
                                        "accessors": [
                                            "85d7c11c-fd72-46a3-bc66-d9091f88a98a"
                                        ],
                                        "colorMapping": {
                                            "assignments": [],
                                            "colorMode": {
                                                "type": "categorical"
                                            },
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "specialAssignments": [
                                                {
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "touched": false
                                                }
                                            ]
                                        },
                                        "layerId": "f9342a24-0b82-4e05-bef0-cc4dfeb4ef0b",
                                        "layerType": "data",
                                        "position": "top",
                                        "seriesType": "area",
                                        "showGridlines": false,
                                        "splitAccessor": "cb9a0681-8d59-4c88-89d2-eafa8f2ebd9e",
                                        "xAccessor": "e0990fd1-93c9-4a64-b260-7663b78acd95"
                                    }
                                ],
                                "legend": {
                                    "isVisible": true,
                                    "position": "right"
                                },
                                "preferredSeriesType": "area",
                                "title": "Empty XY chart",
                                "valueLabels": "hide"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsXY"
                    },
                    "enhancements": {}
                },
                "gridData": {
                    "h": 17,
                    "i": "22b3bd4a-c26f-47c8-8dce-24e85b981c72",
                    "w": 23,
                    "x": 25,
                    "y": 0
                },
                "panelIndex": "22b3bd4a-c26f-47c8-8dce-24e85b981c72",
                "title": "Inferences Over Time [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-bb0cb585-16de-4f4a-954a-ac367e87ddc3",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "bb0cb585-16de-4f4a-954a-ac367e87ddc3": {
                                            "columnOrder": [
                                                "716ba611-07bc-4a4a-a5d2-127499d85c24"
                                            ],
                                            "columns": {
                                                "716ba611-07bc-4a4a-a5d2-127499d85c24": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Successful Connections",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [
                                {
                                    "$state": {
                                        "store": "appState"
                                    },
                                    "meta": {
                                        "alias": null,
                                        "disabled": false,
                                        "field": "event.outcome",
                                        "index": "766034d0-3457-4fe8-b949-3de62b0df69f",
                                        "key": "event.outcome",
                                        "negate": false,
                                        "params": {
                                            "query": "success"
                                        },
                                        "type": "phrase"
                                    },
                                    "query": {
                                        "match_phrase": {
                                            "event.outcome": "success"
                                        }
                                    }
                                }
                            ],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layerId": "bb0cb585-16de-4f4a-954a-ac367e87ddc3",
                                "layerType": "data",
                                "metricAccessor": "716ba611-07bc-4a4a-a5d2-127499d85c24"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsMetric"
                    },
                    "enhancements": {},
                    "hidePanelTitles": true
                },
                "gridData": {
                    "h": 14,
                    "i": "eb906ed3-6f4d-484d-ac0c-21e6059fd46e",
                    "w": 9,
                    "x": 12,
                    "y": 17
                },
                "panelIndex": "eb906ed3-6f4d-484d-ac0c-21e6059fd46e",
                "title": "Successful Connections [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-bb0cb585-16de-4f4a-954a-ac367e87ddc3",
                                "type": "index-pattern"
                            },
                            {
                                "id": "logs-*",
                                "name": "4c7c1b52-814d-4f0b-9f0c-1b3d01485d96",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "layers": {
                                        "bb0cb585-16de-4f4a-954a-ac367e87ddc3": {
                                            "columnOrder": [
                                                "716ba611-07bc-4a4a-a5d2-127499d85c24"
                                            ],
                                            "columns": {
                                                "716ba611-07bc-4a4a-a5d2-127499d85c24": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Failed Connections",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [
                                {
                                    "$state": {
                                        "store": "appState"
                                    },
                                    "meta": {
                                        "alias": null,
                                        "disabled": false,
                                        "field": "event.outcome",
                                        "index": "4c7c1b52-814d-4f0b-9f0c-1b3d01485d96",
                                        "key": "event.outcome",
                                        "negate": true,
                                        "params": {
                                            "query": "success"
                                        },
                                        "type": "phrase"
                                    },
                                    "query": {
                                        "match_phrase": {
                                            "event.outcome": "success"
                                        }
                                    }
                                }
                            ],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layerId": "bb0cb585-16de-4f4a-954a-ac367e87ddc3",
                                "layerType": "data",
                                "metricAccessor": "716ba611-07bc-4a4a-a5d2-127499d85c24"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsMetric"
                    },
                    "enhancements": {},
                    "hidePanelTitles": true
                },
                "gridData": {
                    "h": 14,
                    "i": "0de12422-f909-4a08-8b23-f322a7f4fb40",
                    "w": 8,
                    "x": 21,
                    "y": 17
                },
                "panelIndex": "0de12422-f909-4a08-8b23-f322a7f4fb40",
                "title": "Failed Connections [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [],
                        "state": {
                            "adHocDataViews": {
                                "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d": {
                                    "allowHidden": false,
                                    "allowNoIndex": false,
                                    "fieldFormats": {},
                                    "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                    "name": "logs-corelight.various*",
                                    "runtimeFieldMap": {},
                                    "sourceFilters": [],
                                    "timeFieldName": "@timestamp",
                                    "title": "logs-corelight.various*",
                                    "type": "esql"
                                }
                            },
                            "datasourceStates": {
                                "textBased": {
                                    "indexPatternRefs": [
                                        {
                                            "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                            "timeField": "@timestamp",
                                            "title": "logs-corelight.various*"
                                        }
                                    ],
                                    "layers": {
                                        "4a57b7d0-52ce-413a-a051-a994d7d226b2": {
                                            "columns": [
                                                {
                                                    "columnId": "Connecting User",
                                                    "fieldName": "Connecting User",
                                                    "meta": {
                                                        "esType": "keyword",
                                                        "type": "string"
                                                    }
                                                },
                                                {
                                                    "columnId": "Auth Success",
                                                    "fieldName": "Auth Success",
                                                    "meta": {
                                                        "esType": "keyword",
                                                        "type": "string"
                                                    }
                                                },
                                                {
                                                    "columnId": "Count",
                                                    "fieldName": "Count",
                                                    "inMetricDimension": true,
                                                    "meta": {
                                                        "esType": "long",
                                                        "type": "number"
                                                    }
                                                }
                                            ],
                                            "index": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                            "query": {
                                                "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"rdp\" and observer.hostname IS NOT NULL and rdp.cookie IS NOT NULL and event.outcome IS NOT NULL\r\n| LIMIT 10000\r\n| STATS  COUNT() by rdp.cookie, event.outcome \r\n| RENAME rdp.cookie as `Connecting User`, event.outcome as `Auth Success`, `COUNT()` as Count  \r\n| SORT Count DESC\r\n| LIMIT 20\r\n| KEEP `Connecting User`, `Auth Success`, Count"
                                            },
                                            "timeField": "@timestamp"
                                        }
                                    }
                                }
                            },
                            "filters": [],
                            "query": {
                                "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"rdp\" and observer.hostname IS NOT NULL and rdp.cookie IS NOT NULL and event.outcome IS NOT NULL\r\n| LIMIT 10000\r\n| STATS  COUNT() by rdp.cookie, event.outcome \r\n| RENAME rdp.cookie as `Connecting User`, event.outcome as `Auth Success`, `COUNT()` as Count  \r\n| SORT Count DESC\r\n| LIMIT 20\r\n| KEEP `Connecting User`, `Auth Success`, Count"
                            },
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "Connecting User"
                                    },
                                    {
                                        "columnId": "Auth Success"
                                    },
                                    {
                                        "columnId": "Count"
                                    }
                                ],
                                "layerId": "4a57b7d0-52ce-413a-a051-a994d7d226b2",
                                "layerType": "data",
                                "paging": {
                                    "enabled": true,
                                    "size": 10
                                }
                            }
                        },
                        "title": "Bar vertical stacked",
                        "type": "lens",
                        "visualizationType": "lnsDatatable"
                    },
                    "disabledActions": [
                        "OPEN_FLYOUT_ADD_DRILLDOWN"
                    ],
                    "enhancements": {}
                },
                "gridData": {
                    "h": 14,
                    "i": "2c3b9606-9969-41c2-b60a-4fd1ffdbf59f",
                    "w": 19,
                    "x": 29,
                    "y": 17
                },
                "panelIndex": "2c3b9606-9969-41c2-b60a-4fd1ffdbf59f",
                "title": "Connecting Users [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-5e7594d6-65c3-435a-9c8a-9580d59073a4",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "5e7594d6-65c3-435a-9c8a-9580d59073a4": {
                                            "columnOrder": [
                                                "87b806a2-209f-47f0-8759-2e192703ae6f",
                                                "c7c24143-d8a9-444c-911a-258cb64b1c1c"
                                            ],
                                            "columns": {
                                                "87b806a2-209f-47f0-8759-2e192703ae6f": {
                                                    "customLabel": true,
                                                    "dataType": "string",
                                                    "isBucketed": true,
                                                    "label": "Security Protocol",
                                                    "operationType": "terms",
                                                    "params": {
                                                        "exclude": [],
                                                        "excludeIsRegex": false,
                                                        "include": [],
                                                        "includeIsRegex": false,
                                                        "missingBucket": false,
                                                        "orderBy": {
                                                            "columnId": "c7c24143-d8a9-444c-911a-258cb64b1c1c",
                                                            "type": "column"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": true,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "size": 5
                                                    },
                                                    "scale": "ordinal",
                                                    "sourceField": "rdp.selected_protocol"
                                                },
                                                "c7c24143-d8a9-444c-911a-258cb64b1c1c": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Count",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layers": [
                                    {
                                        "categoryDisplay": "default",
                                        "colorMapping": {
                                            "assignments": [],
                                            "colorMode": {
                                                "type": "categorical"
                                            },
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "specialAssignments": [
                                                {
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "touched": false
                                                }
                                            ]
                                        },
                                        "layerId": "5e7594d6-65c3-435a-9c8a-9580d59073a4",
                                        "layerType": "data",
                                        "legendDisplay": "show",
                                        "metrics": [
                                            "c7c24143-d8a9-444c-911a-258cb64b1c1c"
                                        ],
                                        "nestedLegend": false,
                                        "numberDisplay": "percent",
                                        "primaryGroups": [
                                            "87b806a2-209f-47f0-8759-2e192703ae6f"
                                        ],
                                        "truncateLegend": false
                                    }
                                ],
                                "shape": "pie"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsPie"
                    },
                    "enhancements": {}
                },
                "gridData": {
                    "h": 14,
                    "i": "25ce784b-8edd-4b9c-8f2f-1e9d6ce76969",
                    "w": 48,
                    "x": 0,
                    "y": 31
                },
                "panelIndex": "25ce784b-8edd-4b9c-8f2f-1e9d6ce76969",
                "title": "Security Protocols Used [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "description": "",
                    "enhancements": {},
                    "rowsPerPage": 10
                },
                "gridData": {
                    "h": 29,
                    "i": "957528ec-d710-45a9-ad1c-fe0ad6e805be",
                    "w": 48,
                    "x": 0,
                    "y": 45
                },
                "panelIndex": "957528ec-d710-45a9-ad1c-fe0ad6e805be",
                "panelRefName": "panel_957528ec-d710-45a9-ad1c-fe0ad6e805be",
                "title": "RDP Connection Detail [Logs Corelight]",
                "type": "search"
            }
        ],
        "timeRestore": false,
        "title": "[Logs Corelight] RDP Inferences Overview",
        "version": 2
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2025-01-30T10:09:36.577Z",
    "id": "corelight-2d4dc345-cbbe-4d7a-9203-5ab11c8cb5ba",
    "managed": false,
    "references": [
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "fce0a642-e5ca-4aa5-841a-fa38a93f295f:indexpattern-datasource-layer-5212acf0-6cbf-4a0d-ae00-8289aa08722b",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "22b3bd4a-c26f-47c8-8dce-24e85b981c72:indexpattern-datasource-layer-f9342a24-0b82-4e05-bef0-cc4dfeb4ef0b",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "eb906ed3-6f4d-484d-ac0c-21e6059fd46e:indexpattern-datasource-layer-bb0cb585-16de-4f4a-954a-ac367e87ddc3",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "0de12422-f909-4a08-8b23-f322a7f4fb40:indexpattern-datasource-layer-bb0cb585-16de-4f4a-954a-ac367e87ddc3",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "0de12422-f909-4a08-8b23-f322a7f4fb40:4c7c1b52-814d-4f0b-9f0c-1b3d01485d96",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "25ce784b-8edd-4b9c-8f2f-1e9d6ce76969:indexpattern-datasource-layer-5e7594d6-65c3-435a-9c8a-9580d59073a4",
            "type": "index-pattern"
        },
        {
            "id": "corelight-039807c4-9ec2-4778-b548-0e08877fb8d2",
            "name": "957528ec-d710-45a9-ad1c-fe0ad6e805be:panel_957528ec-d710-45a9-ad1c-fe0ad6e805be",
            "type": "search"
        },
        {
            "id": "logs-*",
            "name": "controlGroup_4549862d-38df-42ca-b2f8-a6af9513f195:optionsListDataView",
            "type": "index-pattern"
        }
    ],
    "type": "dashboard",
    "typeMigrationVersion": "10.2.0",
    "updated_by": "u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0"
}