{
    "attributes": {
        "controlGroupInput": {
            "chainingSystem": "HIERARCHICAL",
            "controlStyle": "oneLine",
            "ignoreParentSettingsJSON": {
                "ignoreFilters": false,
                "ignoreQuery": false,
                "ignoreTimerange": false,
                "ignoreValidations": false
            },
            "panelsJSON": {
                "33b707fd-5632-45e4-adde-3726f43184ac": {
                    "explicitInput": {
                        "dataViewId": "logs-*",
                        "fieldName": "software.type",
                        "id": "33b707fd-5632-45e4-adde-3726f43184ac",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        },
                        "title": "Software Type"
                    },
                    "grow": false,
                    "order": 1,
                    "type": "optionsListControl",
                    "width": "medium"
                },
                "611612e4-c8a9-4e1a-a860-6069ae0f6eb6": {
                    "explicitInput": {
                        "dataViewId": "logs-*",
                        "fieldName": "observer.hostname",
                        "id": "611612e4-c8a9-4e1a-a860-6069ae0f6eb6",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        },
                        "title": "Corelight Sensor"
                    },
                    "grow": false,
                    "order": 0,
                    "type": "optionsListControl",
                    "width": "medium"
                },
                "7599eabd-b77e-4d04-b8e8-8b228997098a": {
                    "explicitInput": {
                        "dataViewId": "logs-*",
                        "fieldName": "software.name",
                        "id": "7599eabd-b77e-4d04-b8e8-8b228997098a",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        },
                        "title": "Software"
                    },
                    "grow": true,
                    "order": 2,
                    "type": "optionsListControl",
                    "width": "medium"
                },
                "97e450fd-b2c6-4502-aa23-4e5b0e032455": {
                    "explicitInput": {
                        "dataViewId": "logs-*",
                        "exclude": false,
                        "existsSelected": false,
                        "fieldName": "host_header",
                        "id": "97e450fd-b2c6-4502-aa23-4e5b0e032455",
                        "searchTechnique": "prefix",
                        "selectedOptions": [],
                        "sort": {
                            "by": "_count",
                            "direction": "desc"
                        },
                        "title": "Host"
                    },
                    "grow": true,
                    "order": 3,
                    "type": "optionsListControl",
                    "width": "medium"
                }
            },
            "showApplySelections": false
        },
        "description": "",
        "kibanaSavedObjectMeta": {
            "searchSourceJSON": {
                "filter": [
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "observer.vendor",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
                            "key": "observer.vendor",
                            "negate": false,
                            "params": {
                                "query": "Corelight"
                            },
                            "type": "phrase"
                        },
                        "query": {
                            "match_phrase": {
                                "observer.vendor": "Corelight"
                            }
                        }
                    },
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "event.dataset",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
                            "key": "event.dataset",
                            "negate": false,
                            "params": {
                                "query": "software"
                            },
                            "type": "phrase"
                        },
                        "query": {
                            "match_phrase": {
                                "event.dataset": "software"
                            }
                        }
                    },
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "observer.hostname",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index",
                            "key": "observer.hostname",
                            "negate": false,
                            "type": "exists"
                        },
                        "query": {
                            "exists": {
                                "field": "observer.hostname"
                            }
                        }
                    },
                    {
                        "$state": {
                            "store": "appState"
                        },
                        "meta": {
                            "alias": null,
                            "disabled": false,
                            "field": "software.type",
                            "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[3].meta.index",
                            "key": "software.type",
                            "negate": false,
                            "type": "exists"
                        },
                        "query": {
                            "exists": {
                                "field": "software.type"
                            }
                        }
                    }
                ],
                "query": {
                    "language": "kuery",
                    "query": ""
                }
            }
        },
        "optionsJSON": {
            "hidePanelTitles": false,
            "syncColors": false,
            "syncCursor": true,
            "syncTooltips": false,
            "useMargins": true
        },
        "panelsJSON": [
            {
                "embeddableConfig": {
                    "description": "",
                    "enhancements": {
                        "dynamicActions": {
                            "events": []
                        }
                    },
                    "savedVis": {
                        "data": {
                            "aggs": [],
                            "searchSource": {
                                "filter": [],
                                "query": {
                                    "language": "kuery",
                                    "query": ""
                                }
                            }
                        },
                        "description": "",
                        "id": "",
                        "params": {
                            "fontSize": 12,
                            "markdown": "**Navigation**\n\n**Corelight**\n\n- [Security Posture](#/dashboard/corelight-7c0946bc-acd0-4ec3-ab3b-8a92853f4a3b)\n- Data Insights\n  - [Name Resolution Insights](#/dashboard/corelight-8546a96c-86c9-4edf-9d46-88338d6ac40e)\n  - [Secure Channel Insights](#/dashboard/corelight-45197477-c13f-4e52-a5dd-fb4f53564963)\n  - [Remote Activity Insights](#/dashboard/corelight-f4864774-ed73-4b78-b861-5b8235ec12cf)\n- Security Workflows\n  - [Intel](#/dashboard/corelight-323b0f27-993e-4fee-ae6e-b5977d7cab11)\n  - [IP Interrogation](#/dashboard/corelight-3a4a279f-f238-47de-90ba-f643c5647fde)\n  - [Log Hunting](#/dashboard/corelight-ff07e65c-2703-4cbe-a45f-3881025352a3)\n  - [Notices](#/dashboard/corelight-f7da14f0-85db-48e8-a591-1f650af0f618)\n  - [RDP Inferences Overview](#/dashboard/corelight-2d4dc345-cbbe-4d7a-9203-5ab11c8cb5ba)\n  - [SSH Inferences Overview](#/dashboard/corelight-65a5fa91-06e4-459b-b4bb-998c85a6cf08)\n  - [Corelight Suricata IDS Alert Overview](#/dashboard/corelight-f1208ffe-d168-46d1-9531-24de523d1bfb)\n  - [VPN Insights](#/dashboard/corelight-023162b6-94da-4d8d-b1f6-de6192356cce)\n- **Data Explorer**\n  - [Connections](#/dashboard/corelight-eff0434c-1e27-4c02-959e-9f5d95488efb)\n  - [DNS](#/dashboard/corelight-58885f47-95e1-4242-a1ee-783de69ace17)\n  - [Files](#/dashboard/corelight-0cfc8a95-4979-4265-b9ad-91edf63f01a9)\n  - [HTTP](#/dashboard/corelight-8c5f15f7-7063-4228-be54-fb8c20b29caa)\n  - **Software**\n  - [SSL and x509](#/dashboard/corelight-e4a93cfe-4b1f-44df-ab99-50c74f6f2203)\n\n[**Integrations Page**](/app/integrations/detail/corelight/overview)",
                            "openLinksInNewTab": false
                        },
                        "title": "",
                        "type": "markdown",
                        "uiState": {}
                    }
                },
                "gridData": {
                    "h": 33,
                    "i": "989ee941-76b5-48c3-83f7-bd38138ad760",
                    "w": 12,
                    "x": 0,
                    "y": 0
                },
                "panelIndex": "989ee941-76b5-48c3-83f7-bd38138ad760",
                "title": "Table of Contents",
                "type": "visualization"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-8464528f-193e-4f3b-9cd6-5841fd337567",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "8464528f-193e-4f3b-9cd6-5841fd337567": {
                                            "columnOrder": [
                                                "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638",
                                                "ab35b7c2-b46b-45f6-96d7-a35f245444a4"
                                            ],
                                            "columns": {
                                                "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638": {
                                                    "customLabel": true,
                                                    "dataType": "string",
                                                    "isBucketed": true,
                                                    "label": "Name",
                                                    "operationType": "terms",
                                                    "params": {
                                                        "exclude": [],
                                                        "excludeIsRegex": false,
                                                        "include": [],
                                                        "includeIsRegex": false,
                                                        "missingBucket": false,
                                                        "orderBy": {
                                                            "columnId": "ab35b7c2-b46b-45f6-96d7-a35f245444a4",
                                                            "type": "column"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "secondaryFields": [],
                                                        "size": 10
                                                    },
                                                    "scale": "ordinal",
                                                    "sourceField": "software.name"
                                                },
                                                "ab35b7c2-b46b-45f6-96d7-a35f245444a4": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Count",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "layers": [
                                    {
                                        "categoryDisplay": "default",
                                        "colorMapping": {
                                            "assignments": [],
                                            "colorMode": {
                                                "type": "categorical"
                                            },
                                            "paletteId": "eui_amsterdam_color_blind",
                                            "specialAssignments": [
                                                {
                                                    "color": {
                                                        "type": "loop"
                                                    },
                                                    "rule": {
                                                        "type": "other"
                                                    },
                                                    "touched": false
                                                }
                                            ]
                                        },
                                        "layerId": "8464528f-193e-4f3b-9cd6-5841fd337567",
                                        "layerType": "data",
                                        "legendDisplay": "show",
                                        "metrics": [
                                            "ab35b7c2-b46b-45f6-96d7-a35f245444a4"
                                        ],
                                        "nestedLegend": false,
                                        "numberDisplay": "percent",
                                        "primaryGroups": [
                                            "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638"
                                        ],
                                        "truncateLegend": false
                                    }
                                ],
                                "shape": "pie"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsPie"
                    },
                    "enhancements": {}
                },
                "gridData": {
                    "h": 16,
                    "i": "0075eb75-678b-42d3-9fb8-1c4aa3799392",
                    "w": 16,
                    "x": 12,
                    "y": 0
                },
                "panelIndex": "0075eb75-678b-42d3-9fb8-1c4aa3799392",
                "title": "Top Software [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [],
                        "state": {
                            "adHocDataViews": {
                                "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d": {
                                    "allowHidden": false,
                                    "allowNoIndex": false,
                                    "fieldFormats": {},
                                    "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                    "name": "logs-corelight.various*",
                                    "runtimeFieldMap": {},
                                    "sourceFilters": [],
                                    "timeFieldName": "@timestamp",
                                    "title": "logs-corelight.various*",
                                    "type": "esql"
                                }
                            },
                            "datasourceStates": {
                                "textBased": {
                                    "indexPatternRefs": [
                                        {
                                            "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                            "timeField": "@timestamp",
                                            "title": "logs-corelight.various*"
                                        }
                                    ],
                                    "layers": {
                                        "6331a013-0e0d-4418-a8f9-a624a5b2b16b": {
                                            "columns": [
                                                {
                                                    "columnId": "Name",
                                                    "fieldName": "Name",
                                                    "meta": {
                                                        "esType": "keyword",
                                                        "type": "string"
                                                    }
                                                },
                                                {
                                                    "columnId": "Version",
                                                    "fieldName": "Version",
                                                    "meta": {
                                                        "esType": "keyword",
                                                        "type": "string"
                                                    }
                                                },
                                                {
                                                    "columnId": "Count",
                                                    "fieldName": "Count",
                                                    "inMetricDimension": true,
                                                    "meta": {
                                                        "esType": "long",
                                                        "type": "number"
                                                    }
                                                }
                                            ],
                                            "index": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                                            "query": {
                                                "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"software\" AND observer.hostname IS NOT NULL AND software.type IS NOT NULL\r\n| LIMIT 10000\r\n| EVAL major = CASE(version.major IS NOT NULL, TO_STRING(version.major),\"\")\r\n| EVAL minor = CASE(software.version.minor IS NOT NULL, CONCAT(\".\",TO_STRING(software.version.minor)),\"\")\r\n| EVAL Version = CONCAT(major,minor)\r\n| STATS COUNT() BY software.name, Version\r\n| RENAME `COUNT()` as Count, software.name as Name\r\n| SORT Count desc\r\n| LIMIT 10\r\n| KEEP Name, Version, Count\r\n"
                                            },
                                            "timeField": "@timestamp"
                                        }
                                    }
                                }
                            },
                            "filters": [],
                            "query": {
                                "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"software\" AND observer.hostname IS NOT NULL AND software.type IS NOT NULL\r\n| LIMIT 10000\r\n| EVAL major = CASE(version.major IS NOT NULL, TO_STRING(version.major),\"\")\r\n| EVAL minor = CASE(software.version.minor IS NOT NULL, CONCAT(\".\",TO_STRING(software.version.minor)),\"\")\r\n| EVAL Version = CONCAT(major,minor)\r\n| STATS COUNT() BY software.name, Version\r\n| RENAME `COUNT()` as Count, software.name as Name\r\n| SORT Count desc\r\n| LIMIT 10\r\n| KEEP Name, Version, Count\r\n"
                            },
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "Name"
                                    },
                                    {
                                        "columnId": "Version"
                                    },
                                    {
                                        "columnId": "Count"
                                    }
                                ],
                                "layerId": "6331a013-0e0d-4418-a8f9-a624a5b2b16b",
                                "layerType": "data"
                            }
                        },
                        "title": "Bar vertical stacked",
                        "type": "lens",
                        "visualizationType": "lnsDatatable"
                    },
                    "disabledActions": [
                        "OPEN_FLYOUT_ADD_DRILLDOWN"
                    ],
                    "enhancements": {}
                },
                "gridData": {
                    "h": 16,
                    "i": "376f2059-7cb4-46e9-954d-bd33c4e2ddb1",
                    "w": 20,
                    "x": 28,
                    "y": 0
                },
                "panelIndex": "376f2059-7cb4-46e9-954d-bd33c4e2ddb1",
                "title": "Top Software Versions [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "attributes": {
                        "references": [
                            {
                                "id": "logs-*",
                                "name": "indexpattern-datasource-layer-8464528f-193e-4f3b-9cd6-5841fd337567",
                                "type": "index-pattern"
                            }
                        ],
                        "state": {
                            "adHocDataViews": {},
                            "datasourceStates": {
                                "formBased": {
                                    "currentIndexPatternId": "logs-*",
                                    "layers": {
                                        "8464528f-193e-4f3b-9cd6-5841fd337567": {
                                            "columnOrder": [
                                                "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638",
                                                "ab35b7c2-b46b-45f6-96d7-a35f245444a4"
                                            ],
                                            "columns": {
                                                "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638": {
                                                    "customLabel": true,
                                                    "dataType": "string",
                                                    "isBucketed": true,
                                                    "label": "Software Type",
                                                    "operationType": "terms",
                                                    "params": {
                                                        "exclude": [],
                                                        "excludeIsRegex": false,
                                                        "include": [],
                                                        "includeIsRegex": false,
                                                        "missingBucket": false,
                                                        "orderBy": {
                                                            "columnId": "ab35b7c2-b46b-45f6-96d7-a35f245444a4",
                                                            "type": "column"
                                                        },
                                                        "orderDirection": "desc",
                                                        "otherBucket": false,
                                                        "parentFormat": {
                                                            "id": "terms"
                                                        },
                                                        "secondaryFields": [],
                                                        "size": 10
                                                    },
                                                    "scale": "ordinal",
                                                    "sourceField": "software.type"
                                                },
                                                "ab35b7c2-b46b-45f6-96d7-a35f245444a4": {
                                                    "customLabel": true,
                                                    "dataType": "number",
                                                    "isBucketed": false,
                                                    "label": "Count",
                                                    "operationType": "count",
                                                    "params": {
                                                        "emptyAsNull": false,
                                                        "format": {
                                                            "id": "number",
                                                            "params": {
                                                                "decimals": 0
                                                            }
                                                        }
                                                    },
                                                    "scale": "ratio",
                                                    "sourceField": "___records___"
                                                }
                                            },
                                            "ignoreGlobalFilters": false,
                                            "incompleteColumns": {},
                                            "indexPatternId": "logs-*",
                                            "sampling": 1
                                        }
                                    }
                                },
                                "indexpattern": {
                                    "layers": {}
                                },
                                "textBased": {
                                    "layers": {}
                                }
                            },
                            "filters": [],
                            "internalReferences": [],
                            "query": {
                                "language": "kuery",
                                "query": ""
                            },
                            "visualization": {
                                "columns": [
                                    {
                                        "columnId": "a2de1a5a-fe8b-4493-b6e3-39a8bec0f638"
                                    },
                                    {
                                        "columnId": "ab35b7c2-b46b-45f6-96d7-a35f245444a4"
                                    }
                                ],
                                "layerId": "8464528f-193e-4f3b-9cd6-5841fd337567",
                                "layerType": "data"
                            }
                        },
                        "title": "",
                        "type": "lens",
                        "visualizationType": "lnsDatatable"
                    },
                    "enhancements": {}
                },
                "gridData": {
                    "h": 17,
                    "i": "e1efe476-2256-4262-af95-40cb2311cea1",
                    "w": 36,
                    "x": 12,
                    "y": 16
                },
                "panelIndex": "e1efe476-2256-4262-af95-40cb2311cea1",
                "title": "Top Software Types [Logs Corelight]",
                "type": "lens"
            },
            {
                "embeddableConfig": {
                    "description": "",
                    "enhancements": {},
                    "rowsPerPage": 10
                },
                "gridData": {
                    "h": 29,
                    "i": "61d50e7c-6cd9-4b07-a60a-6f7f2b8b0be8",
                    "w": 48,
                    "x": 0,
                    "y": 33
                },
                "panelIndex": "61d50e7c-6cd9-4b07-a60a-6f7f2b8b0be8",
                "panelRefName": "panel_61d50e7c-6cd9-4b07-a60a-6f7f2b8b0be8",
                "title": "Software Details [Logs Corelight]",
                "type": "search"
            }
        ],
        "timeRestore": false,
        "title": "[Logs Corelight] Software",
        "version": 2
    },
    "coreMigrationVersion": "8.8.0",
    "created_at": "2025-01-30T09:51:23.302Z",
    "id": "corelight-40bbc19b-dd9c-4b43-a88a-e29fc8701902",
    "managed": false,
    "references": [
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[2].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[3].meta.index",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "0075eb75-678b-42d3-9fb8-1c4aa3799392:indexpattern-datasource-layer-8464528f-193e-4f3b-9cd6-5841fd337567",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "e1efe476-2256-4262-af95-40cb2311cea1:indexpattern-datasource-layer-8464528f-193e-4f3b-9cd6-5841fd337567",
            "type": "index-pattern"
        },
        {
            "id": "corelight-34498312-f418-4e47-9931-bc5fc46c0bff",
            "name": "61d50e7c-6cd9-4b07-a60a-6f7f2b8b0be8:panel_61d50e7c-6cd9-4b07-a60a-6f7f2b8b0be8",
            "type": "search"
        },
        {
            "id": "logs-*",
            "name": "controlGroup_611612e4-c8a9-4e1a-a860-6069ae0f6eb6:optionsListDataView",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "controlGroup_33b707fd-5632-45e4-adde-3726f43184ac:optionsListDataView",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "controlGroup_7599eabd-b77e-4d04-b8e8-8b228997098a:optionsListDataView",
            "type": "index-pattern"
        },
        {
            "id": "logs-*",
            "name": "controlGroup_97e450fd-b2c6-4502-aa23-4e5b0e032455:optionsListDataView",
            "type": "index-pattern"
        }
    ],
    "type": "dashboard",
    "typeMigrationVersion": "10.2.0",
    "updated_by": "u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0"
}