{
  "attributes": {
    "controlGroupInput": {
      "chainingSystem": "HIERARCHICAL",
      "controlStyle": "oneLine",
      "ignoreParentSettingsJSON": {
        "ignoreFilters": false,
        "ignoreQuery": false,
        "ignoreTimerange": false,
        "ignoreValidations": false
      },
      "panelsJSON": {
        "2e26dda9-4629-418b-948f-d930abc2d268": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "fieldName": "source.ip",
            "id": "2e26dda9-4629-418b-948f-d930abc2d268",
            "searchTechnique": "prefix",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Source IP"
          },
          "grow": true,
          "order": 1,
          "type": "optionsListControl",
          "width": "medium"
        },
        "3250c956-8432-4557-afc0-649c2e6be37f": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "fieldName": "intel.seen.indicator",
            "id": "3250c956-8432-4557-afc0-649c2e6be37f",
            "searchTechnique": "prefix",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Indicator"
          },
          "grow": true,
          "order": 4,
          "type": "optionsListControl",
          "width": "medium"
        },
        "572a9344-4353-412d-8476-36fff1fa0cd3": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "fieldName": "destination.ip",
            "id": "572a9344-4353-412d-8476-36fff1fa0cd3",
            "searchTechnique": "prefix",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Destination IP"
          },
          "grow": true,
          "order": 2,
          "type": "optionsListControl",
          "width": "medium"
        },
        "a8e04b33-0231-46ee-b6fc-cfc94adea468": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "fieldName": "sources",
            "id": "a8e04b33-0231-46ee-b6fc-cfc94adea468",
            "searchTechnique": "prefix",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Intel Source"
          },
          "grow": true,
          "order": 5,
          "type": "optionsListControl",
          "width": "medium"
        },
        "cd3840ba-b9d5-4f8c-97c7-676725c045f5": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "fieldName": "intel.seen.indicator_type",
            "id": "cd3840ba-b9d5-4f8c-97c7-676725c045f5",
            "searchTechnique": "prefix",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Indicator Type"
          },
          "grow": true,
          "order": 0,
          "type": "optionsListControl",
          "width": "medium"
        },
        "f789122e-05b5-43ed-b110-9b15ac9d24ad": {
          "explicitInput": {
            "dataViewId": "logs-*",
            "exclude": false,
            "existsSelected": false,
            "fieldName": "destination.port",
            "id": "f789122e-05b5-43ed-b110-9b15ac9d24ad",
            "searchTechnique": "exact",
            "selectedOptions": [],
            "sort": {
              "by": "_count",
              "direction": "desc"
            },
            "title": "Destination Port"
          },
          "grow": true,
          "order": 3,
          "type": "optionsListControl",
          "width": "medium"
        }
      },
      "showApplySelections": false
    },
    "description": "",
    "kibanaSavedObjectMeta": {
      "searchSourceJSON": {
        "filter": [
          {
            "$state": {
              "store": "appState"
            },
            "meta": {
              "alias": null,
              "disabled": false,
              "field": "observer.vendor",
              "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
              "key": "observer.vendor",
              "negate": false,
              "params": {
                "query": "Corelight"
              },
              "type": "phrase"
            },
            "query": {
              "match_phrase": {
                "observer.vendor": "Corelight"
              }
            }
          },
          {
            "$state": {
              "store": "appState"
            },
            "meta": {
              "alias": null,
              "disabled": false,
              "field": "event.dataset",
              "indexRefName": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
              "key": "event.dataset",
              "negate": false,
              "params": {
                "query": "intel"
              },
              "type": "phrase"
            },
            "query": {
              "match_phrase": {
                "event.dataset": "intel"
              }
            }
          }
        ],
        "query": {
          "language": "kuery",
          "query": ""
        }
      }
    },
    "optionsJSON": {
      "hidePanelTitles": false,
      "syncColors": false,
      "syncCursor": true,
      "syncTooltips": false,
      "useMargins": true
    },
    "panelsJSON": [
      {
        "embeddableConfig": {
          "description": "",
          "enhancements": {
            "dynamicActions": {
              "events": []
            }
          },
          "savedVis": {
            "data": {
              "aggs": [],
              "searchSource": {
                "filter": [],
                "query": {
                  "language": "kuery",
                  "query": ""
                }
              }
            },
            "description": "",
            "params": {
              "fontSize": 12,
              "markdown": "**Navigation**\n\n**Corelight**\n\n- [Security Posture](#/dashboard/corelight-7c0946bc-acd0-4ec3-ab3b-8a92853f4a3b)\n- Data Insights\n  - [Name Resolution Insights](#/dashboard/corelight-8546a96c-86c9-4edf-9d46-88338d6ac40e)\n  - [Secure Channel Insights](#/dashboard/corelight-45197477-c13f-4e52-a5dd-fb4f53564963)\n  - [Remote Activity Insights](#/dashboard/corelight-f4864774-ed73-4b78-b861-5b8235ec12cf)\n- **Security Workflows**\n  - **Intel**\n  - [IP Interrogation](#/dashboard/corelight-3a4a279f-f238-47de-90ba-f643c5647fde)\n  - [Log Hunting](#/dashboard/corelight-ff07e65c-2703-4cbe-a45f-3881025352a3)\n  - [Notices](#/dashboard/corelight-f7da14f0-85db-48e8-a591-1f650af0f618)\n  - [RDP Inferences Overview](#/dashboard/corelight-2d4dc345-cbbe-4d7a-9203-5ab11c8cb5ba)\n  - [SSH Inferences Overview](#/dashboard/corelight-65a5fa91-06e4-459b-b4bb-998c85a6cf08)\n  - [Corelight Suricata IDS Alert Overview](#/dashboard/corelight-f1208ffe-d168-46d1-9531-24de523d1bfb)\n  - [VPN Insights](#/dashboard/corelight-023162b6-94da-4d8d-b1f6-de6192356cce)\n- Data Explorer\n  - [Connections](#/dashboard/corelight-eff0434c-1e27-4c02-959e-9f5d95488efb)\n  - [DNS](#/dashboard/corelight-58885f47-95e1-4242-a1ee-783de69ace17)\n  - [Files](#/dashboard/corelight-0cfc8a95-4979-4265-b9ad-91edf63f01a9)\n  - [HTTP](#/dashboard/corelight-8c5f15f7-7063-4228-be54-fb8c20b29caa)\n  - [Software](#/dashboard/corelight-40bbc19b-dd9c-4b43-a88a-e29fc8701902)\n  - [SSL and x509](#/dashboard/corelight-e4a93cfe-4b1f-44df-ab99-50c74f6f2203)\n\n[**Integrations Page**](/app/integrations/detail/corelight/overview)\n",
              "openLinksInNewTab": false
            },
            "title": "",
            "type": "markdown",
            "uiState": {}
          }
        },
        "gridData": {
          "h": 33,
          "i": "54dc8de8-c1ba-4346-83c3-a640bfa97576",
          "w": 11,
          "x": 0,
          "y": 0
        },
        "panelIndex": "54dc8de8-c1ba-4346-83c3-a640bfa97576",
        "title": "Table of Contents",
        "type": "visualization"
      },
      {
        "embeddableConfig": {
          "attributes": {
            "references": [
              {
                "id": "logs-*",
                "name": "indexpattern-datasource-layer-51b17fd0-e0ee-4b06-94c2-775000fd4536",
                "type": "index-pattern"
              }
            ],
            "state": {
              "adHocDataViews": {},
              "datasourceStates": {
                "formBased": {
                  "currentIndexPatternId": "logs-*",
                  "layers": {
                    "51b17fd0-e0ee-4b06-94c2-775000fd4536": {
                      "columnOrder": [
                        "14f10711-e6e9-4e12-a2a9-8e287eacf6b9",
                        "da90c64e-3159-4332-a825-a0b7a9fde48f"
                      ],
                      "columns": {
                        "14f10711-e6e9-4e12-a2a9-8e287eacf6b9": {
                          "customLabel": false,
                          "dataType": "date",
                          "isBucketed": true,
                          "label": "@timestamp",
                          "operationType": "date_histogram",
                          "params": {
                            "dropPartials": false,
                            "includeEmptyRows": true,
                            "interval": "auto"
                          },
                          "scale": "interval",
                          "sourceField": "@timestamp"
                        },
                        "da90c64e-3159-4332-a825-a0b7a9fde48f": {
                          "customLabel": true,
                          "dataType": "number",
                          "isBucketed": false,
                          "label": "Corelight Intel",
                          "operationType": "count",
                          "params": {
                            "emptyAsNull": false,
                            "format": {
                              "id": "number",
                              "params": {
                                "decimals": 0
                              }
                            }
                          },
                          "scale": "ratio",
                          "sourceField": "event.type"
                        }
                      },
                      "ignoreGlobalFilters": false,
                      "incompleteColumns": {},
                      "indexPatternId": "logs-*",
                      "sampling": 1
                    }
                  }
                },
                "indexpattern": {
                  "layers": {}
                },
                "textBased": {
                  "layers": {}
                }
              },
              "filters": [],
              "internalReferences": [],
              "query": {
                "language": "kuery",
                "query": ""
              },
              "visualization": {
                "layers": [
                  {
                    "accessors": ["da90c64e-3159-4332-a825-a0b7a9fde48f"],
                    "colorMapping": {
                      "assignments": [],
                      "colorMode": {
                        "type": "categorical"
                      },
                      "paletteId": "eui_amsterdam_color_blind",
                      "specialAssignments": [
                        {
                          "color": {
                            "type": "loop"
                          },
                          "rule": {
                            "type": "other"
                          },
                          "touched": false
                        }
                      ]
                    },
                    "layerId": "51b17fd0-e0ee-4b06-94c2-775000fd4536",
                    "layerType": "data",
                    "position": "top",
                    "seriesType": "area",
                    "showGridlines": false,
                    "xAccessor": "14f10711-e6e9-4e12-a2a9-8e287eacf6b9"
                  }
                ],
                "legend": {
                  "isVisible": true,
                  "position": "right",
                  "shouldTruncate": false,
                  "showSingleSeries": true
                },
                "preferredSeriesType": "area",
                "title": "Empty XY chart",
                "valueLabels": "hide"
              }
            },
            "title": "",
            "type": "lens",
            "visualizationType": "lnsXY"
          },
          "enhancements": {}
        },
        "gridData": {
          "h": 17,
          "i": "a8456378-79f5-42d0-ab62-1d340b433a42",
          "w": 24,
          "x": 11,
          "y": 0
        },
        "panelIndex": "a8456378-79f5-42d0-ab62-1d340b433a42",
        "title": "Intel Logs Over Time [Logs Corelight]",
        "type": "lens"
      },
      {
        "embeddableConfig": {
          "attributes": {
            "references": [
              {
                "id": "logs-*",
                "name": "indexpattern-datasource-layer-5e59c2cf-2751-46ea-8daa-6f105e954299",
                "type": "index-pattern"
              }
            ],
            "state": {
              "adHocDataViews": {},
              "datasourceStates": {
                "formBased": {
                  "currentIndexPatternId": "logs-*",
                  "layers": {
                    "5e59c2cf-2751-46ea-8daa-6f105e954299": {
                      "columnOrder": [
                        "d30b6d72-c707-44c4-9c13-eb039fdf891a",
                        "ab6b4514-8961-4b09-8e06-0603538397e1"
                      ],
                      "columns": {
                        "ab6b4514-8961-4b09-8e06-0603538397e1": {
                          "customLabel": true,
                          "dataType": "number",
                          "isBucketed": false,
                          "label": "Total",
                          "operationType": "count",
                          "params": {
                            "emptyAsNull": false,
                            "format": {
                              "id": "number",
                              "params": {
                                "decimals": 0
                              }
                            }
                          },
                          "scale": "ratio",
                          "sourceField": "___records___"
                        },
                        "d30b6d72-c707-44c4-9c13-eb039fdf891a": {
                          "customLabel": true,
                          "dataType": "string",
                          "isBucketed": true,
                          "label": "Category",
                          "operationType": "terms",
                          "params": {
                            "exclude": [],
                            "excludeIsRegex": false,
                            "include": [],
                            "includeIsRegex": false,
                            "missingBucket": false,
                            "orderBy": {
                              "columnId": "ab6b4514-8961-4b09-8e06-0603538397e1",
                              "type": "column"
                            },
                            "orderDirection": "desc",
                            "otherBucket": true,
                            "parentFormat": {
                              "id": "terms"
                            },
                            "size": 5
                          },
                          "scale": "ordinal",
                          "sourceField": "intel.seen.indicator_type"
                        }
                      },
                      "ignoreGlobalFilters": false,
                      "incompleteColumns": {},
                      "indexPatternId": "logs-*",
                      "sampling": 1
                    }
                  }
                },
                "indexpattern": {
                  "layers": {}
                },
                "textBased": {
                  "layers": {}
                }
              },
              "filters": [
                {
                  "$state": {
                    "store": "appState"
                  },
                  "meta": {
                    "alias": null,
                    "disabled": false,
                    "field": "intel.seen.indicator_type",
                    "index": "45454710-8410-4c07-8454-590ccce7861d",
                    "key": "intel.seen.indicator_type",
                    "negate": false,
                    "type": "exists",
                    "value": "exists"
                  },
                  "query": {
                    "exists": {
                      "field": "intel.seen.indicator_type"
                    }
                  }
                },
                {
                  "$state": {
                    "store": "appState"
                  },
                  "meta": {
                    "alias": null,
                    "disabled": false,
                    "field": "source.ip",
                    "index": "77393f3b-321d-4645-8263-cf0723961d4a",
                    "key": "source.ip",
                    "negate": false,
                    "type": "exists",
                    "value": "exists"
                  },
                  "query": {
                    "exists": {
                      "field": "source.ip"
                    }
                  }
                },
                {
                  "$state": {
                    "store": "appState"
                  },
                  "meta": {
                    "alias": null,
                    "disabled": false,
                    "field": "destination.ip",
                    "index": "06b21536-794a-4ba4-bd8b-0aec878d0eb2",
                    "key": "destination.ip",
                    "negate": false,
                    "type": "exists",
                    "value": "exists"
                  },
                  "query": {
                    "exists": {
                      "field": "destination.ip"
                    }
                  }
                },
                {
                  "$state": {
                    "store": "appState"
                  },
                  "meta": {
                    "alias": null,
                    "disabled": false,
                    "field": "destination.port",
                    "index": "31da0e41-eb3b-4ce7-bdcb-0919308bbcab",
                    "key": "destination.port",
                    "negate": false,
                    "type": "exists",
                    "value": "exists"
                  },
                  "query": {
                    "exists": {
                      "field": "destination.port"
                    }
                  }
                },
                {
                  "$state": {
                    "store": "appState"
                  },
                  "meta": {
                    "alias": null,
                    "disabled": false,
                    "field": "intel.seen.indicator",
                    "index": "0bad79d9-b08c-4eba-8d82-d68ad6f6364a",
                    "key": "intel.seen.indicator",
                    "negate": false,
                    "type": "exists",
                    "value": "exists"
                  },
                  "query": {
                    "exists": {
                      "field": "intel.seen.indicator"
                    }
                  }
                }
              ],
              "internalReferences": [],
              "query": {
                "language": "kuery",
                "query": ""
              },
              "visualization": {
                "layers": [
                  {
                    "categoryDisplay": "default",
                    "colorMapping": {
                      "assignments": [],
                      "colorMode": {
                        "type": "categorical"
                      },
                      "paletteId": "eui_amsterdam_color_blind",
                      "specialAssignments": [
                        {
                          "color": {
                            "type": "loop"
                          },
                          "rule": {
                            "type": "other"
                          },
                          "touched": false
                        }
                      ]
                    },
                    "layerId": "5e59c2cf-2751-46ea-8daa-6f105e954299",
                    "layerType": "data",
                    "legendDisplay": "show",
                    "metrics": ["ab6b4514-8961-4b09-8e06-0603538397e1"],
                    "nestedLegend": false,
                    "numberDisplay": "percent",
                    "primaryGroups": ["d30b6d72-c707-44c4-9c13-eb039fdf891a"],
                    "truncateLegend": false
                  }
                ],
                "shape": "pie"
              }
            },
            "title": "",
            "type": "lens",
            "visualizationType": "lnsPie"
          },
          "enhancements": {}
        },
        "gridData": {
          "h": 17,
          "i": "187aea9d-272d-420a-92dd-cd015b601c5b",
          "w": 13,
          "x": 35,
          "y": 0
        },
        "panelIndex": "187aea9d-272d-420a-92dd-cd015b601c5b",
        "title": "Indicators [Logs Corelight]",
        "type": "lens"
      },
      {
        "embeddableConfig": {
          "attributes": {
            "references": [],
            "state": {
              "adHocDataViews": {
                "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d": {
                  "allowHidden": false,
                  "allowNoIndex": false,
                  "fieldFormats": {},
                  "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                  "name": "logs-corelight.various*",
                  "runtimeFieldMap": {},
                  "sourceFilters": [],
                  "timeFieldName": "@timestamp",
                  "title": "logs-corelight.various*",
                  "type": "esql"
                }
              },
              "datasourceStates": {
                "textBased": {
                  "indexPatternRefs": [
                    {
                      "id": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                      "timeField": "@timestamp",
                      "title": "logs-corelight.various*"
                    }
                  ],
                  "layers": {
                    "c1716752-8ff2-4d96-9cf1-0389233aa6e5": {
                      "columns": [
                        {
                          "columnId": "Source IP",
                          "fieldName": "Source IP",
                          "inMetricDimension": true,
                          "meta": {
                            "esType": "ip",
                            "type": "ip"
                          }
                        },
                        {
                          "columnId": "Destination IP",
                          "fieldName": "Destination IP",
                          "inMetricDimension": true,
                          "meta": {
                            "esType": "ip",
                            "type": "ip"
                          }
                        },
                        {
                          "columnId": "Port",
                          "fieldName": "Port",
                          "inMetricDimension": true,
                          "meta": {
                            "esType": "long",
                            "type": "number"
                          }
                        },
                        {
                          "columnId": "Indicator Type",
                          "fieldName": "Indicator Type",
                          "inMetricDimension": true,
                          "meta": {
                            "esType": "keyword",
                            "type": "string"
                          }
                        },
                        {
                          "columnId": "Indicator",
                          "fieldName": "Indicator",
                          "inMetricDimension": true,
                          "meta": {
                            "esType": "keyword",
                            "type": "string"
                          }
                        },
                        {
                          "columnId": "44b7eb8e-29bf-4aca-9dec-1b0ae8ee7a64",
                          "fieldName": "Where",
                          "meta": {
                            "esType": "keyword",
                            "type": "string"
                          }
                        },
                        {
                          "columnId": "e97053b9-4783-42f8-bc51-218e1bfc4332",
                          "fieldName": "Total Events",
                          "meta": {
                            "esType": "long",
                            "type": "number"
                          }
                        }
                      ],
                      "index": "ac1dc77e86b8b0251ed701e409e8e3c4ccdacd779afb09dea00b75a2a346153d",
                      "query": {
                        "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"intel\"\r\n| LIMIT 10000\r\n| STATS COUNT() by source.ip, destination.ip, destination.port, intel.seen.indicator_type, `intel.seen.where`, intel.seen.indicator\r\n| RENAME  source.ip as `Source IP`, destination.ip as `Destination IP`, destination.port as Port, intel.seen.indicator_type as `Indicator Type`, intel.seen.indicator as Indicator, intel.seen.where as Where, `COUNT()` as `Total Events`\r\n| SORT `Total Events` DESC\r\n| LIMIT 10\r\n| KEEP `Source IP`, `Destination IP`, Port, `Indicator Type`, Indicator, Where, `Total Events`"
                      },
                      "timeField": "@timestamp"
                    }
                  }
                }
              },
              "filters": [],
              "query": {
                "esql": "FROM logs-corelight.various*\r\n| WHERE event.dataset == \"intel\"\r\n| LIMIT 10000\r\n| STATS COUNT() by source.ip, destination.ip, destination.port, intel.seen.indicator_type, `intel.seen.where`, intel.seen.indicator\r\n| RENAME  source.ip as `Source IP`, destination.ip as `Destination IP`, destination.port as Port, intel.seen.indicator_type as `Indicator Type`, intel.seen.indicator as Indicator, intel.seen.where as Where, `COUNT()` as `Total Events`\r\n| SORT `Total Events` DESC\r\n| LIMIT 10\r\n| KEEP `Source IP`, `Destination IP`, Port, `Indicator Type`, Indicator, Where, `Total Events`"
              },
              "visualization": {
                "columns": [
                  {
                    "columnId": "Source IP"
                  },
                  {
                    "columnId": "Destination IP"
                  },
                  {
                    "columnId": "Port"
                  },
                  {
                    "columnId": "Indicator Type"
                  },
                  {
                    "columnId": "Indicator"
                  },
                  {
                    "columnId": "44b7eb8e-29bf-4aca-9dec-1b0ae8ee7a64",
                    "isMetric": true,
                    "isTransposed": false
                  },
                  {
                    "columnId": "e97053b9-4783-42f8-bc51-218e1bfc4332",
                    "isMetric": true,
                    "isTransposed": false
                  }
                ],
                "layerId": "c1716752-8ff2-4d96-9cf1-0389233aa6e5",
                "layerType": "data"
              }
            },
            "title": "Table Source IP \u0026 Destination IP \u0026 Port \u0026 Indicator Type \u0026 Indicator",
            "type": "lens",
            "visualizationType": "lnsDatatable"
          },
          "disabledActions": ["OPEN_FLYOUT_ADD_DRILLDOWN"],
          "enhancements": {}
        },
        "gridData": {
          "h": 16,
          "i": "fffb5e5c-8dae-4afe-8f34-dfa73aba3497",
          "w": 37,
          "x": 11,
          "y": 17
        },
        "panelIndex": "fffb5e5c-8dae-4afe-8f34-dfa73aba3497",
        "title": "Intel Details [Logs Corelight]",
        "type": "lens"
      },
      {
        "embeddableConfig": {
          "description": "",
          "enhancements": {},
          "rowsPerPage": 10
        },
        "gridData": {
          "h": 29,
          "i": "242aacc6-7504-411a-8d27-d9e7f8e89436",
          "w": 48,
          "x": 0,
          "y": 33
        },
        "panelIndex": "242aacc6-7504-411a-8d27-d9e7f8e89436",
        "panelRefName": "panel_242aacc6-7504-411a-8d27-d9e7f8e89436",
        "title": "Log Data [Logs Corelight]",
        "type": "search"
      }
    ],
    "timeRestore": false,
    "title": "[Logs Corelight] Intel",
    "version": 2
  },
  "coreMigrationVersion": "8.8.0",
  "created_at": "2025-01-29T12:35:59.183Z",
  "id": "corelight-323b0f27-993e-4fee-ae6e-b5977d7cab11",
  "managed": false,
  "references": [
    {
      "id": "logs-*",
      "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[0].meta.index",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "kibanaSavedObjectMeta.searchSourceJSON.filter[1].meta.index",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "a8456378-79f5-42d0-ab62-1d340b433a42:indexpattern-datasource-layer-51b17fd0-e0ee-4b06-94c2-775000fd4536",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "187aea9d-272d-420a-92dd-cd015b601c5b:indexpattern-datasource-layer-5e59c2cf-2751-46ea-8daa-6f105e954299",
      "type": "index-pattern"
    },
    {
      "id": "corelight-845d2914-3a55-4057-9dca-a3fd4e226d54",
      "name": "242aacc6-7504-411a-8d27-d9e7f8e89436:panel_242aacc6-7504-411a-8d27-d9e7f8e89436",
      "type": "search"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_cd3840ba-b9d5-4f8c-97c7-676725c045f5:optionsListDataView",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_2e26dda9-4629-418b-948f-d930abc2d268:optionsListDataView",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_572a9344-4353-412d-8476-36fff1fa0cd3:optionsListDataView",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_f789122e-05b5-43ed-b110-9b15ac9d24ad:optionsListDataView",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_3250c956-8432-4557-afc0-649c2e6be37f:optionsListDataView",
      "type": "index-pattern"
    },
    {
      "id": "logs-*",
      "name": "controlGroup_a8e04b33-0231-46ee-b6fc-cfc94adea468:optionsListDataView",
      "type": "index-pattern"
    }
  ],
  "type": "dashboard",
  "typeMigrationVersion": "10.2.0",
  "updated_by": "u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0"
}
