# Manually define these as a workaround for failing expected values validation
- name: threat.indicator.name
  level: extended
  type: keyword
  description: The display name indicator in an UI friendly format
- name: threat.indicator.type
  level: extended
  type: keyword
  description: Type of indicator as represented by Cyber Observable in STIX 2.1 or OpenCTI
  expected_values:
    - artifact
    - autonomous-system
    - bank-account
    - cryptocurrency-wallet
    - cryptographic-key
    - directory
    - domain-name
    - email-addr
    - email-message
    - email-mime-part-type
    - hostname
    - ipv4-addr
    - ipv6-addr
    - mac-addr
    - media-content
    - mutex
    - network-traffic
    - payment-card
    - phone-number
    - process
    - software
    - file
    - text
    - url
    - user-account
    - user-agent
    - windows-registry-key
    - windows-registry-value-type
    - x509-certificate
    - unknown
    - port
# Additional file hash algorithms
- name: threat.indicator.file.hash.sha3_256
  type: keyword
  description: SHA3-256 hash.
- name: threat.indicator.file.hash.sha3_512
  type: keyword
  description: SHA3-512 hash.
# External ECS defintions, required by the transform
- external: ecs
  name: ecs.version
- external: ecs
  name: event.agent_id_status
- external: ecs
  name: event.category
- external: ecs
  name: event.created
- external: ecs
  name: event.dataset
- external: ecs
  name: event.id
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.original
- external: ecs
  name: event.type
- external: ecs
  name: related.hash
- external: ecs
  name: related.hosts
- external: ecs
  name: related.ip
- external: ecs
  name: related.user
- external: ecs
  name: tags
- external: ecs
  name: threat.feed.dashboard_id
- external: ecs
  name: threat.feed.description
- external: ecs
  name: threat.feed.name
- external: ecs
  name: threat.feed.reference
- external: ecs
  name: threat.indicator.as.number
- external: ecs
  name: threat.indicator.as.organization.name
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.file.accessed
- external: ecs
  name: threat.indicator.file.created
- external: ecs
  name: threat.indicator.file.directory
- external: ecs
  name: threat.indicator.file.drive_letter
- external: ecs
  name: threat.indicator.file.extension
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha384
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.file.hash.ssdeep
- external: ecs
  name: threat.indicator.file.hash.tlsh
- external: ecs
  name: threat.indicator.file.mime_type
- external: ecs
  name: threat.indicator.file.mtime
- external: ecs
  name: threat.indicator.file.name
- external: ecs
  name: threat.indicator.file.path
- external: ecs
  name: threat.indicator.file.size
- external: ecs
  name: threat.indicator.file.type
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.marking.tlp
- external: ecs
  name: threat.indicator.modified_at
- external: ecs
  name: threat.indicator.port
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.reference
- external: ecs
  name: threat.indicator.registry.data.bytes
- external: ecs
  name: threat.indicator.registry.data.strings
- external: ecs
  name: threat.indicator.registry.data.type
- external: ecs
  name: threat.indicator.registry.hive
- external: ecs
  name: threat.indicator.registry.key
- external: ecs
  name: threat.indicator.registry.path
- external: ecs
  name: threat.indicator.registry.value
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.fragment
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.password
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.url.registered_domain
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.subdomain
- external: ecs
  name: threat.indicator.url.top_level_domain
- external: ecs
  name: threat.indicator.url.username
- external: ecs
  name: threat.indicator.x509.alternative_names
- external: ecs
  name: threat.indicator.x509.issuer.common_name
- external: ecs
  name: threat.indicator.x509.not_after
- external: ecs
  name: threat.indicator.x509.not_before
- external: ecs
  name: threat.indicator.x509.public_key_algorithm
- external: ecs
  name: threat.indicator.x509.public_key_exponent
- external: ecs
  name: threat.indicator.x509.serial_number
- external: ecs
  name: threat.indicator.x509.signature_algorithm
- external: ecs
  name: threat.indicator.x509.subject.common_name
- external: ecs
  name: threat.indicator.x509.version_number
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_misp
