{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "A supervised machine learning model has identified a DNS question name that is predicted to be the result of a Domain Generation Algorithm (DGA),\nwhich could indicate command and control network activity.\n",
        "language": "kuery",
        "license": "Elastic License",
        "max_signals": 10000,
        "name": "Machine Learning Detected a DNS Request Predicted to be a DGA Domain",
        "query": "event.category:network and network.protocol:dns and ml_is_dga.malicious_prediction:1 and not dns.question.registered_domain:avsvmcloud.com\n",
        "risk_score": 21,
        "rule_id": "64116bb2-0f2c-4cf6-9df4-9973452b4d4b",
        "severity": "low",
        "tags": [
            "Elastic",
            "DNS",
            "Host",
            "External",
            "DGA",
            "ML"
        ],
        "type": "query",
        "version": 2
    },
    "id": "64116bb2-0f2c-4cf6-9df4-9973452b4d4b",
    "type": "security-rule"
}