- external: ecs
  name: ecs.version
- external: ecs
  name: error.message
- external: ecs
  name: event.kind
  type: constant_keyword
  description: The kind of alert, which in the case of Falco is "alert".
- external: ecs
  name: data_stream.namespace
- external: ecs
  name: event.sequence
  type: long
- external: ecs
  name: related.hosts
  type: text
- external: ecs
  name: event.category
  type: text
  description: The category of the event, based on the driver collecting data.
- external: ecs
  name: event.type
  type: keyword
  description: Name of the event.
- external: ecs
  name: event.outcome
  type: keyword
  description: How the event resolved.
- external: ecs
  name: event.created
  type: date
  description: Date / time the event was first read by an Agent.
- external: ecs
  name: event.ingested
  type: date
  description: Date / time the event first reached the datastore.
- external: ecs
  name: threat.technique.id
  type: keyword
  description: ID based on Mitre tags within Falco.
- external: ecs
  name: event.original
  type: text
  description: Raw output of the Falco rule.
- external: ecs
  name: event.severity
  type: keyword
  description: Priority of the event. Needs lowercase filter.
- external: ecs
  name: rule.name
  type: keyword
  description: Name of the Falco rule.
- external: ecs
  name: tags
  type: text
  description: Non-Mitre tags from Falco.
- external: ecs
  name: event.start
  type: date
  description: Event timestamp with nanos.
- external: ecs
  name: event.provider
  type: keyword
  description: Name of the source that produced the event.
- external: ecs
  name: observer.hostname
- external: ecs
  name: process.executable
  type: text
  description: Full executable path of the process.
- external: ecs
  name: process.parent.executable
  type: text
  description: The process.exe path of the parent process.
- external: ecs
  name: process.name
  type: text
  description: Name of the process generating the event.
- external: ecs
  name: process.parent.name
  type: text
  description: Name of the parent of the process generating the event.
- external: ecs
  name: process.args
  type: text
  description: Arguments passed over the command line when starting the process which generated the event.
- external: ecs
  name: process.command_line
  type: text
  description: Concatenation of process.name and process.args.
- external: ecs
  name: process.parent.command_line
  type: text
  description: The process.command_line equivalent for the parent process.
- external: ecs
  name: process.args_count
  type: long
  description: The count of command line args.
- external: ecs
  name: process.env_vars
  type: text
  description: Concatenated string of encironment variables for the process generating the event.
- external: ecs
  name: process.working_directory
  type: text
  description: Current working directory of the event.
- external: ecs
  name: process.pid
  type: long
  description: ID of the process generating the event.
- external: ecs
  name: process.parent.pid
  type: long
  description: PID for the parent of the process generating the event.
- external: ecs
  name: process.vpid
  type: long
  description: ID of the process generating the event as seen from its current PID namespace.
- external: ecs
  name: process.parent.vpid
  type: long
  description: ID of the parent process generating the event as seen from its current PID namespace.
- external: ecs
  name: process.session_leader.vpid
  type: long
  description: Session ID of the process generating the event.
- external: ecs
  name: process.session_leader.name
  type: text
  description: Name of the current process's session leader.
- external: ecs
  name: process.session_leader.executable
  type: text
  description: Full executable path of the current process's session leader.
- external: ecs
  name: process.group_leader.vpid
  type: long
  description: Process group ID of the process generating the event, as seen from its current PID namespace.
- external: ecs
  name: process.group_leader.name
  type: text
  description: Name of the current process's group leader.
- external: ecs
  name: process.group_leader.executable
  type: text
  description: Full executable path of the current process's group leader.
- external: ecs
  name: process.uptime
  type: long
  description: Number of nanoseconds since the process started.
  unit: nanos
- external: ecs
  name: process.parent.uptime
  type: long
  description: Number of nanoseconds since the parent process started.
  unit: nanos
- external: ecs
  name: process.start
  type: date_nanos
  description: Start of process as epoch timestamp in nanos.
- external: ecs
  name: process.parent.start
  type: date_nanos
  description: Start of parent process as epoch timestamp in nanos.
- external: ecs
  name: process.session_leader.same_as_process
  type: boolean
  description: Denotes if this process is the leader of the process session.
- external: ecs
  name: process.group_leader.same_as_process
  type: boolean
  description: Denotes if this process is the leader of the virtual process group.
- external: ecs
  name: process.thread.capabilities.permitted
  type: text
  description: Set of permitted capabilities.
- external: ecs
  name: process.thread.capabilities.effective
  type: text
  description: Set of effective capabilities.
- external: ecs
  name: process.thread.id
  type: long
  description: ID of the thread generating the event.
- external: ecs
  name: process.user.id
  type: integer
  description: User ID.
- external: ecs
  name: process.user.name
  type: keyword
  description: User name.
- name: process.group.id
  type: keyword
  description: Group ID.
- name: process.group.name
  type: keyword
  description: Group name.
- external: ecs
  name: container.runtime
  type: text
  description: Container type (docker, cri-o, containerd etc)
- external: ecs
  name: container.security_context.privileged
  type: boolean
  description: Denotes if containers are running as privileged.
- external: ecs
  name: container.image.tag
  type: text
  description: The container image tag.
- external: ecs
  name: container.image.hash.all
  type: text
  description: The container image registry digest.
- external: ecs
  name: file.directory
  type: text
  description: If the FD is a file, this lists the directory which contains it.
- external: ecs
  name: file.name
  type: text
  description: If the FD is a file, the filename without the path.
- external: ecs
  name: file.type
  type: text
  description: Type of FD, if fd.type is file or directory.
- external: ecs
  name: file.path
  type: text
  description: Path of file FD, if fd.type is file or directory.
- external: ecs
  name: client.ip
  type: ip
  description: Matches the client IP address of the FD.
- external: ecs
  name: client.address
  type: ip
  description: Matches the client IP address of the FD.
- external: ecs
  name: client.port
  type: text
  description: For TCP/UDP FDs, the client port.
- external: ecs
  name: client.domain
  type: text
  description: Domain name associated with the client IP address.
- external: ecs
  name: server.ip
  type: ip
  description: Matches the server IP address of the FD.
- external: ecs
  name: server.address
  type: ip
  description: Matches the server IP address of the FD.
- external: ecs
  name: server.port
  type: text
  description: For TCP/UDP FDs, the server port.
- external: ecs
  name: server.domain
  type: text
  description: Domain name associated with the server IP address.
- external: ecs
  name: source.ip
  type: ip
  description: Matches the local IP address of the FD.
- external: ecs
  name: source.address
  type: ip
  description: Matches the local IP address of the FD.
- external: ecs
  name: source.port
  type: text
  description: For TCP/UDP FDs, the source port.
- external: ecs
  name: destination.ip
  type: ip
  description: Matches the remote IP address of the FD.
- external: ecs
  name: destination.address
  type: ip
  description: Matches the remote IP address of the FD.
- external: ecs
  name: destination.port
  type: text
  description: For TCP/UDP FDs, the destination port.
- external: ecs
  name: file.inode
  type: text
  description: Inode number of the referenced file.
- external: ecs
  name: log.file.path
- external: ecs
  name: log.syslog.facility.name
  type: text
  description: Facility as a string.
- external: ecs
  name: log.syslog.facility.code
  type: integer
  description: Facility as a number (0-23).
- external: ecs
  name: log.syslog.severity.name
  type: text
  description: Severity as a string. Can have one of these values; emerg, alert, crit, err, warn, notice, info, debug.
- external: ecs
  name: log.syslog.severity.code
  type: text
  description: Severity as a number (0-7).
- external: ecs
  name: orchestrator.namespace
  type: text
  description: Kubernetes namespace name.
- external: ecs
  name: orchestrator.resource.name
  type: text
  description: Kubernetes pod name.
- external: ecs
  name: orchestrator.resource.id
  type: text
  description: Kubernetes pod UID, assigned upon pod creation within Kubernetes.
- external: ecs
  name: orchestrator.resource.label
  type: text
  description: Kubernetes pod key/value labels.
- external: ecs
  name: orchestrator.resource.ip
  type: text
  description: Kubernetes pod IP.
- external: ecs
  name: orchestrator.resource.type
  type: text
  description: Returns "pod" if other pod fields are present.
- external: ecs
  name: orchestrator.type
  type: text
  description: Returns "Kubernetes" if other pod fields are present.
