- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: tags
- external: ecs
  name: error.message
- external: ecs
  name: event.category
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: event.created
- external: ecs
  name: event.original
- name: threat.feed.name
  type: keyword
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.marking.tlp
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_threatq
- name: threat.feed.dashboard_id
  type: constant_keyword
  description: Dashboard ID used for Kibana CTI UI
  value: ti_threatq-a05fd810-78f1-11ec-a97c-7db1518ab848
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_threatq.threat

