{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule is triggered when IOCs collected from the Rapid7 Threat Command Integration have a match against indicators that were found in the customer environment.",
        "filters": [
            {
                "meta": {
                    "alias": null,
                    "negate": true,
                    "disabled": false,
                    "type": "exists",
                    "key": "rapid7.tc.ioc.value",
                    "value": "exists"
                },
                "query": {
                    "exists": {
                        "field": "rapid7.tc.ioc.value"
                    }
                },
                "$state": {
                    "store": "appState"
                }
            }
        ],
        "from": "now-2100s",
        "index": [
            "**"
        ],
        "interval": "30m",
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Rapid7 Threat Command IOCs Correlation",
        "note": "## Triage and Analysis\n\n### Investigating Threat Intel Indicator Matches\n\nThreat Intel indicator match rules allow matching from a local observation such as an endpoint event that records a file\nhash with an entry of a file hash stored within the Threat Intel integrations. Matches can also occur on\nan IP address, registry path, URL, or imphash.\n\nThe matches will be based on the incoming last 30 days feed data so it's important to validate the data and review the results by\ninvestigating the associated activity to determine if it requires further investigation.\n\nIf an indicator matches a local observation, the following enriched fields will be generated to identify the indicator, field, and type matched.\n\n- `threat.indicator.matched.atomic` - this identifies the atomic indicator that matched the local observation\n- `threat.indicator.matched.field` - this identifies the indicator field that matched the local observation\n- `threat.indicator.matched.type` - this identifies the indicator type that matched the local observation\n\n#### Possible investigation steps:\n- Investigation should be validated and reviewed based on the data (file hash, registry path, URL, imphash) that was matched\nand by viewing the source of that activity.\n- Consider the history of the indicator that was matched. Has it happened before? Is it happening on multiple machines?\nThese kinds of questions can help understand if the activity is related to legitimate behavior.\n- Consider the user and their role within the company: is this something related to their job or work function?\n\n### False Positive Analysis\n- For any matches found, it's important to consider the initial release date of that indicator. Threat intelligence can\nbe a great tool for augmenting existing security processes, while at the same time it should be understood that threat\nintelligence can represent a specific set of activity observed at a point in time. For example, an IP address\nmay have hosted malware observed in a Dridex campaign months ago, but it's possible that IP has been remediated and\nno longer represents any threat.\n- Adversaries often use legitimate tools as network administrators such as `PsExec` or `AdFind`; these tools often find their\nway into indicator lists creating the potential for false positives.\n- It's possible after large and publicly written campaigns, curious employees might end up going directly to attacker infrastructure and triggering these rules.\n\n### Response and Remediation\n- If suspicious or malicious behavior is observed, take immediate action to isolate activity to prevent further\npost-compromise behavior.\n- One example of a response if a machine matched a command and control IP address would be to add an entry to a network\ndevice such as a firewall or proxy appliance to prevent any outbound activity from leaving that machine.\n- Another example of a response with a malicious file hash match would involve validating if the file was properly quarantined,\nreviewing current running processes for any abnormal activity, and investigating for any other follow-up actions such as persistence or lateral movement.\n",
        "query": "@timestamp : * and (destination.ip : *  or source.ip : * or file.hash.md5 : * or file.hash.sha1 : * or file.hash.sha256: * or file.hash.sha512 : * or file.hash.sha384 : * or url.full : * or destination.domain : * or host.domain : * or source.domain : * or url.domain : * or user.domain : * or user.email : *) and not (_index: .internal.preview.alerts-security* or _index: .internal.alerts-security.alerts*)",
        "references": [
            "https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html"
        ],
        "risk_score": 50,
        "rule_id": "af814670-3279-11ed-93fa-d354b323cd1b",
        "setup": "To add tags and comments for the matched IOCs into the `Rapid7 Threat Command platform`, the Webhook connector needs to be configured. Below are the mentioned steps to create Webhook Connector and configure alert actions:\n- Click on `Edit rule settings` of Rapid7 Threat Command IOCs Correlation rule.\n- Under the `Actions` tab, select the `On each rule execution` Action Frequency from the given drop down options.\n- Select `Webhook` connector type.\n- Click on `Create a connector`.\n- Configure the parameters for adding tags as given below:\n  * `Connector Name` : Rapid7 Threat Command Webhook Connector for tags\n  * `Method` : POST\n  * `URL` : https://api.intsights.com/public/v1/app/elastic/iocs/tags/batch\n  * `Authentication` : True\n  * `Username` : Account ID of IntSights account\n  * `Password` : API Key that is generated from the IntSights ETP Suite UI from the *Subscription* page.\n  * `Add HTTP header` : True\n  * `Key` : Content-Type\n  * `Value` : application/json\n  * Now click on `Save`.\n  * Add the below json code into the body of Webhook connector:\n  `[ {{#context.alerts}} {{#threat.enrichments}} { \"iocValue\":\"{{matched.atomic}}\", \"tag\":\"Elastic Match\" }, {{/threat.enrichments}} {{/context.alerts}} { \"iocValue\":\"{{context.alerts.0.threat.enrichments.0.matched.atomic}}\", \"tag\":\"Elastic Match\" } ]`\n  * Click on `Save changes`.\n- Configure the parameters for adding comments as given below:\n  * `Connector Name` : Rapid7 Threat Command Webhook Connector for comments\n  * `Method` : POST\n  * `URL` : https://api.intsights.com/public/v1/app/elastic/iocs/comments/batch\n  * `Authentication` : True\n  * `Username` : Account ID of IntSights account\n  * `Password` : API Key that is generated from the IntSights ETP Suite UI from the *Subscription* page.\n  * `Add HTTP header` : True\n  * `Key` : Content-Type\n  * `Value` : application/json\n  * Now click on `Save`.\n  * Add the below json code into the body of Webhook connector:\n  `[{{#context.alerts}}{{#threat.enrichments}}{\"iocValue\":\"{{matched.atomic}}\",\"comment\":\"The IOC matched an indicator in your environment at {{kibana.alert.rule.updated_at}}\"},{{/threat.enrichments}}{{/context.alerts}}{\"iocValue\":\"{{context.alerts.0.threat.enrichments.0.matched.atomic}}\",\"comment\":\"The IOC matched an indicator in your environment at {{context.alerts.0.kibana.alert.rule.updated_at}}\"}]`\n  * Click on `Save changes`.",
        "severity": "medium",
        "max_signals": 499,
        "tags": [
            "Elastic",
            "Windows",
            "Elastic Endgame",
            "Network",
            "Continuous Monitoring",
            "SecOps",
            "Monitoring",
            "has_guide",
            "Rapid7 Threat Command",
            "IOC"
        ],
        "threat_filters": [
            {
                "$state": {
                    "store": "appState"
                },
                "meta": {
                    "negate": false,
                    "alias": null,
                    "disabled": false,
                    "type": "phrase",
                    "params": {
                        "query": false
                    },
                    "key": "rapid7.tc.ioc.whitelisted"
                },
                "query": {
                    "match_phrase": {
                        "rapid7.tc.ioc.whitelisted": false
                    }
                }
            }
        ],
        "threat_index": [
            "rapid7-tc-unique-iocs"
        ],
        "threat_indicator_path": "threat.indicator",
        "threat_language": "kuery",
        "threat_mapping": [
            {
                "entries": [
                    {
                        "field": "destination.ip",
                        "type": "mapping",
                        "value": "threat.indicator.ip"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "source.ip",
                        "type": "mapping",
                        "value": "threat.indicator.ip"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "destination.domain",
                        "type": "mapping",
                        "value": "threat.indicator.url.domain"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "host.domain",
                        "type": "mapping",
                        "value": "threat.indicator.url.domain"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "source.domain",
                        "type": "mapping",
                        "value": "threat.indicator.url.domain"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "url.domain",
                        "type": "mapping",
                        "value": "threat.indicator.url.domain"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "user.domain",
                        "type": "mapping",
                        "value": "threat.indicator.url.domain"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "user.email",
                        "type": "mapping",
                        "value": "threat.indicator.email.address"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "file.hash.md5",
                        "type": "mapping",
                        "value": "threat.indicator.file.hash.md5"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "file.hash.sha1",
                        "type": "mapping",
                        "value": "threat.indicator.file.hash.sha1"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "file.hash.sha256",
                        "type": "mapping",
                        "value": "threat.indicator.file.hash.sha256"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "file.hash.sha384",
                        "type": "mapping",
                        "value": "threat.indicator.file.hash.sha384"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "file.hash.sha512",
                        "type": "mapping",
                        "value": "threat.indicator.file.hash.sha512"
                    }
                ]
            },
            {
                "entries": [
                    {
                        "field": "url.full",
                        "type": "mapping",
                        "value": "threat.indicator.url.full"
                    }
                ]
            }
        ],
        "threat_query": "threat.indicator.url.full : * or threat.indicator.email.address : * or threat.indicator.url.domain : *  or threat.indicator.file.hash.md5 : * or threat.indicator.file.hash.sha1 : * or threat.indicator.file.hash.sha256 : * or threat.indicator.file.hash.sha512 or threat.indicator.ip : *",
        "type": "threat_match",
        "version": 1,
        "related_integrations": [
            {
                "package": "ti_rapid7_threat_command",
                "version": "0.1.0"
            }
        ]
    },
    "id": "af814670-3279-11ed-93fa-d354b323cd1b",
    "type": "security-rule"
}