{
    "attributes": {
        "author": [
            "Elastic"
        ],
        "description": "This rule is triggered when CVEs collected from the Rapid7 Threat Command Integration have a match against vulnerabilities that were found in the customer environment.",
        "filters": [
            {
                "meta": {
                    "alias": null,
                    "negate": true,
                    "disabled": false,
                    "type": "exists",
                    "key": "rapid7.tc.vulnerability.id",
                    "value": "exists"
                },
                "query": {
                    "exists": {
                        "field": "rapid7.tc.vulnerability.id"
                    }
                },
                "$state": {
                    "store": "appState"
                }
            }
        ],
        "from": "now-2100s",
        "index": [
            "auditbeat-*",
            "endgame-*",
            "filebeat-*",
            "logs-*",
            "packetbeat-*",
            "winlogbeat-*"
        ],
        "interval": "30m",
        "language": "kuery",
        "license": "Elastic License v2",
        "name": "Rapid7 Threat Command CVEs Correlation",
        "note": "## Triage and Analysis\n\n### Investigating CVE Matches\n\nRapid7 Threat Command CVEs Correlation rule allows matching CVEs from user indices within the vulnerabilities collected from Rapid7 Threat Command integrations.\n\nThe matches will be based on the latest values of CVEs from the last 180 days. So it's essential to validate the data and review the results by investigating the associated activity to determine if it requires further investigation.\n\nIf a vulnerability matches a local observation, the following enriched fields will be generated to identify the vulnerability, field, and type matched.\n\n- `threat.indicator.matched.atomic` - this identifies the atomic vulnerability that matched the local observation\n- `threat.indicator.matched.field` - this identifies the vulnerability field that matched the local observation\n- `threat.indicator.matched.type` - this identifies the vulnerability type that matched the local observation\n\n#### Possible investigation steps:\n- Investigation can be validated and reviewed based on the data that was matched and by viewing the source of that activity.\n- Consider the history of the vulnerability that was matched. Has it happened before? Is it happening on multiple machines?\nThese kinds of questions can help understand if the activity is related to legitimate behavior.\n- Consider the user and their role within the company: is this something related to their job or work function?",
        "query": "@timestamp : * and (vulnerability.id : *) and not (_index: .internal.preview.alerts-security* or _index: .internal.alerts-security.alerts*)",
        "references": [
            "https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-threatintel.html"
        ],
        "risk_score": 50,
        "rule_id": "eaecc8f0-6704-11ed-80b2-9bbc46f73b72",
        "severity": "medium",
        "max_signals": 100000,
        "tags": [
            "Elastic",
            "Windows",
            "Elastic Endgame",
            "Network",
            "Continuous Monitoring",
            "SecOps",
            "Monitoring",
            "has_guide",
            "Rapid7 Threat Command",
            "CVE",
            "Vulnerability"
        ],
        "threat_filters": [],
        "threat_index": [
            "rapid7-tc-unique-cves"
        ],
        "threat_indicator_path": "rapid7.tc.vulnerability",
        "threat_language": "kuery",
        "threat_mapping": [
            {
                "entries": [
                    {
                        "field": "vulnerability.id",
                        "type": "mapping",
                        "value": "vulnerability.id"
                    }
                ]
            }
        ],
        "threat_query": "vulnerability.id : *",
        "type": "threat_match",
        "version": 1,
        "related_integrations": [
            {
                "package": "ti_rapid7_threat_command",
                "version": "0.1.0"
            }
        ]
    },
    "id": "eaecc8f0-6704-11ed-80b2-9bbc46f73b72",
    "type": "security-rule"
}