- name: splunk
  type: group
  fields:
    - name: alert
      type: group
      fields:
        - name: EventCode
          type: long
        - name: Files
          type: keyword
        - name: Last_Login_Time
          type: date
        - name: Logon_Type
          type: long
        - name: Member_Security_ID
          type: keyword
        - name: Recipient
          type: keyword
        - name: Sender
          type: keyword
        - name: Subject_Account_Name
          type: keyword
        - name: Target_Account_Name
          type: keyword
        - name: Time
          type: date
        - name: _bkt
          type: keyword
        - name: _cd
          type: keyword
        - name: _indextime
          type: date
        - name: _raw
          type: keyword
        - name: _serial
          type: keyword
        - name: _si
          type: keyword
        - name: _sourcetype
          type: keyword
        - name: _subsecond
          type: keyword
        - name: _time
          type: date
        - name: access_method
          type: keyword
        - name: acked
          type: keyword
        - name: action
          type: keyword
        - name: activity
          type: keyword
        - name: activity_timestamp
          type: date
        - name: agent
          type: keyword
        - name: alert
          type: keyword
        - name: alert_type
          type: keyword
        - name: alias
          type: keyword
        - name: annotations
          type: group
          fields:
            - name: mitre_attack
              type: group
              fields:
                - name: mitre_tactic
                  type: keyword
                - name: mitre_tactic_id
                  type: keyword
                - name: mitre_technique
                  type: keyword
                - name: mitre_technique_id
                  type: keyword
                - name: value
                  type: keyword
        - name: app
          type: keyword
        - name: app_session_id
          type: keyword
        - name: app_session_key
          type: keyword
        - name: app_tags
          type: keyword
        - name: appcategory
          type: keyword
        - name: appsuite
          type: keyword
        - name: asset
          type: keyword
        - name: attack
          type: keyword
        - name: attackid
          type: keyword
        - name: body
          type: keyword
        - name: breach_date
          type: date
        - name: breach_description
          type: keyword
        - name: breach_id
          type: keyword
        - name: breach_media_references
          type: keyword
        - name: breach_score
          type: keyword
        - name: breach_target_references
          type: keyword
        - name: browser
          type: keyword
        - name: browser_session_id
          type: keyword
        - name: browser_version
          type: keyword
        - name: category
          type: keyword
        - name: category_id
          type: keyword
        - name: cci
          type: long
        - name: ccl
          type: keyword
        - name: city
          type: keyword
        - name: connection_id
          type: keyword
        - name: const_dedup_id
          type: keyword
        - name: correlation_id
          type: keyword
        - name: count
          type: double
        - name: craction
          type: long
        - name: creation_timestamp
          type: date
        - name: crlevel
          type: keyword
        - name: crscore
          type: long
        - name: ctime
          type: date
        - name: date
          type: keyword
        - name: date_hour
          type: long
        - name: date_mday
          type: long
        - name: date_minute
          type: long
        - name: date_month
          type: keyword
        - name: date_second
          type: long
        - name: date_wday
          type: keyword
        - name: date_year
          type: long
        - name: date_zone
          type: long
        - name: dayDiff
          type: double
        - name: day_count
          type: long
        - name: delta
          type: long
        - name: dest
          type: ip
        - name: dest_bunit
          type: keyword
        - name: dest_category
          type: keyword
        - name: dest_count
          type: long
        - name: dest_interface
          type: keyword
        - name: dest_ip
          type: ip
        - name: dest_port
          type: long
        - name: dest_priority
          type: keyword
        - name: dest_zone
          type: keyword
        - name: device
          type: keyword
        - name: device_classification
          type: keyword
        - name: devid
          type: keyword
        - name: devname
          type: keyword
        - name: direction
          type: keyword
        - name: dlp_file
          type: keyword
        - name: dlp_incident_id
          type: keyword
        - name: dlp_is_unique_count
          type: keyword
        - name: dlp_parent_id
          type: keyword
        - name: dlp_profile
          type: keyword
        - name: dlp_rule
          type: keyword
        - name: dlp_rule_count
          type: long
        - name: dlp_rule_severity
          type: keyword
        - name: dom
          type: keyword
        - name: domain
          type: keyword
        - name: dst_country
          type: keyword
        - name: dst_latitude
          type: double
        - name: dst_location
          type: keyword
        - name: dst_longitude
          type: double
        - name: dst_region
          type: keyword
        - name: dst_timezone
          type: keyword
        - name: dst_zipcode
          type: keyword
        - name: dstcountry
          type: keyword
        - name: dstintf
          type: keyword
        - name: dstintfrole
          type: keyword
        - name: dstip
          type: ip
        - name: dstport
          type: long
        - name: dvc
          type: keyword
        - name: ef_received_at
          type: date
        - name: email
          type: keyword
        - name: email_source
          type: keyword
        - name: enriched
          type: keyword
        - name: event
          type: group
          fields:
            - name: ComputerName
              type: keyword
            - name: SeverityName
              type: keyword
            - name: UserName
              type: keyword
        - name: eventtime
          type: date
        - name: eventtype
          type: keyword
        - name: external_email
          type: long
        - name: extracted_eventtype
          type: keyword
        - name: extracted_host
          type: keyword
        - name: factor
          type: keyword
        - name: file_hash
          type: keyword
        - name: file_lang
          type: keyword
        - name: file_name
          type: keyword
        - name: file_password_protected
          type: keyword
        - name: file_path
          type: keyword
        - name: file_size
          type: long
        - name: file_type
          type: keyword
        - name: firstTime
          type: date
        - name: forwarded_by
          type: keyword
        - name: friendly_name
          type: keyword
        - name: from_user
          type: keyword
        - name: ftnt_action
          type: keyword
        - name: gef_meta
          type: group
          fields:
            - name: _event_id
              type: keyword
            - name: _home_pop
              type: keyword
            - name: _service_id
              type: keyword
            - name: _tenant_id
              type: keyword
            - name: schema_version
              type: long
            - name: timestamp
              type: date
        - name: gef_src_dp
          type: keyword
        - name: host
          type: keyword
        - name: hostname
          type: keyword
        - name: http_user_agent
          type: keyword
        - name: httpmethod
          type: keyword
        - name: id
          type: keyword
        - name: ids_type
          type: keyword
        - name: incident_id
          type: keyword
        - name: incidentserialno
          type: long
        - name: index
          type: keyword
        - name: infected_hosts
          type: long
        - name: infection_count
          type: long
        - name: info_max_time
          type: date
        - name: info_min_time
          type: date
        - name: info_search_time
          type: date
        - name: insertion_epoch_timestamp
          type: date
        - name: instance_id
          type: keyword
        - name: integration
          type: keyword
        - name: internal_id
          type: keyword
        - name: ip
          type: ip
        - name: isotimestamp
          type: date
        - name: killchain
          type: keyword
        - name: lastTime
          type: date
        - name: last_seen
          type: date
        - name: level
          type: keyword
        - name: linecount
          type: long
        - name: location
          type: group
          fields:
            - name: city
              type: keyword
            - name: country
              type: keyword
            - name: state
              type: keyword
        - name: logid
          type: keyword
        - name: mac
          type: keyword
        - name: managed_app
          type: keyword
        - name: matched_username
          type: keyword
        - name: md5
          type: keyword
        - name: mitre_sub_technique
          type: keyword
        - name: mitre_technique_description
          type: keyword
        - name: msg
          type: keyword
        - name: name
          type: keyword
        - name: netskope_pop
          type: keyword
        - name: new_enrollment
          type: keyword
        - name: nt_host
          type: keyword
        - name: object
          type: keyword
        - name: object_category
          type: keyword
        - name: object_id
          type: keyword
        - name: object_path
          type: keyword
        - name: object_type
          type: keyword
        - name: ood_software
          type: keyword
        - name: organization_unit
          type: keyword
        - name: orig_action_name
          type: keyword
        - name: orig_bkt
          type: keyword
        - name: orig_cd
          type: keyword
        - name: orig_event_id
          type: keyword
        - name: orig_eventtype
          type: keyword
        - name: orig_host
          type: keyword
        - name: orig_index
          type: keyword
        - name: orig_linecount
          type: long
        - name: orig_raw
          type: keyword
        - name: orig_rid
          type: keyword
        - name: orig_rule_id
          type: keyword
        - name: orig_sid
          type: keyword
        - name: orig_source
          type: keyword
        - name: orig_sourcetype
          type: keyword
        - name: orig_splunk_server
          type: keyword
        - name: orig_tag
          type: keyword
        - name: orig_time
          type: date
        - name: orig_timeendpos
          type: long
        - name: orig_timestartpos
          type: long
        - name: os
          type: keyword
        - name: os_family
          type: keyword
        - name: os_version
          type: keyword
        - name: outer_doc_type
          type: long
        - name: page
          type: keyword
        - name: page_site
          type: keyword
        - name: parent_id
          type: keyword
        - name: password_type
          type: keyword
        - name: phone
          type: keyword
        - name: policy
          type: keyword
        - name: policy_id
          type: keyword
        - name: policyid
          type: keyword
        - name: policytype
          type: keyword
        - name: poluuid
          type: keyword
        - name: port
          type: long
        - name: ppf_cell
          type: keyword
        - name: priority
          type: keyword
        - name: product
          type: keyword
        - name: product_version
          type: keyword
        - name: profile
          type: keyword
        - name: protection_keyword
          type: keyword
        - name: proto
          type: long
        - name: protocol
          type: keyword
        - name: protocol_version
          type: keyword
        - name: raw_event_inserted_at
          type: date
        - name: raw_timestamp
          type: date
        - name: reason
          type: keyword
        - name: ref
          type: keyword
        - name: referer
          type: keyword
        - name: request_id
          type: keyword
        - name: result
          type: keyword
        - name: risk_other
          type: keyword
        - name: risk_score
          type: float
        - name: search_name
          type: keyword
        - name: search_title
          type: keyword
        - name: service
          type: keyword
        - name: service_identifier
          type: keyword
        - name: session_id
          type: keyword
        - name: sessionid
          type: keyword
        - name: severity
          type: keyword
        - name: severity_id
          type: keyword
        - name: sha256
          type: keyword
        - name: signature
          type: keyword
        - name: signature_id
          type: keyword
        - name: site
          type: keyword
        - name: skip_geoip_lookup
          type: keyword
        - name: source
          type: keyword
        - name: sourcetype
          type: keyword
        - name: splunk_server
          type: keyword
        - name: splunk_server_group
          type: keyword
        - name: src
          type: keyword
        - name: src_asset
          type: keyword
        - name: src_asset_id
          type: keyword
        - name: src_asset_tag
          type: keyword
        - name: src_bunit
          type: keyword
        - name: src_category
          type: keyword
        - name: src_city
          type: keyword
        - name: src_country
          type: keyword
        - name: src_employee_no
          type: long
        - name: src_interface
          type: keyword
        - name: src_ip
          type: ip
        - name: src_is_expected
          type: keyword
        - name: src_latitude
          type: double
        - name: src_location
          type: keyword
        - name: src_longitude
          type: double
        - name: src_mac
          type: keyword
        - name: src_nt_host
          type: keyword
        - name: src_owner
          type: keyword
        - name: src_pci_domain
          type: keyword
        - name: src_port
          type: long
        - name: src_priority
          type: keyword
        - name: src_region
          type: keyword
        - name: src_serial_no
          type: keyword
        - name: src_time
          type: date
        - name: src_timezone
          type: keyword
        - name: src_user
          type: keyword
        - name: src_user_category
          type: keyword
        - name: src_user_email
          type: keyword
        - name: src_user_first
          type: keyword
        - name: src_user_identity
          type: keyword
        - name: src_user_identity_id
          type: keyword
        - name: src_user_identity_tag
          type: keyword
        - name: src_user_last
          type: keyword
        - name: src_user_nick
          type: keyword
        - name: src_user_phone
          type: keyword
        - name: src_user_priority
          type: keyword
        - name: src_user_startDate
          type: keyword
        - name: src_user_watchlist
          type: keyword
        - name: src_zipcode
          type: keyword
        - name: src_zone
          type: keyword
        - name: srccountry
          type: keyword
        - name: srcintf
          type: keyword
        - name: srcintfrole
          type: keyword
        - name: srcip
          type: ip
        - name: srcport
          type: long
        - name: stanza
          type: keyword
        - name: subject
          type: keyword
        - name: subtype
          type: keyword
        - name: suppression_key
          type: keyword
        - name: tag
          type: keyword
        - name: threat_category
          type: keyword
        - name: threat_collection
          type: keyword
        - name: threat_collection_key
          type: keyword
        - name: threat_description
          type: keyword
        - name: threat_group
          type: keyword
        - name: threat_key
          type: keyword
        - name: threat_match_field
          type: keyword
        - name: threat_match_value
          type: keyword
        - name: threat_source_digest
          type: keyword
        - name: threat_source_id
          type: keyword
        - name: threat_source_path
          type: keyword
        - name: threat_source_type
          type: keyword
        - name: time
          type: date
        - name: timeendpos
          type: long
        - name: timestamp
          type: keyword
        - name: timestartpos
          type: long
        - name: timestr
          type: keyword
        - name: title
          type: keyword
        - name: traffic_type
          type: keyword
        - name: transaction_id
          type: keyword
        - name: transport
          type: keyword
        - name: true_obj_category
          type: keyword
        - name: true_obj_type
          type: keyword
        - name: true_type_id
          type: keyword
        - name: tss_mode
          type: keyword
        - name: type
          type: keyword
        - name: tz
          type: long
        - name: ur_normalized
          type: keyword
        - name: url
          type: keyword
        - name: user
          type: keyword
        - name: user_category
          type: keyword
        - name: user_count
          type: long
        - name: user_email
          type: keyword
        - name: user_first
          type: keyword
        - name: user_identity
          type: keyword
        - name: user_identity_id
          type: keyword
        - name: user_identity_tag
          type: keyword
        - name: user_last
          type: keyword
        - name: user_managedBy
          type: keyword
        - name: user_nick
          type: keyword
        - name: user_phone
          type: keyword
        - name: user_priority
          type: keyword
        - name: user_startDate
          type: keyword
        - name: user_watchlist
          type: keyword
        - name: useragent
          type: keyword
        - name: userip
          type: ip
        - name: userkey
          type: keyword
        - name: username
          type: keyword
        - name: values
          type: keyword
        - name: vd
          type: keyword
        - name: vendor
          type: keyword
        - name: vendor_action
          type: keyword
        - name: vendor_eventtype
          type: keyword
        - name: vendor_product
          type: keyword
        - name: vendor_url
          type: keyword
        - name: weight
          type: long
