- name: input.type
  type: keyword
  description: Input type.
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: '@timestamp'
  type: date
  description: Event timestamp.
- description: |-
    ECS version this event conforms to. `ecs.version` is a required field and must exist in all events.
    When querying across multiple indices -- which may conform to slightly different ECS versions -- this field lets integrations adjust to the schema version of the events.
  name: ecs.version
  type: keyword
- description: |-
    For log events the message field contains the log message, optimized for viewing in a log viewer.
    For structured logs without an original message field, other fields can be concatenated to form a human-readable summary of the event.
    If multiple messages exist, they can be combined into one message.
  name: message
  type: match_only_text
- description: List of keywords used to tag each event.
  name: tags
  normalize:
    - array
  type: keyword
- description: Error message.
  name: error.message
  type: match_only_text
- description: |-
    The numeric severity of the event according to your event source.
    What the different severity values mean can be different between sources and use cases. It's up to the implementer to make sure severities are consistent across events from the same source.
    The Syslog severity belongs in `log.syslog.severity.code`. `event.severity` is meant to represent the severity according to the event source (e.g. firewall, IDS). If the event source does not publish its own severity, you may optionally copy the `log.syslog.severity.code` to `event.severity`.
  name: event.severity
  type: long
- description: |-
    This is one of four ECS Categorization Fields, and indicates the second level in the ECS category hierarchy.
    `event.category` represents the "big buckets" of ECS categories. For example, filtering on `event.category:process` yields all events relating to process activity. This field is closely related to `event.type`, which is used as a subcategory.
    This field is an array. This will allow proper categorization of some events that fall in multiple categories.
  name: event.category
  normalize:
    - array
  type: keyword
- description: Unique ID to describe the event.
  name: event.id
  type: keyword
- description: |-
    Timestamp when an event arrived in the central data store.
    This is different from `@timestamp`, which is when the event originally occurred.  It's also different from `event.created`, which is meant to capture the first time an agent saw the event.
    In normal conditions, assuming no tampering, the timestamps should chronologically look like this: `@timestamp` < `event.created` < `event.ingested`.
  name: event.ingested
  type: date
- description: |-
    This is one of four ECS Categorization Fields, and indicates the highest level in the ECS category hierarchy.
    `event.kind` gives high-level information about what type of information the event contains, without being specific to the contents of the event. For example, values of this field distinguish alert events from metric events.
    The value of this field can be used to inform how these kinds of events should be handled. They may warrant different retention, different access control, it may also help understand whether the data coming in at a regular interval or not.
  name: event.kind
  type: keyword
- description: |-
    This is one of four ECS Categorization Fields, and indicates the third level in the ECS category hierarchy.
    `event.type` represents a categorization "sub-bucket" that, when used along with the `event.category` field values, enables filtering events down to a level appropriate for single visualization.
    This field is an array. This will allow proper categorization of some events that fall in multiple event types.
  name: event.type
  normalize:
    - array
  type: keyword
- description: |-
    event.created contains the date/time when the event was first read by an agent, or by your pipeline.
    This field is distinct from @timestamp in that @timestamp typically contain the time extracted from the original event.
    In most situations, these two timestamps will be slightly different. The difference can be used to calculate the delay between your source generating an event, and the time when your agent first processed it. This can be used to monitor your agent's or pipeline's ability to keep up with your event source.
    In case the two timestamps are identical, @timestamp should be used.
  name: event.created
  type: date
- description: |-
    Raw text message of entire event. Used to demonstrate log integrity or where the full log message (before splitting it up in multiple parts) may be required, e.g. for reindex.
    This field is not indexed and doc_values are disabled. It cannot be searched, but it can be retrieved from `_source`. If users wish to override this and index this field, please see `Field data types` in the `Elasticsearch Reference`.
  doc_values: false
  index: false
  name: event.original
  type: keyword
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_maltiverse
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_maltiverse.indicator
- description: Describes the type of action conducted by the threat.
  name: threat.indicator.description
  type: keyword
- description: Reference information for the threat feed in a UI friendly format.
  name: threat.feed.reference
  type: keyword
- description: The date and time when intelligence source first reported sighting this indicator.
  name: threat.indicator.first_seen
  type: date
- description: The date and time when intelligence source last reported sighting this indicator.
  name: threat.indicator.last_seen
  type: date
- description: Type of indicator as represented by Cyber Observable in STIX 2.0.
  name: threat.indicator.type
  type: keyword
- description: Identifies a threat indicator as an IP address (irrespective of direction).
  name: threat.indicator.ip
  type: ip
- description: |-
    Domain of the url, such as "www.elastic.co".
    In some cases a URL may refer to an IP and/or port directly, without a domain name. In this case, the IP address would go to the `domain` field.
    If the URL contains a literal IPv6 address enclosed by `[` and `]` (IETF RFC 2732), the `[` and `]` characters should also be captured in the `domain` field.
  name: threat.indicator.url.domain
  type: keyword
- description: If full URLs are important to your use case, they should be stored in `url.full`, whether this field is reconstructed or present in the event source.
  multi_fields:
    - name: text
      type: match_only_text
  name: threat.indicator.url.full
  type: wildcard
- description: |-
    The field contains the file extension from the original request url, excluding the leading dot.
    The file extension is only set if it exists, as not every url has a file extension.
    The leading period must not be included. For example, the value must be "png", not ".png".
    Note that when the file name has multiple extensions (example.tar.gz), only the last one should be captured ("gz", not "tar.gz").
  name: threat.indicator.url.extension
  type: keyword
- description: |-
    Unmodified original url as seen in the event source.
    Note that in network monitoring, the observed URL may be a full URL, whereas in access logs, the URL is often just represented as a path.
    This field is meant to represent the URL as it was observed, complete or not.
  multi_fields:
    - name: text
      type: match_only_text
  name: threat.indicator.url.original
  type: wildcard
- description: Path of the request, such as "/search".
  name: threat.indicator.url.path
  type: wildcard
- description: Port of the request, such as 443.
  name: threat.indicator.url.port
  type: long
- description: |-
    Scheme of the request, such as "https".
    Note: The `:` is not part of the scheme.
  name: threat.indicator.url.scheme
  type: keyword
- description: |-
    The query field describes the query string of the request, such as "q=elasticsearch".
    The `?` is excluded from the query string. If a URL contains no `?`, there is no query field. If there is a `?` but no query, the query field exists with an empty string. The `exists` query can be used to differentiate between the two cases.
  name: threat.indicator.url.query
  type: keyword
- description: |-
    The highest registered url domain, stripped of the subdomain.
    For example, the registered domain for "foo.example.com" is "example.com".
    This value can be determined precisely with a list like the public suffix list (http://publicsuffix.org). Trying to approximate this by simply taking the last two labels will not work well for TLDs such as "co.uk".
  name: threat.indicator.url.registered_domain
  type: keyword
- description: |-
    The effective top level domain (eTLD), also known as the domain suffix, is the last part of the domain name. For example, the top level domain for example.com is "com".
    This value can be determined precisely with a list like the public suffix list (http://publicsuffix.org). Trying to approximate this by simply taking the last label will not work well for effective TLDs such as "co.uk".
  name: threat.indicator.url.top_level_domain
  type: keyword
- description: MD5 hash.
  name: threat.indicator.file.hash.md5
  type: keyword
- description: SHA1 hash.
  name: threat.indicator.file.hash.sha1
  type: keyword
- description: SHA256 hash.
  name: threat.indicator.file.hash.sha256
  type: keyword
- description: SHA512 hash.
  name: threat.indicator.file.hash.sha512
  type: keyword
- description: Identifies a threat indicator as an email address (irrespective of direction).
  name: threat.indicator.email.address
  type: keyword
- description: The name of the indicator's provider.
  name: threat.indicator.provider
  type: keyword
- description: Traffic Light Protocol sharing markings.
  name: threat.indicator.marking.tlp
  type: keyword
- description: Identifies the vendor-neutral confidence rating using the None/Low/Medium/High scale defined in Appendix A of the STIX 2.1 framework. Vendor-specific confidence scales may be added as custom fields.
  name: threat.indicator.confidence
  type: keyword
- description: Unique number allocated to the autonomous system. The autonomous system number (ASN) uniquely identifies each network on the Internet.
  name: threat.indicator.as.number
  type: long
- description: Organization name.
  multi_fields:
    - name: text
      type: match_only_text
  name: threat.indicator.as.organization.name
  type: keyword
- description: Longitude and latitude.
  name: threat.indicator.geo.location
  type: geo_point
- description: City name.
  name: threat.indicator.geo.city_name
  type: keyword
- description: Country ISO code.
  name: threat.indicator.geo.country_iso_code
  type: keyword
- description: Number of times this indicator was observed conducting threat activity.
  name: threat.indicator.sightings
  type: long
- description: Reference URL linking to additional information about this indicator.
  name: threat.indicator.reference
  type: keyword
- name: maltiverse
  type: group
  description: Fields for Maltiverse threat intelligence.
  fields:
    - name: feed
      type: keyword
      description: Origin of the IoC
    - name: address
      type: keyword
      description: registered address
      multi_fields:
        - name: address
          type: match_only_text
    - name: as_name
      type: keyword
      description: AS registered name
      multi_fields:
        - name: as_name
          type: match_only_text
    - name: asn_cidr
      type: keyword
      description: CIDR associated
    - name: asn_country_code
      type: keyword
      description: Country code asociated with ASN
    - name: asn_date
      type: date
      description: date when asn registered
    - name: asn_registry
      type: keyword
      description: ASN registry
    - name: blacklist
      type: group
      description: blacklist for the indicator
      fields:
        - name: first_seen
          type: date
          description: first sighting
        - name: last_seen
          type: date
          description: last sighting
        - name: description
          type: keyword
          description: what we saw
          multi_fields:
            - name: description
              type: match_only_text
        - name: source
          type: keyword
          description: reporter of the activity
        - name: count
          type: long
          description: number of reports for the indicator
        - name: external_references
          type: flattened
        - name: labels
          type: keyword
    - name: cidr
      type: keyword
      description: CIDR associated
    - name: city
      type: keyword
      description: City
    - name: classification
      type: keyword
      description: Classification of the threat
    - name: country_code
      type: keyword
      description: Country code of the threat
    - name: creation_time
      type: date
      description: creation date
    - name: email
      type: keyword
      description: email address
    - name: ip_addr
      type: ip
      description: IP address
    - name: is_cdn
      type: boolean
      description: boolean description tag
    - name: is_cnc
      type: boolean
      description: boolean description tag
    - name: is_distributing_malware
      type: boolean
      description: boolean description tag
    - name: is_hosting
      type: boolean
      description: boolean description tag
    - name: is_iot_threat
      type: boolean
      description: boolean description tag
    - name: is_known_attacker
      type: boolean
      description: boolean description tag
    - name: is_known_scanner
      type: boolean
      description: boolean description tag
    - name: is_mining_pool
      type: boolean
      description: boolean description tag
    - name: is_open_proxy
      type: boolean
      description: boolean description tag
    - name: is_sinkhole
      type: boolean
      description: boolean description tag
    - name: is_tor_node
      type: boolean
      description: boolean description tag
    - name: is_vpn_node
      type: boolean
      description: boolean description tag
    - name: location
      type: geo_point
      description: Longitude and latitude.
    - name: modification_time
      type: date
      description: Last modification date
    - name: number_of_blacklisted_domains_resolving
      type: long
      description: Blacklisted domains resolving associated
    - name: number_of_domains_resolving
      type: long
      description: Domains resolving associated
    - name: number_of_offline_malicious_urls_allocated
      type: long
      description: URLs allocated
    - name: number_of_online_malicious_urls_allocated
      type: long
      description: URLs allocated
    - name: number_of_whitelisted_domains_resolving
      type: long
      description: Whitelisted domains resolving associated
    - name: registrant_name
      type: keyword
      description: Registrant name
      multi_fields:
        - name: registrant_name
          type: match_only_text
    - name: tag
      type: keyword
      description: Tags of the threat
    - name: type
      type: keyword
      description: Type of the threat
    - name: domain_consonants
      type: long
    - name: domain_length
      type: long
    - name: entropy
      type: double
    - name: is_alive
      type: boolean
    - name: is_phishing
      type: boolean
    - name: is_storing_phishing
      type: boolean
    - name: last_online_time
      type: keyword
    - name: postal_code
      type: keyword
    - name: resolved_ip
      type: flattened
    - name: hostname
      type: keyword
    - name: urlchecksum
      type: keyword
