- name: input.type
  type: keyword
  description: Input type.
- name: data_stream.type
  type: constant_keyword
  description: Data stream type.
- name: data_stream.dataset
  type: constant_keyword
  description: Data stream dataset.
- name: data_stream.namespace
  type: constant_keyword
  description: Data stream namespace.
- name: '@timestamp'
  type: date
  description: Event timestamp.
- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: tags
- external: ecs
  name: error.message
- external: ecs
  name: event.severity
- external: ecs
  name: event.category
- external: ecs
  name: event.id
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.type
- external: ecs
  name: event.created
- external: ecs
  name: event.original
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.feed.reference
- external: ecs
  name: threat.indicator.first_seen
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.ip
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.url.full
- external: ecs
  name: threat.indicator.url.extension
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.path
- external: ecs
  name: threat.indicator.url.port
- external: ecs
  name: threat.indicator.url.scheme
- external: ecs
  name: threat.indicator.url.query
- external: ecs
  name: threat.indicator.url.registered_domain
- external: ecs
  name: threat.indicator.url.top_level_domain
- external: ecs
  name: threat.indicator.file.hash.md5
- external: ecs
  name: threat.indicator.file.hash.sha1
- external: ecs
  name: threat.indicator.file.hash.sha256
- external: ecs
  name: threat.indicator.file.hash.sha512
- external: ecs
  name: threat.indicator.email.address
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.marking.tlp
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.as.number
- external: ecs
  name: threat.indicator.as.organization.name
- external: ecs
  name: threat.indicator.geo.location
- external: ecs
  name: threat.indicator.geo.city_name
- external: ecs
  name: threat.indicator.geo.country_iso_code
- external: ecs
  name: threat.indicator.sightings
- external: ecs
  name: threat.indicator.reference
- name: feed
  type: text
  description: Origin of the IoC
- name: address
  type: text
  description: registered address
- name: as_name
  type: text
  description: AS registered name
- name: asn_cidr
  type: text
  description: CIDR associated
- name: asn_country_code
  type: text
  description: Country code asociated with ASN
- name: asn_date
  type: text
  description: date when asn registered
- name: asn_registry
  type: text
  description: ASN registry
- name: blacklist
  type: group
  description: blacklist for the indicator
  fields:
    - name: first_seen
      type: date
      description: first shighting
    - name: description
      type: text
      description: what we saw
    - name: source
      type: text
      description: reporter of the activity
    - name: count
      type: long
      description: number of reports for the indicator
- name: cidr
  type: text
  description: CIDR associated
- name: city
  type: text
  description: City
- name: classification
  type: text
  description: Classification of the threat
- name: country_code
  type: text
  description: Country code of the threat
- name: creation_time
  type: date
  description: creation date
- name: email
  type: text
  description: email address
- name: ip_addr
  type: ip
  description: IP address
- name: is_cdn
  type: boolean
  description: boolean description tag
- name: is_cnc
  type: boolean
  description: boolean description tag
- name: is_distributing_malware
  type: boolean
  description: boolean description tag
- name: is_hosting
  type: boolean
  description: boolean description tag
- name: is_iot_threat
  type: boolean
  description: boolean description tag
- name: is_known_attacker
  type: boolean
  description: boolean description tag
- name: is_known_scanner
  type: boolean
  description: boolean description tag
- name: is_mining_pool
  type: boolean
  description: boolean description tag
- name: is_open_proxy
  type: boolean
  description: boolean description tag
- name: is_sinkhole
  type: boolean
  description: boolean description tag
- name: is_tor_node
  type: boolean
  description: boolean description tag
- name: is_vpn_node
  type: boolean
  description: boolean description tag
- name: location
  type: boolean
  description: boolean description tag
- name: modification_time
  type: date
  description: Last modification date
- name: number_of_blacklisted_domains_resolving
  type: long
  description: Blacklisted domains resolving associated
- name: number_of_domains_resolving
  type: long
  description: Domains resolving associated
- name: number_of_offline_malicious_urls_allocated
  type: long
  description: URLs allocated
- name: number_of_online_malicious_urls_allocated
  type: long
  description: URLs allocated
- name: number_of_whitelisted_domains_resolving
  type: long
  description: Whitelisted domains resolving associated
- name: registrant_name
  type: text
  description: Registrant name
- name: tag
  type: text
  description: Tags of the threat
- name: type
  type: text
  description: Type of the threat
