{
  "attributes": {
    "id": "05b83871-a7af-494f-b1cf-be4b20ac4a86",
    "name": "Google Threat Intelligence URL IOC Correlation",
    "tags": [
      "Google Threat Intelligence",
      "URL IOC",
      "Elastic",
      "Threat Intelligence"
    ],
    "interval": "1h",
    "revision": 0,
    "description": "This rule is triggered when URL IOC's collected from the Google Threat Intelligence Integration have a match against URL's that were found in the customer environment.",
    "risk_score": 99,
    "severity": "critical",
    "license": "Elastic License v2",
    "author": ["Elastic"],
    "false_positives": [],
    "from": "now-3900s",
    "rule_id": "05b83871-a7af-494f-b1cf-be4b20ac4a86",
    "max_signals": 1000,
    "risk_score_mapping": [],
    "severity_mapping": [],
    "threat": [],
    "to": "now",
    "references": [],
    "version": 1,
    "exceptions_list": [],
    "immutable": false,
    "rule_source": { "type": "internal" },
    "related_integrations": [
      { "package": "ti_google_threat_intelligence", "version": "^0.1.0" }
    ],
    "required_fields": [
      { "name": "threat.indicator.url.original", "type": "keyword", "ecs": false }
    ],
    "setup": "",
    "type": "threat_match",
    "language": "kuery",
    "index": [
      "apm-*-transaction*",
      "auditbeat-*",
      "endgame-*",
      "filebeat-*",
      "logs-*",
      "packetbeat-*",
      "traces-apm*",
      "winlogbeat-*",
      "-*elastic-cloud-logs-*"
    ],
    "query": "NOT event.module : \"ti_google_threat_intelligence\"",
    "filters": [],
    "threat_filters": [],
    "threat_query": "@timestamp >= \"now-30d/d\"",
    "threat_mapping": [
      {
        "entries": [
          {
            "field": "url.original",
            "type": "mapping",
            "value": "threat.indicator.url.original"
          }
        ]
      },
      {
        "entries": [
          {
            "field": "threat.indicator.url.original",
            "type": "mapping",
            "value": "threat.indicator.url.original"
          }
        ]
      }
    ],
    "threat_language": "kuery",
    "threat_index": ["logs-ti_google_threat_intelligence_latest.dest_url_ioc-*"],
    "threat_indicator_path": "gti.threat.indicator",
    "actions": []
  },
  "type": "security-rule",
  "id": "05b83871-a7af-494f-b1cf-be4b20ac4a86"
}
