- name: ocsf
  type: group
  fields:
    - name: activity_id
      type: keyword
      description: The normalized identifier of the activity that triggered the event.
    - name: activity_name
      type: keyword
      description: The event activity name, as defined by the activity_id.
    - name: analytic
      type: group
      fields:
        - name: category
          type: keyword
          description: The analytic category.
        - name: desc
          type: keyword
          description: The description of the analytic that generated the finding.
        - name: name
          type: keyword
          description: The name of the analytic that generated the finding.
        - name: related_analytics
          type: group
          fields:
            - name: category
              type: keyword
              description: The analytic category.
            - name: desc
              type: keyword
              description: The description of the analytic that generated the finding.
            - name: name
              type: keyword
              description: The name of the analytic that generated the finding.
            - name: related_analytics
              type: flattened
            - name: type
              type: keyword
              description: The analytic type.
            - name: type_id
              type: keyword
              description: The analytic type ID.
            - name: uid
              type: keyword
              description: The unique identifier of the analytic that generated the finding.
            - name: version
              type: keyword
              description: 'The analytic version. For example: 1.1.'
        - name: type
          type: keyword
          description: The analytic type.
        - name: type_id
          type: keyword
          description: The analytic type ID.
        - name: uid
          type: keyword
          description: The unique identifier of the analytic that generated the finding.
        - name: version
          type: keyword
          description: 'The analytic version. For example: 1.1.'
    - name: api
      type: group
      fields:
        - name: operation
          type: keyword
          description: Verb/Operation associated with the request.
        - name: request
          type: group
          fields:
            - name: flags
              type: keyword
              description: The list of communication flags, normalized to the captions of the flag_ids values. In the case of 'Other', they are defined by the event source.
            - name: uid
              type: keyword
              description: The unique request identifier.
        - name: response
          type: group
          fields:
            - name: code
              type: long
              description: The numeric response sent to a request.
            - name: error
              type: keyword
              description: Error Code.
            - name: error_message
              type: keyword
              description: Error Message.
            - name: flags
              type: keyword
              description: The list of communication flags, normalized to the captions of the flag_ids values. In the case of 'Other', they are defined by the event source.
            - name: message
              type: keyword
              description: The description of the event, as defined by the event source.
        - name: service
          type: group
          fields:
            - name: labels
              type: keyword
              description: The list of labels associated with the service.
            - name: name
              type: keyword
              description: The name of the service.
            - name: uid
              type: keyword
              description: The unique identifier of the service.
            - name: version
              type: keyword
              description: The version of the service.
        - name: version
          type: keyword
          description: The version of the API service.
    - name: attacks
      type: group
      fields:
        - name: tactics
          type: group
          fields:
            - name: name
              type: keyword
              description: The tactic name that is associated with the attack technique, as defined by ATT&CK MatrixTM.
            - name: uid
              type: keyword
              description: The tactic ID that is associated with the attack technique, as defined by ATT&CK MatrixTM.
        - name: technique
          type: group
          fields:
            - name: name
              type: keyword
              description: 'The name of the attack technique, as defined by ATT&CK MatrixTM. For example: Drive-by Compromise.'
            - name: uid
              type: keyword
              description: 'The unique identifier of the attack technique, as defined by ATT&CK MatrixTM. For example: T1189.'
        - name: version
          type: keyword
          description: The ATT&CK Matrix version.
    - name: category_name
      type: keyword
      description: 'The event category name, as defined by category_uid value: Identity & Access Management.'
    - name: category_uid
      type: keyword
      description: The category unique identifier of the event.3 Identity & Access ManagementIdentity & Access Management (IAM) events relate to the supervision of the system's authentication and access control model. Examples of such events are the success or failure of authentication, granting of authority, password change, entity change, privileged use etc.
    - name: cis_csc
      type: group
      fields:
        - name: control
          type: keyword
          description: The CIS critical security control.
        - name: version
          type: keyword
          description: The CIS critical security control version.
    - name: class_name
      type: keyword
      description: 'The event class name, as defined by class_uid value: Security Finding.'
    - name: class_uid
      type: keyword
      description: The unique identifier of a class. A Class describes the attributes available in an event.2001 Security FindingSecurity Finding events describe findings, detections, anomalies, alerts and/or actions performed by security products.
    - name: cloud
      type: group
      fields:
        - name: account
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the account (e.g. GCP Account Name).
            - name: type
              type: keyword
              description: The account type, normalized to the caption of 'account_type_id'. In the case of 'Other', it is defined by the event source.
            - name: type_id
              type: keyword
              description: The normalized account type identifier.
            - name: uid
              type: keyword
              description: The unique identifier of the account (e.g. AWS Account ID).
        - name: org
          type: group
          fields:
            - name: name
              type: keyword
              description: The name of the organization. For example, Widget, Inc.
            - name: ou_name
              type: keyword
              description: The name of the organizational unit, within an organization. For example, Finance, IT, R&D.
            - name: ou_uid
              type: keyword
              description: The alternate identifier for an entity's unique identifier. For example, its Active Directory OU DN or AWS OU ID.
            - name: uid
              type: keyword
              description: The unique identifier of the organization. For example, its Active Directory or AWS Org ID.
        - name: project_uid
          type: keyword
          description: The unique identifier of a Cloud project.
        - name: provider
          type: keyword
          description: The unique name of the Cloud services provider, such as AWS, MS Azure, GCP, etc.
        - name: region
          type: keyword
          description: The name of the cloud region, as defined by the cloud provider.
        - name: zone
          type: keyword
          description: The availability zone in the cloud region, as defined by the cloud provider.
    - name: compliance
      type: group
      description: The compliance object provides context to compliance findings.
      fields:
        - name: control
          type: keyword
          description: A Control is prescriptive, prioritized, and simplified set of best practices that one can use to strengthen their cybersecurity posture. e.g. AWS SecurityHub Controls, CIS Controls.
        - name: requirements
          type: keyword
          description: A list of requirements associated to a specific control in an industry or regulatory framework. e.g. NIST.800-53.r5 AU-10.
        - name: standards
          type: keyword
          description: Security standards are a set of criteria organizations can follow to protect sensitive and confidential information. e.g. NIST SP 800-53, CIS AWS Foundations Benchmark v1.4.0, ISO/IEC 27001.
        - name: status
          type: keyword
          description: The resultant status of the compliance check normalized to the caption of the status_id value. In the case of 'Other', it is defined by the event source.
        - name: status_code
          type: keyword
          description: The resultant status code of the compliance check.
        - name: status_detail
          type: text
          description: The contextual description of the status, status_code values.
        - name: status_id
          type: integer
          description: The normalized status identifier of the compliance check.
    - name: confidence
      type: keyword
      description: The confidence, normalized to the caption of the confidence_id value. In the case of 'Other', it is defined by the event source.
    - name: confidence_id
      type: keyword
      description: The normalized confidence refers to the accuracy of the rule that created the finding. A rule with a low confidence means that the finding scope is wide and may create finding reports that may not be malicious in nature.
    - name: confidence_score
      type: long
      description: The confidence score as reported by the event source.
    - name: count
      type: long
      description: The number of times that events in the same logical group occurred during the event Start Time to End Time period.
    - name: data_sources
      type: keyword
      description: The data sources for the finding.
    - name: duration
      type: long
      description: The event duration or aggregate time, the amount of time the event covers from start_time to end_time in milliseconds.
    - name: end_time
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: end_time_dt
      type: date
      description: The end time of a time period, or the time of the most recent event included in the aggregate event.
    - name: enrichments
      type: group
      fields:
        - name: data
          type: flattened
          description: The enrichment data associated with the attribute and value. The meaning of this data depends on the type the enrichment record.
        - name: name
          type: keyword
          description: The name of the attribute to which the enriched data pertains.
        - name: provider
          type: keyword
          description: The enrichment data provider name.
        - name: type
          type: keyword
          description: The enrichment type. For example, location.
        - name: value
          type: keyword
          description: The value of the attribute to which the enriched data pertains.
    - name: evidence
      type: flattened
      description: The data the finding exposes to the analyst.
    - name: evidences
      type: flattened
      description: Describes various evidence artifacts associated to the activity/activities that triggered a security detection.
    - name: finding
      type: group
      fields:
        - name: created_time
          type: date
          description: The time when the finding was created.
        - name: created_time_dt
          type: date
          description: The time when the finding was created.
        - name: desc
          type: keyword
          description: The description of the reported finding.
        - name: first_seen_time
          type: date
          description: The time when the finding was first observed.
        - name: first_seen_time_dt
          type: date
          description: The time when the finding was first observed.
        - name: last_seen_time
          type: date
          description: The time when the finding was most recently observed.
        - name: last_seen_time_dt
          type: date
          description: The time when the finding was most recently observed.
        - name: modified_time
          type: date
          description: The time when the finding was last modified.
        - name: modified_time_dt
          type: date
          description: The time when the finding was last modified.
        - name: product_uid
          type: keyword
          description: The unique identifier of the product that reported the finding.
        - name: related_events
          type: group
          fields:
            - name: product_uid
              type: keyword
              description: The unique identifier of the product that reported the related event.
            - name: type
              type: keyword
              description: 'The type of the related event. For example: Process Activity: Launch.'
            - name: type_uid
              type: keyword
              description: 'The unique identifier of the related event type. For example: 100701.'
            - name: uid
              type: keyword
              description: The unique identifier of the related event.
        - name: remediation
          type: group
          fields:
            - name: desc
              type: keyword
              description: The description of the remediation strategy.
            - name: kb_articles
              type: keyword
              description: The KB article/s related to the entity.
            - name: kb_article_list
              type: flattened
              description: A list of KB articles or patches related to an endpoint.
            - name: references
              type: keyword
              description: A list of supporting URL/s, references that help describe the remediation strategy.
        - name: src_url
          type: keyword
          description: The URL pointing to the source of the finding.
        - name: supporting_data
          type: flattened
          description: Additional data supporting a finding as provided by security tool.
        - name: title
          type: keyword
          description: The title of the reported finding.
        - name: types
          type: keyword
          description: One or more types of the reported finding.
        - name: uid
          type: keyword
          description: The unique identifier of the reported finding.
    - name: impact
      type: keyword
      description: The impact , normalized to the caption of the impact_id value. In the case of 'Other', it is defined by the event source.
    - name: impact_id
      type: keyword
      description: The normalized impact of the finding.
    - name: impact_score
      type: long
      description: The impact of the finding, valid range 0-100.
    - name: kill_chain
      type: group
      fields:
        - name: phase
          type: keyword
          description: The cyber kill chain phase.
        - name: phase_id
          type: keyword
          description: The cyber kill chain phase identifier.
    - name: malware
      type: group
      fields:
        - name: classification_ids
          type: keyword
          description: The list of normalized identifiers of the malware classifications.
        - name: classifications
          type: keyword
          description: The list of malware classifications, normalized to the captions of the classification_id values. In the case of 'Other', they are defined by the event source.
        - name: cves
          type: group
          fields:
            - name: created_time
              type: date
              description: The Record Creation Date identifies when the CVE ID was issued to a CVE Numbering Authority (CNA) or the CVE Record was published on the CVE List. Note that the Record Creation Date does not necessarily indicate when this vulnerability was discovered, shared with the affected vendor, publicly disclosed, or updated in CVE.
            - name: created_time_dt
              type: date
              description: The Record Creation Date identifies when the CVE ID was issued to a CVE Numbering Authority (CNA) or the CVE Record was published on the CVE List. Note that the Record Creation Date does not necessarily indicate when this vulnerability was discovered, shared with the affected vendor, publicly disclosed, or updated in CVE.
            - name: cvss
              type: group
              fields:
                - name: base_score
                  type: double
                  description: The CVSS base score.
                - name: depth
                  type: keyword
                  description: The CVSS depth represents a depth of the equation used to calculate CVSS score.
                - name: metrics
                  type: group
                  fields:
                    - name: name
                      type: keyword
                      description: The name of the metric.
                    - name: value
                      type: keyword
                      description: The value of the metric.
                - name: overall_score
                  type: double
                  description: The CVSS overall score, impacted by base, temporal, and environmental metrics.
                - name: severity
                  type: keyword
                  description: The Common Vulnerability Scoring System (CVSS) Qualitative Severity Rating. A textual representation of the numeric score.
                - name: vector_string
                  type: keyword
                  description: 'The CVSS vector string is a text representation of a set of CVSS metrics. It is commonly used to record or transfer CVSS metric information in a concise form. For example: 3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H.'
                - name: version
                  type: keyword
                  description: The CVSS version.
            - name: cwe_uid
              type: keyword
              description: 'The Common Weakness Enumeration (CWE) unique identifier. For example: CWE-787.'
            - name: cwe_url
              type: keyword
              description: Common Weakness Enumeration (CWE) definition URL.
            - name: modified_time
              type: date
              description: The Record Modified Date identifies when the CVE record was last updated.
            - name: modified_time_dt
              type: date
              description: The Record Modified Date identifies when the CVE record was last updated.
            - name: product
              type: group
              fields:
                - name: feature
                  type: group
                  fields:
                    - name: name
                      type: keyword
                      description: The name of the feature.
                    - name: uid
                      type: keyword
                      description: The unique identifier of the feature.
                    - name: version
                      type: keyword
                      description: The version of the feature.
                - name: lang
                  type: keyword
                  description: The two letter lower case language codes, as defined by ISO 639-1.
                - name: name
                  type: keyword
                  description: The name of the product.
                - name: path
                  type: keyword
                  description: The installation path of the product.
                - name: uid
                  type: keyword
                  description: The unique identifier of the product.
                - name: url_string
                  type: keyword
                  description: The URL pointing towards the product.
                - name: vendor_name
                  type: keyword
                  description: The name of the vendor of the product.
                - name: version
                  type: keyword
                  description: 'The version of the product, as defined by the event source. For example: 2013.1.3-beta.'
            - name: type
              type: keyword
              description: The vulnerability type as selected from a large dropdown menu during CVE refinement.
            - name: uid
              type: keyword
              description: 'The Common Vulnerabilities and Exposures unique number assigned to a specific computer vulnerability. A CVE Identifier begins with 4 digits representing the year followed by a sequence of digits that acts as a unique identifier. For example: CVE-2021-12345.'
        - name: name
          type: keyword
          description: The malware name, as reported by the detection engine.
        - name: path
          type: keyword
          description: The filesystem path of the malware that was observed.
        - name: provider
          type: keyword
          description: The provider of the malware information.
        - name: uid
          type: keyword
          description: The malware unique identifier, as reported by the detection engine. For example a virus id or an IPS signature id.
    - name: message
      type: keyword
      description: The description of the event, as defined by the event source.
    - name: nist
      type: keyword
      description: The NIST Cybersecurity Framework recommendations for managing the cybersecurity risk.
    - name: observables
      type: group
      fields:
        - name: name
          type: keyword
          description: 'The full name of the observable attribute. The name is a pointer/reference to an attribute within the event data. For example: file.name.'
        - name: reputation
          type: group
          fields:
            - name: base_score
              type: double
              description: The reputation score as reported by the event source.
            - name: provider
              type: keyword
              description: The provider of the reputation information.
            - name: score
              type: keyword
              description: The reputation score, normalized to the caption of the score_id value. In the case of 'Other', it is defined by the event source.
            - name: score_id
              type: keyword
              description: The normalized reputation score identifier.
        - name: type
          type: keyword
          description: The observable value type name.
        - name: type_id
          type: keyword
          description: The observable value type identifier.
        - name: value
          type: keyword
          description: The value associated with the observable attribute.
    - name: remediation
      type: group
      fields:
        - name: desc
          type: keyword
          description: The description of the remediation strategy.
        - name: kb_articles
          type: keyword
          description: The KB article/s related to the entity.
        - name: kb_article_list
          type: flattened
          description: A list of KB articles or patches related to an endpoint.
        - name: references
          type: keyword
          description: A list of supporting URL/s, references that help describe the remediation strategy.
    - name: raw_data
      type: flattened
      description: The event data as received from the event source.
    - name: raw_data_keyword
      type: keyword
    - name: risk_level
      type: keyword
      description: The risk level, normalized to the caption of the risk_level_id value. In the case of 'Other', it is defined by the event source.
    - name: risk_level_id
      type: keyword
      description: The normalized risk level id.
    - name: risk_score
      type: long
      description: The risk score as reported by the event source.
    - name: severity
      type: keyword
      description: The event severity, normalized to the caption of the severity_id value. In the case of 'Other', it is defined by the event source.
    - name: severity_id
      type: long
      description: The normalized identifier of the event severity. The normalized severity is a measurement the effort and expense required to manage and resolve an event or incident. Smaller numerical values represent lower impact events, and larger numerical values represent higher impact events.
    - name: start_time
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: start_time_dt
      type: date
      description: The start time of a time period, or the time of the least recent event included in the aggregate event.
    - name: state
      type: keyword
      description: The normalized state of a security finding.
    - name: state_id
      type: keyword
      description: The normalized state identifier of a security finding.
    - name: status
      type: keyword
      description: The event status, normalized to the caption of the status_id value. In the case of 'Other', it is defined by the event source.
    - name: status_code
      type: keyword
      description: The event status code, as reported by the event source. For example, in a Windows Failed Authentication event, this would be the value of 'Failure Code', e.g. 0x18.
    - name: status_detail
      type: keyword
      description: The status details contains additional information about the event outcome.
    - name: status_id
      type: keyword
      description: The normalized identifier of the event status.
    - name: time
      type: date
      description: The normalized event occurrence time.
    - name: time_dt
      type: date
      description: The normalized event occurrence time.
    - name: timezone_offset
      type: long
      description: The number of minutes that the reported event time is ahead or behind UTC, in the range -1,080 to +1,080.
    - name: type_name
      type: keyword
      description: The event type name, as defined by the type_uid.
    - name: type_uid
      type: keyword
      description: 'The event type ID. It identifies the events semantics and structure. The value is calculated by the logging system as: class_uid * 100 + activity_id.'
    - name: unmapped
      type: flattened
      description: The attributes that are not mapped to the event schema. The names and values of those attributes are specific to the event source.
