- external: ecs
  name: ecs.version
- external: ecs
  name: message
- external: ecs
  name: error.message
- external: ecs
  name: event.category
- external: ecs
  name: event.ingested
- external: ecs
  name: event.kind
- external: ecs
  name: event.original
- external: ecs
  name: event.created
- external: ecs
  name: tags
- external: ecs
  name: threat.indicator.name
- external: ecs
  name: threat.indicator.confidence
- external: ecs
  name: threat.indicator.provider
- external: ecs
  name: threat.indicator.url.original
- external: ecs
  name: threat.indicator.url.domain
- external: ecs
  name: threat.indicator.type
- external: ecs
  name: threat.indicator.description
- external: ecs
  name: threat.indicator.modified_at
- external: ecs
  name: threat.indicator.last_seen
- external: ecs
  name: threat.feed.name
# Below fields to be moved into base-fields.yml after kibana.version changed to >= 8.14 
# Related to fix: https://github.com/elastic/kibana/pull/177608
- name: event.module
  type: constant_keyword
  description: Event module
  value: ti_eset
- name: event.dataset
  type: constant_keyword
  description: Event dataset
  value: ti_eset.domains
