- name: Tenant
  type: keyword
- name: category
  type: keyword
- name: operationName
  type: keyword
- name: properties
  type: group
  fields:
  - name: Timestamp
    type: date
  - name: TargetDeviceName
    type: keyword
  - name: DestinationIPAddress
    type: ip
  - name: DestinationPort
    type: long
  - name: DeviceName
    type: keyword
  - name: IPAddress
    type: keyword
  - name: OSPlatform
    type: keyword
  - name: DeviceType
    type: keyword
  - name: Protocol
    type: keyword
  - name: AccountDomain
    type: keyword
  - name: AccountSid
    type: keyword
  - name: AccountName
    type: keyword
  - name: AccountDisplayName
    type: keyword
  - name: AccountObjectId
    type: keyword
  - name: AccountUpn
    type: keyword
  - name: ActionType
    type: keyword
  - name: AdditionalFields
    type: keyword
  - name: Application
    type: keyword
  - name: DestinationDeviceName
    type: keyword
  - name: FailureReason
    type: keyword
  - name: Isp
    type: keyword
  - name: Location
    type: keyword
  - name: LogonType
    type: keyword
  - name: Port
    type: long
  - name: ReportId
    type: keyword
  - name: TargetAccountDisplayName
    type: keyword
  - name: IsAdminOperation
    type: boolean
  - name: Query
    type: keyword
  - name: QueryTarget
    type: keyword
  - name: QueryType
    type: keyword
  - name: TargetAccountUpn
    type: keyword
  - name: ISP
    type: keyword
  - name: AccountId
    type: keyword
  - name: AccountType
    type: keyword
  - name: ActivityObjects
    type: keyword
  - name: ActivityType
    type: keyword
  - name: AppInstanceId
    type: long
  - name: ApplicationId
    type: keyword
  - name: City
    type: keyword
  - name: CountryCode
    type: keyword
  - name: IPCategory
    type: keyword
  - name: IPTags
    type: keyword
  - name: IsAnonymousProxy
    type: keyword
  - name: IsExternalUser
    type: boolean
  - name: IsImpersonated
    type: boolean
  - name: ObjectId
    type: keyword
  - name: ObjectName
    type: keyword
  - name: ObjectType
    type: keyword
  - name: RawEventData
    type: group
    fields:
    - name: ChatThreadId
      type: keyword
    - name: CommunicationType
      type: keyword
    - name: CreationTime
      type: date
    - name: ExtraProperties
      type: keyword
    - name: Id
      type: keyword
    - name: ItemName
      type: keyword
    - name: MessageId
      type: keyword
    - name: MessageVersion
      type: keyword
    - name: MessageVisibilityTime
      type: date
    - name: Operation
      type: keyword
    - name: OrganizationId
      type: keyword
    - name: ParticipantInfo
      type: group
      fields:
      - name: HasForeignTenantUsers
        type: boolean
      - name: HasGuestUsers
        type: boolean
      - name: HasOtherGuestUsers
        type: boolean
      - name: HasUnauthenticatedUsers
        type: boolean
      - name: ParticipatingDomains
        type: keyword
      - name: ParticipatingSIPDomains
        type: keyword
      - name: ParticipatingTenantIds
        type: keyword
    - name: RecordType
      type: long
    - name: ResourceTenantId
      type: keyword
    - name: UserId
      type: keyword
    - name: UserKey
      type: keyword
    - name: UserType
      type: long
    - name: Version
      type: long
    - name: Workload
      type: keyword
  - name: UserAgent
    type: keyword
  - name: UserAgentTags
    type: keyword
  - name: Address
    type: keyword
  - name: BlastRadius
    type: keyword
  - name: ChangeSource
    type: keyword
  - name: CloudSid
    type: keyword
  - name: CompanyName
    type: keyword
  - name: Country
    type: keyword
  - name: CreatedDateTime
    type: date
  - name: CriticalityLevel
    type: keyword
  - name: DeletedDateTime
    type: keyword
  - name: Department
    type: keyword
  - name: DistinguishedName
    type: keyword
  - name: EmailAddress
    type: keyword
  - name: EmployeeId
    type: keyword
  - name: GivenName
    type: keyword
  - name: IsAccountEnabled
    type: boolean
  - name: JobTitle
    type: keyword
  - name: Manager
    type: keyword
  - name: OnPremSid
    type: keyword
  - name: OtherMailAddresses
    type: keyword
  - name: Phone
    type: keyword
  - name: RiskLevel
    type: keyword
  - name: RiskLevelDetails
    type: keyword
  - name: SipProxyAddress
    type: keyword
  - name: SourceProvider
    type: keyword
  - name: State
    type: keyword
  - name: Surname
    type: keyword
  - name: Tags
    type: keyword
  - name: Type
    type: keyword
  - name: AuditSource
    type: keyword
  - name: LastSeenForUser
    type: keyword
  - name: OAuthAppId
    type: keyword
  - name: SessionData
    type: keyword
  - name: UncommonForUser
    type: keyword
  - name: AlertId
    type: keyword
  - name: DeviceId
    type: keyword
  - name: EmailSubject
    type: keyword
  - name: EntityType
    type: keyword
  - name: EvidenceDirection
    type: keyword
  - name: EvidenceRole
    type: keyword
  - name: FileName
    type: keyword
  - name: FileSize
    type: long
  - name: FolderPath
    type: keyword
  - name: LocalIP
    type: ip
  - name: MachineGroup
    type: keyword
  - name: NetworkMessageId
    type: keyword
  - name: OAuthApplicationId
    type: keyword
  - name: ProcessCommandLine
    type: keyword
  - name: RegistryKey
    type: keyword
  - name: RegistryValueData
    type: keyword
  - name: RegistryValueName
    type: keyword
  - name: RemoteIP
    type: ip
  - name: RemoteUrl
    type: keyword
  - name: SHA1
    type: keyword
  - name: SHA256
    type: keyword
  - name: ServiceSource
    type: keyword
  - name: ThreatFamily
    type: keyword
  - name: AttackTechniques
    type: keyword
  - name: Category
    type: keyword
  - name: DetectionSource
    type: keyword
  - name: Severity
    type: keyword
  - name: Title
    type: keyword
  - name: AppGuardContainerId
    type: keyword
  - name: CreatedProcessSessionId
    type: keyword
  - name: InitiatingProcessAccountDomain
    type: keyword
  - name: InitiatingProcessAccountName
    type: keyword
  - name: InitiatingProcessAccountObjectId
    type: keyword
  - name: InitiatingProcessAccountSid
    type: keyword
  - name: InitiatingProcessAccountUpn
    type: keyword
  - name: InitiatingProcessCommandLine
    type: keyword
  - name: InitiatingProcessCreationTime
    type: keyword
  - name: InitiatingProcessFileName
    type: keyword
  - name: InitiatingProcessFileSize
    type: keyword
  - name: InitiatingProcessFolderPath
    type: keyword
  - name: InitiatingProcessId
    type: long
  - name: InitiatingProcessIntegrityLevel
    type: keyword
  - name: InitiatingProcessLogonId
    type: long
  - name: InitiatingProcessMD5
    type: keyword
  - name: InitiatingProcessParentCreationTime
    type: keyword
  - name: InitiatingProcessParentFileName
    type: keyword
  - name: InitiatingProcessParentId
    type: long
  - name: InitiatingProcessRemoteSessionDeviceName
    type: keyword
  - name: InitiatingProcessRemoteSessionIP
    type: keyword
  - name: InitiatingProcessSHA1
    type: keyword
  - name: InitiatingProcessSHA256
    type: keyword
  - name: InitiatingProcessSessionId
    type: keyword
  - name: InitiatingProcessSignatureStatus
    type: keyword
  - name: InitiatingProcessSignerType
    type: keyword
  - name: InitiatingProcessTokenElevation
    type: keyword
  - name: InitiatingProcessVersionInfoCompanyName
    type: keyword
  - name: InitiatingProcessVersionInfoFileDescription
    type: keyword
  - name: InitiatingProcessVersionInfoInternalFileName
    type: keyword
  - name: InitiatingProcessVersionInfoOriginalFileName
    type: keyword
  - name: InitiatingProcessVersionInfoProductName
    type: keyword
  - name: InitiatingProcessVersionInfoProductVersion
    type: keyword
  - name: IsInitiatingProcessRemoteSession
    type: boolean
  - name: IsProcessRemoteSession
    type: boolean
  - name: LogonId
    type: keyword
  - name: MD5
    type: keyword
  - name: ProcessCreationTime
    type: keyword
  - name: ProcessId
    type: keyword
  - name: ProcessIntegrityLevel
    type: keyword
  - name: ProcessRemoteSessionDeviceName
    type: keyword
  - name: ProcessRemoteSessionIP
    type: keyword
  - name: ProcessTokenElevation
    type: keyword
  - name: ProcessVersionInfoCompanyName
    type: keyword
  - name: ProcessVersionInfoFileDescription
    type: keyword
  - name: ProcessVersionInfoInternalFileName
    type: keyword
  - name: ProcessVersionInfoOriginalFileName
    type: keyword
  - name: ProcessVersionInfoProductName
    type: keyword
  - name: ProcessVersionInfoProductVersion
    type: keyword
  - name: FileOriginIP
    type: keyword
  - name: FileOriginUrl
    type: keyword
  - name: LocalPort
    type: long
  - name: RemoteDeviceName
    type: keyword
  - name: RemotePort
    type: long
  - name: CertificateCountersignatureTime
    type: date
  - name: CertificateCreationTime
    type: date
  - name: CertificateExpirationTime
    type: date
  - name: CertificateSerialNumber
    type: keyword
  - name: CrlDistributionPointUrls
    type: keyword
  - name: IsRootSignerMicrosoft
    type: boolean
  - name: IsSigned
    type: boolean
  - name: IsTrusted
    type: boolean
  - name: Issuer
    type: keyword
  - name: IssuerHash
    type: keyword
  - name: SignatureType
    type: keyword
  - name: Signer
    type: keyword
  - name: SignerHash
    type: keyword
  - name: FileOriginReferrerUrl
    type: keyword
  - name: IsAzureInfoProtectionApplied
    type: keyword
  - name: PreviousFileName
    type: keyword
  - name: PreviousFolderPath
    type: keyword
  - name: RequestAccountDomain
    type: keyword
  - name: RequestAccountName
    type: keyword
  - name: RequestAccountSid
    type: keyword
  - name: RequestProtocol
    type: keyword
  - name: RequestSourceIP
    type: keyword
  - name: RequestSourcePort
    type: keyword
  - name: SensitivityLabel
    type: keyword
  - name: SensitivitySubLabel
    type: keyword
  - name: ShareName
    type: keyword
  - name: AadDeviceId
    type: keyword
  - name: AssetValue
    type: keyword
  - name: IsInternetFacing
    type: keyword
  - name: DeviceManualTags
    type: keyword
  - name: DeviceDynamicTags
    type: keyword
  - name: ExposureLevel
    type: keyword
  - name: SensorHealthState
    type: keyword
  - name: ExclusionReason
    type: keyword
  - name: IsExcluded
    type: boolean
  - name: ClientVersion
    type: keyword
  - name: DeviceCategory
    type: keyword
  - name: DeviceSubtype
    type: keyword
  - name: IsAzureADJoined
    type: boolean
  - name: JoinType
    type: keyword
  - name: LoggedOnUsers
    type: keyword
  - name: MergedDeviceIds
    type: keyword
  - name: MergedToDeviceId
    type: keyword
  - name: Model
    type: keyword
  - name: OSArchitecture
    type: keyword
  - name: OSBuild
    type: keyword
  - name: OSDistribution
    type: keyword
  - name: OSVersion
    type: keyword
  - name: OSVersionInfo
    type: keyword
  - name: OnboardingStatus
    type: keyword
  - name: PublicIP
    type: ip
  - name: RegistryDeviceTag
    type: keyword
  - name: Vendor
    type: keyword
  - name: IsLocalAdmin
    type: keyword
  - name: RemoteIPType
    type: keyword
  - name: LocalIPType
    type: keyword
  - name: ConnectedNetworks
    type: keyword
  - name: DefaultGateways
    type: keyword
  - name: DnsAddresses
    type: keyword
  - name: IPAddresses
    type: keyword
  - name: IPv4Dhcp
    type: keyword
  - name: IPv6Dhcp
    type: keyword
  - name: MacAddress
    type: keyword
  - name: NetworkAdapterName
    type: keyword
  - name: NetworkAdapterStatus
    type: keyword
  - name: NetworkAdapterType
    type: keyword
  - name: NetworkAdapterVendor
    type: keyword
  - name: TunnelType
    type: keyword
  - name: PreviousRegistryKey
    type: keyword
  - name: PreviousRegistryValueData
    type: keyword
  - name: PreviousRegistryValueName
    type: keyword
  - name: RegistryValueType
    type: keyword
  - name: DetectionMethods
    type: keyword
  - name: FileType
    type: keyword
  - name: RecipientEmailAddress
    type: keyword
  - name: RecipientObjectId
    type: keyword
  - name: SenderDisplayName
    type: keyword
  - name: SenderFromAddress
    type: keyword
  - name: SenderObjectId
    type: keyword
  - name: ThreatNames
    type: keyword
  - name: ThreatTypes
    type: keyword
  - name: AttachmentCount
    type: long
  - name: AuthenticationDetails
    type: keyword
  - name: ConfidenceLevel
    type: keyword
  - name: Connectors
    type: keyword
  - name: DeliveryAction
    type: keyword
  - name: DeliveryLocation
    type: keyword
  - name: EmailAction
    type: keyword
  - name: EmailActionPolicy
    type: keyword
  - name: EmailActionPolicyGuid
    type: keyword
  - name: EmailClusterId
    type: long
  - name: EmailDirection
    type: keyword
  - name: EmailLanguage
    type: keyword
  - name: InternetMessageId
    type: keyword
  - name: OrgLevelAction
    type: keyword
  - name: OrgLevelPolicy
    type: keyword
  - name: SenderFromDomain
    type: keyword
  - name: SenderIPv4
    type: ip
  - name: SenderIPv6
    type: keyword
  - name: SenderMailFromAddress
    type: keyword
  - name: SenderMailFromDomain
    type: keyword
  - name: Subject
    type: keyword
  - name: UrlCount
    type: long
  - name: UserLevelAction
    type: keyword
  - name: UserLevelPolicy
    type: keyword
  - name: Url
    type: keyword
  - name: UrlDomain
    type: keyword
  - name: UrlLocation
    type: keyword
  - name: ActionResult
    type: keyword
  - name: ActionTrigger
    type: keyword
  - name: Action
    type: keyword
  - name: IsClickedThrough
    type: boolean
  - name: UrlChain
    type: keyword
  - name: Workload
    type: keyword
- name: tenantId
  type: keyword
- name: time
  type: date
- name: _TimeReceivedBySvc
  type: date
